{"thread":{"uuid":"067a02e0ccfab7270d8abda3f53fa2a9e8926270","url":"https://www.bovinevetonline.com/news/veterinary-education/evolving-expectations-was-accomplished-2023-aabp-annual-conference","site_full":"www.bovinevetonline.com","site":"bovinevetonline.com","site_section":"https://bovinevetonline.com/news","site_categories":["media"],"section_title":"News | Bovine Veterinarian","title":"“Evolving Expectations” was Accomplished at the 2023 AABP Annual Conference | Bovine Veterinarian","title_full":"“Evolving Expectations” was Accomplished at the 2023 AABP Annual Conference | Bovine Veterinarian","published":"2023-11-03T07:00:00.000+02:00","replies_count":0,"participants_count":1,"site_type":"news","country":"US","main_image":"","performance_score":0,"domain_rank":555111,"domain_rank_updated":"2023-10-31T12:17:11.000+02:00","reach":null,"social":{"facebook":{"likes":0,"comments":0,"shares":0},"gplus":{"shares":0},"pinterest":{"shares":0},"linkedin":{"shares":0},"stumbledupon":{"shares":0},"vk":{"shares":0}}},"uuid":"067a02e0ccfab7270d8abda3f53fa2a9e8926270","url":"https://www.bovinevetonline.com/news/veterinary-education/evolving-expectations-was-accomplished-2023-aabp-annual-conference","ord_in_thread":0,"parent_url":null,"author":"Geni Wren","published":"2023-11-03T07:00:00.000+02:00","title":"“Evolving Expectations” was Accomplished at the 2023 AABP Annual Conference | Bovine Veterinarian","text":"“Evolving Expectations” was Accomplished at the 2023 AABP Annual Conference The American Association of Bovine Practitioners (AABP) 2023 56th Annual Conference Sept. 21-23 in Milwaukee, Wis., met the meaning of the conference theme “Evolving Expectations”. Beef and dairy veterinarians, students and veterinary technicians gathered for one of the largest annual conferences to date and gained excellent continuing education. Preconference seminars were held earlier in the week for in-depth instruction on a variety of topics. “Considering the conference theme, ‘Evolving Expectations’, ample evidence was on exhibit that the AABP has most assuredly continued to evolve, expanding its activities and impacts related to its mission to provide support, continuing education and advocacy for current and future veterinary professionals and the cattle they serve,” says now-AABP Past President Dr. Sandra Godden. Godden reports that 306 students participated in the conference. “Equally exciting is the fact that a recent AABP demographics report indicated that nearly 20% of our student members identify as non-white, significantly more than our current veterinary membership. This statistic suggests that the AABP is on the right road to enhancing diversity within our profession.” Godden notes that the AABP’s expanding efforts to reduce student debt, thereby assisting students to continue on the track of pursuing bovine medicine, was also on display. “Over the past year, the AABP dispensed over $84,000 to support externship and education grants, and at this annual meeting AABP awarded $323,000 in scholarships to our future colleagues,” she says. “But perhaps most encouraging was the obvious excitement, enthusiasm and optimism expressed by students in hallway conversations. Our challenge now is to keep these exceptional young people, our future members and leaders, engaged and motivated, thereby ensuring that we have a very bright future for our profession and our organization.” Keynote speaker Sara Frasca spoke on “The Journey of Innovation” and said, “Everyone needs to harness the most powerful technology in the world – human creativity. Our one source of sustainable competitive advantage.” Her uplifting, humorous and inspirational talk encouraged those in attendance to use their creativity and think outside of the box to find innovative solutions to problems and situations. “Over 1,100 veterinarians and more than 300 students came together to make this one of the most well-attended conferences in recent history,” says 2023 Program Chair and AABP President Michael Capel. “'Evolving Expectations’ served as the perfect theme for this year’s conference. The keynote speaker, Sara Frasca, was dynamic and inspiring as she gave real world examples of how people and businesses successfully evolved to perform at a high level and remain relevant. She helped give members the confidence that we aren’t alone and that we can overcome our own challenges.” Capel adds that attendees attended a variety of CE options including clinical and technical skills, cutting edge research, practice management and relevant industry topics designed to provide information that was not only real world and practical, but also challenging and inspiring. The 2023 conference gave in-person attendees up to 24.25 hours of continuing education on beef, dairy, clinical stills, practice management, joint beef/dairy sessions, research summaries, small ruminants, student/new graduate topics, practice tips and other sessions, plus preconference seminars and clinical forums. Awards, a scholarship auction, a 5K and $323,000 in scholarships were also high points of the conference. “It was wonderful to see the conference attendance return to our historical numbers,” notes AABP Executive Director Dr. K. Fred Gingrich, II. “We are appreciative of our members, guests and students who attended. I am also very thankful for our sponsors and volunteers who assist the AABP office in planning, as well as providing funding for our social events. A special thank you to Dr. Capel and his program committee for their work in helping our members grow with the evolving expectations of our clients and society as a whole.” Smartphone technology was heavily used at the 2023 conference with attendees having the ability to scan QR codes for schedules, auction item viewing, donation opportunities and more. The Slido app was also used for attendees to ask questions during presentations and for presenters to conduct polls on the fly during their presentations. Gingrich shares these stats from the 2023 AABP Annual Conference: • 1,124 AABP members • 306 veterinary students • Offered 8 preconference seminars and 7 clinical forum breakfast talks and a symposium for food animal educators and as well as a student lameness seminar • 77 Canadian attendees and 27 attendees from additional countries • Close to 90 exhibitors with 316 exhibitor representatives • 80 5K Stampede Fun Run participants Introduction of the 2023 AABP vice president candidates, Dr. Brandon Treichler and Dr. Mark Hilton gave members a chance to get to know their potential leadership. Find more conference recaps and photos on the AABP Facebook page. #AABP2023 Next up will be the 7th Annual AABP Recent Graduate Conference Feb. 9-10, 2024 in Knoxville, Tenn. The 2024 57th AABP Annual Conference will be held Sept. 12-14, 2024, in Columbus, Ohio. AABP is a membership-based, not-for-profit organization serving cattle veterinary medicine professionals across the United States, Canada and other countries. Visit [https://aabp.org](https://aabp.org) and like us on Facebook.","highlightText":"","highlightTitle":"","highlightThreadTitle":"","language":"english","sentiment":null,"categories":null,"external_links":["https://aabp.org","https://aabp.org)","https://www.aabp.org","https://www.aabp.org)"],"external_images":[],"entities":{"persons":[{"name":"godden","sentiment":"none"},{"name":"sandra godden","sentiment":"none"}],"organizations":[{"name":"aabp","sentiment":"none"},{"name":"bovine practitioners","sentiment":"none"}],"locations":[{"name":"milwaukee","sentiment":"none"},{"name":"wis.","sentiment":"none"}]},"rating":null,"crawled":"2023-11-04T13:07:00.886+02:00","updated":"2023-11-04T13:07:00.886+02:00"}