{"thread":{"uuid":"08cc4aec0f66f7718a73a1867c8f71e26227e3aa","url":"https://himachalabhiabhi.com/pmgkay-extended-for-another-5-year-announced-pm-modi/","site_full":"himachalabhiabhi.com","site":"himachalabhiabhi.com","site_section":"https://himachalabhiabhi.com/feed","site_categories":["media"],"section_title":"Himachal Abhi Abhi","title":"अगले 5 साल तक जारी रहेगी केंद्र की मुफ्त राशन योजना, पीएम का ऐलान","title_full":"अगले 5 साल तक जारी रहेगी केंद्र की मुफ्त राशन योजना, पीएम का ऐलान","published":"2023-11-04T12:59:00.000+02:00","replies_count":0,"participants_count":1,"site_type":"news","country":null,"main_image":"https://himachalabhiabhi.com/wp-content/uploads/2023/11/pmgkay-extended-for-another.jpg","performance_score":0,"domain_rank":null,"domain_rank_updated":null,"reach":null,"social":{"facebook":{"likes":0,"comments":0,"shares":0},"gplus":{"shares":0},"pinterest":{"shares":0},"linkedin":{"shares":0},"stumbledupon":{"shares":0},"vk":{"shares":0}}},"uuid":"08cc4aec0f66f7718a73a1867c8f71e26227e3aa","url":"https://himachalabhiabhi.com/pmgkay-extended-for-another-5-year-announced-pm-modi/","ord_in_thread":0,"parent_url":null,"author":"Soumitra Roy","published":"2023-11-04T12:59:00.000+02:00","title":"अगले 5 साल तक जारी रहेगी केंद्र की मुफ्त राशन योजना, पीएम का ऐलान","text":"-\nAdvertisement\nअगले 5 साल तक जारी रहेगी केंद्र की मुफ्त राशन योजना, पीएम का ऐलान\nLatest News/ Nov 04 2023/8 mins ago\nLast Updated on November 4, 2023 by\nSoumitra Roy\nनई दिल्ली।\nआगामी लोकसभा चुनाव (Next General Election) से पहले बड़ा ऐलान करते हुए पीएम नरेंद्र मोदी (PM Modi) ने कहा है कि केंद्र की बीजेपी सरकार ने मुफ्त राशन योजना (Free Ration Scheme) को अगले 5 साल तक जारी रखने का फैसला किया है। उन्होंने कहा कि देश के लोगों का आशीर्वाद और प्यार उन्हें पवित्र निर्णय लेने की ताकत देता है। पीएम ने शनिवार को छत्तीसगढ़ के दुर्ग (Durg In Chhattisgarh) में एक चुनावी सभा को संबोधित करते हुए यह ऐलान किया।\nहर महीने मिलता है 5 किलो गेहूं-चावल\nप्रधानमंत्री गरीब कल्याण योजना के तहत देशभर के BPL\nराशनकार्ड धारकों (BPL Card Holders) को प्रति महीने प्रति व्यक्ति 5 किलोग्राम अनाज (गेंहू और चावल) मुफ्त दिया जाता है। कोरोना महामारी (Covid Period) की शुरुआत के समय मार्च 2020 में पीएम मोदी ने इस योजना का ऐलान किया था। अप्रैल 2020 से शुरू हुई इस योजना को राष्ट्रीय खाद्य सुरक्षा अधिनियम (NFSA) में विलय करके दिसंबर 2023 तक बढ़ाया गया था। केंद्र सरकार ने योजना की अवधि को और आगे बढ़ा दिया है।\nराष्ट्रीय खाद्य सुरक्षा अधिनियम क्या है?\nकांग्रेस के नेतृत्व वाली UPA-2 सरकार ने 2013 में राष्ट्रीय खाद्य सुरक्षा अधिनियम बनाया था। ये कानून कांग्रेस की तत्कालीन अध्यक्ष सोनिया गांधी की देन है। ये स्वतंत्र भारत के इतिहास का पहला ऐसा कानून है, जिसमें भोजन का अधिकार (Right To Food) दिया गया है। 2011 की जनगणना के आधार पर देश की 67 फीसदी आबादी (75 फीसदी ग्रामीण और 50 फीसदी शहरी) को इस कानून के दायरे में लाया गया है।\nकेंद्र पर 10 लाख करोड़ रुपये का बोझ\nकेंद्र सरकार के अनुसार,\n गरीब कल्याण योजना (PM Garib Kalyan Yojana) का लाभ देश के 80 करोड़ BPL कार्ड धारक परिवारों को मिलता है। इस योजना को अब सरकार ने 5 साल आगे बढ़ाने का ऐलान किया है। सरकार एक साल तक सभी लाभार्थी परिवारों को मुफ्त राशन मुहैया कराने के लिए 2 लाख करोड़ रुपये का खर्च उठाती है। योजना के विस्तार के लिए सरकार को 10 लाख करोड़ रुपये का अतिरिक्त आर्थिक बोझ उठाना पड़ेगा।\nगरीबी, भुखमरी रोकने में कामयाब- IMF\nपिछले साल अंतरराष्ट्रीय मुद्रा कोष (IMF) की एक अध्ययन रिपोर्ट में कहा गया था कि कोरोना वायरस महामारी के दौरान भारत सरकार की प्रधानमंत्री गरीब कल्याण योजना काफी हद तक गरीबी को रोकने में कामयाब रही। रिपोर्ट के अनुसार, इस योजना के कारण महामारी के दौरान भी देश में अत्यंत गरीबों की संख्या में वृद्धि नहीं हुई। इससे पहले हुए कुछ अध्ययनों में महामारी के कारण भारत में अत्यंत गरीबी बढ़ने की आशंका व्यक्त की गई थी।\nयह भी पढ़े:\nदिवाली पर HRTC चलाएगा 174 स्पेशल बसें, छुट्टियों पर घर आना हुआ आसान\nहिमाचल और देश-दुनिया की ताजा अपडेट के लिए Follow the Himachal Abhi Abhi WhatsApp Channel\nAdvertisement\n[](javascript:void(0))","highlightText":"","highlightTitle":"","highlightThreadTitle":"","language":"hindi","sentiment":null,"categories":null,"external_links":["https://whatsapp.com/channel/0029VaAkrqHAojYkrliy0333","https://www.whatsapp.com/channel/0029VaAkrqHAojYkrliy0333"],"external_images":[],"entities":{"persons":[],"organizations":[],"locations":[]},"rating":null,"crawled":"2023-11-04T13:11:16.545+02:00","updated":"2023-11-04T13:11:16.545+02:00"}