{"thread":{"uuid":"2f4f512ff55360fcaa98ca04a31b74c94d67812e","url":"https://jobs.compassgroupcareers.com/USA/job/Melbourne-COOK-%28FULL-TIME%29-FL-32904/1094599700/","site_full":"jobs.compassgroupcareers.com","site":"compassgroupcareers.com","site_section":"http://jobs.oodle.com//?v=rss","site_categories":["job_search","jobs"],"section_title":"","title":"Cook (Full Time) (Compass Group)","title_full":"Cook (Full Time) (Compass Group)","published":"2023-11-04T11:52:00.000+02:00","replies_count":0,"participants_count":0,"site_type":"news","country":"US","main_image":"","performance_score":0,"domain_rank":265851,"domain_rank_updated":"2023-10-31T12:16:22.000+02:00","reach":null,"social":{"facebook":{"likes":0,"comments":0,"shares":0},"gplus":{"shares":0},"pinterest":{"shares":0},"linkedin":{"shares":0},"stumbledupon":{"shares":0},"vk":{"shares":0}}},"uuid":"2f4f512ff55360fcaa98ca04a31b74c94d67812e","url":"https://jobs.compassgroupcareers.com/USA/job/Melbourne-COOK-%28FULL-TIME%29-FL-32904/1094599700/","ord_in_thread":0,"parent_url":null,"author":null,"published":"2023-11-04T11:52:00.000+02:00","title":"Cook (Full Time) (Compass Group)","text":"COOK (FULL TIME)\nDate: Nov 3, 2023\nLocation: Melbourne, FL, US, 32904\nCompany: Compass Group\n- We are hiring immediately for a full time COOK position.\n- Location: Northrop Grumman Melbourne - 2000 West Nasa Boulevard Melbourne, FL 32904 Note: online applications accepted only.\n- Schedule: Full time schedule. Monday - Friday, 6:00 am - 3:00 pm. More details upon interview.\n- Requirement: Previous kitchen experience is required.\n- *Internal Employee Referral Bonus Available\n- Starting Pay: $15.00 per hour\nWe Make Applying Easy! Want to apply to this job via text messaging? Text JOB to 75000 and search requisition ID number 1249129.\nThe advertised program is a conversational recruiting assistant that helps you apply to jobs with Compass Group. Message frequency varies. Message and data rates may apply. Text STOP to opt out or HELP for help. Terms and conditions:\nhttp://olivia.paradox.ai/moSkg\nDiversity of thought and inclusion for all is what drives our success - we invite you to start your journey with us today!\nEurest is recognized worldwide for standards of service and excellence within the foodservice industry. Embracing an ownership mindset, Eurest leverages global resources, promotes a local presence and enriches the communities we serve. The Eurest Promise, “connect with people, inspire through food, create solutions, and live our promise,” is exemplified throughout our organization. Eurest is proud to serve the world’s most respected successful corporations, including many of the Fortune 500.\nJob Summary\nSummary: Prepares food in accordance with applicable federal, state and corporate standards, guidelines and regulations with established policies and procedures. Ensures quality food service is provided at all times.\nEssential Duties and Responsibilities:\n- Prepares high-quality food items according to standardized recipes and instructions to meet production, delivery and service schedules.\n- Serves meals or prepares for delivery by using correct portioning, meeting outlined standards, ensuring that food is at the correct temperature and is attractive and tasty. Tastes all prepared food items.\n- Uses established ticket collection procedures during service. Responsible for records from area worked during service periods.\n- Cleans kitchen after preparation and serving, maintaining high standards of cleanliness. Stores or discards excess food in accordance with safe food-handling procedures.\n- Keeps refrigerators and storerooms clean and neat. Ensures food and supply items are stored per standards.\n- Operates and maintains kitchen equipment as instructed.\n- Assists in production planning, record keeping and reporting as required.\n- Assists in the ordering and receiving of all food and supplies as required.\n- Reports needed maintenance, faulty equipment or accidents to the supervisor immediately.\n- Attends in-service and safety meetings.\n- Maintains good working relationships with coworkers, customers, administrators and managers.\n- Performs job safely while maintaining a clean, safe work environment.\n- Performs other duties as assigned.\nAssociates at Eurest are offered many fantastic benefits.\nFull-time and part-time positions offer the following benefits to associates: Retirement Plan, Associate Shopping Program, Health and Wellness Programs, Discount Marketplace, Identity Theft Protection, Pet Insurance, Voluntary Benefits, including Critical Illness Insurance, Accident Insurance, Hospital Indemnity Insurance, Legal Services, and Choice Auto and Home Program\nFull-time positions also offer the following benefits to associates: Medical, Dental, Vision, Life Insurance/AD, Disability Insurance, Commuter Benefits, Employee Assistance Program, Flexible Spending Accounts (FSAs)\nAbout Compass Group: Achieving leadership in the foodservice industry\nCompass Group is an equal opportunity employer. At Compass, we are committed to treating all Applicants and Associates fairly based on their abilities, achievements, and experience without regard to race, national origin, sex, age, disability, veteran status, sexual orientation, gender identity, or any other classification protected by law.\nQualified candidates must be able to perform the essential functions of this position satisfactorily with or without a reasonable accommodation. Disclaimer: this job post is not necessarily an exhaustive list of all essential responsibilities, skills, tasks, or requirements associated with this position. While this is intended to be an accurate reflection of the position posted, the Company reserves the right to modify or change the essential functions of the job based on business necessity. *We will consider for employment all qualified applicants, including those with a criminal history (including relevant driving history), in a manner consistent with all applicable federal, state, and local laws, including the City of Los Angeles’ Fair Chance Initiative for Hiring Ordinance, the San Francisco Fair Chance Ordinance, and the New York Fair Chance Act.\nEurest maintains a drug-free workplace.\nReq ID: 1249129\n[[req_classification]]\nNearest Major Market: Melbourne\nJob Segment: Food Service, Kitchen, Chef, Hospitality","highlightText":"","highlightTitle":"","highlightThreadTitle":"","language":"english","sentiment":null,"categories":null,"external_links":["https://nam11.safelinks.protection.outlook.com/?url=http%3A%2F%2Folivia.paradox.ai%2FmoSkg&data=05%7C01%7CKathleen.McDermid%40compass-usa.com%7C859493b20a6f466fd4da08db517cadc0%7Ccd62b7dd4b4844bd90e7e143a22c8ead%7C0%7C0%7C638193368152930337%7CUnknown%7CTWFpbGZsb3d8eyJWIjoiMC4wLjAwMDAiLCJQIjoiV2luMzIiLCJBTiI6Ik1haWwiLCJXVCI6Mn0%3D%7C3000%7C%7C%7C&sdata=Galm3rHPK6vJZl3z7SDmTv%2FZfbFG4WOd0kimnSOGH4o%3D&reserved=0","http://olivia.paradox.ai/moSkg","https://www.nam11.safelinks.protection.outlook.com/?url=http%3A%2F%2Folivia.paradox.ai%2FmoSkg&data=05%7C01%7CKathleen.McDermid%40compass-usa.com%7C859493b20a6f466fd4da08db517cadc0%7Ccd62b7dd4b4844bd90e7e143a22c8ead%7C0%7C0%7C638193368152930337%7CUnknown%7CTWFpbGZsb3d8eyJWIjoiMC4wLjAwMDAiLCJQIjoiV2luMzIiLCJBTiI6Ik1haWwiLCJXVCI6Mn0%3D%7C3000%7C%7C%7C&sdata=Galm3rHPK6vJZl3z7SDmTv%2FZfbFG4WOd0kimnSOGH4o%3D&reserved=0","https://nam11.safelinks.protection.outlook.com/","http://www.olivia.paradox.ai/moSkg"],"external_images":[],"entities":{"persons":[],"organizations":[{"name":"compass group","sentiment":"none"},{"name":"eurest","sentiment":"none"},{"name":"northrop grumman melbourne","sentiment":"none"}],"locations":[{"name":"fl","sentiment":"none"},{"name":"melbourne","sentiment":"none"},{"name":"us","sentiment":"none"},{"name":"west nasa boulevard melbourne","sentiment":"none"}]},"rating":null,"crawled":"2023-11-04T13:07:25.992+02:00","updated":"2023-11-04T13:07:25.992+02:00"}