{"thread":{"uuid":"37517e2d05f7d2fd4fb138d5b60505cdb1d23bf5","url":"https://www.kmbc.com/article/the-average-palestinian-gaza-living-2-pieces-bread-day-un-official-says/45740654","site_full":"www.kmbc.com","site":"kmbc.com","site_section":"https://prisons.einnews.com/live_feed","site_categories":["media"],"section_title":"Live Feed Wire - Prisons News Today - EIN Presswire","title":"The average Palestinian in Gaza is living on 2 pieces of bread a day, UN official says","title_full":"The average Palestinian in Gaza is living on 2 pieces of bread a day, UN official says","published":"2023-11-04T12:39:00.000+02:00","replies_count":0,"participants_count":1,"site_type":"news","country":"US","main_image":"https://kubrick.htvapps.com/htv-prod-media.s3.amazonaws.com/images/ap265461c8b12ad5.jpg?crop=1.00xw:0.849xh;0,0.0313xh&amp;resize=1200:*","performance_score":0,"domain_rank":14395,"domain_rank_updated":"2023-10-31T12:15:27.000+02:00","reach":null,"social":{"facebook":{"likes":0,"comments":0,"shares":0},"gplus":{"shares":0},"pinterest":{"shares":0},"linkedin":{"shares":0},"stumbledupon":{"shares":0},"vk":{"shares":0}}},"uuid":"37517e2d05f7d2fd4fb138d5b60505cdb1d23bf5","url":"https://www.kmbc.com/article/the-average-palestinian-gaza-living-2-pieces-bread-day-un-official-says/45740654","ord_in_thread":0,"parent_url":null,"author":"Hannah Lynn","published":"2023-11-04T12:39:00.000+02:00","title":"The average Palestinian in Gaza is living on 2 pieces of bread a day, UN official says","text":"The average Palestinian in Gaza is living on 2 pieces of bread a day, UN official says The average Palestinian in Gaza is living on two pieces of Arabic bread made from flour the United Nations had stockpiled in the region, yet the main refrain now being heard in the street is “Water, water,” the Gaza director for the U.N. agency for Palestinian refugees said Friday. Thomas White, who said he traveled “the length and breadth of Gaza in the last few weeks,” described the place as a \"scene of death and destruction.” No place is safe now, he said, and people fear for their lives, their future and their ability to feed their families. The Palestinian refugee agency, known as UNRWA, is supporting about 89 bakeries across Gaza, aiming to get bread to 1.7 million people, White told diplomats from the U.N.’s 193 member nations in a video briefing from Gaza. But, he said, “now people are beyond looking for bread. It’s looking for water.” U.N. deputy Mideast coordinator Lynn Hastings, who is also the humanitarian coordinator for the Palestinian territories, said only one of three water supply lines from Israel is operational. “Many people are relying on brackish or saline groundwater, if at all,” she said. In the briefing, U.N. humanitarian chief Martin Griffiths also said intense negotiations are taking place among authorities from Israel, Egypt, the United States and United Nations on allowing fuel to enter Gaza. Fuel, he said, is essential for the functioning of institutions, hospitals and the distribution of water and electricity. \"We must allow these supplies reliably, repetitively and dependently into Gaza.” Backup generators, which have been essential to keep hospitals, water desalination plants, food production facilities and other essential services operating, “are one by one grinding to a halt as fuel supplies run out,” Hastings said. White pointed to other major problems. Sewage is not being treated and instead is being pumped into the sea, he said. “But when you speak to municipal workers, the reality is once their fuel runs out, that sewage will flow in the streets.” In addition, he said, cooking gas that was brought into Gaza from Egypt by the private sector before the war is increasingly in short supply. Aid organizations like UNRWA “are not going to be able to step in and replicate the network of distribution by the private sector for this essential item,” he said. White said close to 600,000 people are sheltering in 149 UNRWA facilities, most of them schools, but the agency has lost contact with many in the north, where Israel is carrying intense ground and air operations following Hamas’ surprise Oct. 7 attacks. An average of 4,000 displaced people in Gaza are living in the schools without the resources to maintain proper sanitation, he said. “The conditions are desperate,” with women and children sleeping in the classrooms and men sleeping outside in the open, he said. The U.N. can’t provide them safety, White said, pointing to over 50 UNRWA facilities impacted by the conflict, including five direct hits. “At last count, 38 people have died in our shelters. I fear that with the fighting going on in the north right now, that number is going to grow significantly,” he said. Griffiths, the humanitarian chief, said 72 UNRWA staff members had been killed since Oct. 7. “I think it’s the highest number of U.N. staff lost in a conflict,” he said. The Gaza Health Ministry’s total of more than 9,000 people killed in Gaza is four times as many deaths as during the 50-day conflict between Israel and Hamas in Gaza in 2014, when just over 2,200 Palestinians were killed, Griffiths said. He added that the real toll will only emerge once buildings are cleared and rubble is taken away. Griffiths called for humanitarian pauses to get aid to millions of people. He also urged the immediate release of all hostages and protection of all civilians by both sides as required under international humanitarian law. U.N. Secretary-General Antonio Guterres has repeatedly called for a full cease-fire, and Riyad Mansour, the Palestinian U.N. ambassador, criticized Griffiths for talking about humanitarian pauses, something the United States is also urging. This means “Israel continues killing the Palestinians, but gives us few hours every now and then, in order to get food and other stuff,” Mansour said. He said a cease-fire is essential to save lives, saying that “almost 50% of all the structures in the Gaza Strip” have been destroyed by Israel and the situation for Palestinians “is beyond comprehension and beyond description.” “It requires from all of us to do everything that we can to stop it,” he said.","highlightText":"","highlightTitle":"","highlightThreadTitle":"","language":"english","sentiment":"negative","categories":["Human Interest","Social Issue","War, Conflict and Unrest"],"external_links":[],"external_images":[],"entities":{"persons":[{"name":"white","sentiment":"none"},{"name":"lynn hastings","sentiment":"none"},{"name":"thomas white","sentiment":"none"}],"organizations":[{"name":"un","sentiment":"neutral"},{"name":"unrwa","sentiment":"none"},{"name":"united nations","sentiment":"none"},{"name":"u.n.","sentiment":"none"}],"locations":[{"name":"gaza","sentiment":"none"},{"name":"mideast","sentiment":"none"}]},"rating":null,"crawled":"2023-11-04T13:07:28.218+02:00","updated":"2023-11-04T13:07:28.218+02:00"}