{"thread":{"uuid":"378954273946037b5d816c084cd90968db997f21","url":"https://asianlite.com/2023/top-news/sheikh-hasina-longest-serving-female-leader-transforming-bangladesh/","site_full":"asianlite.com","site":"asianlite.com","site_section":"https://asianlite.com/feed","site_categories":["media"],"section_title":"Asian News from UK ","title":"Sheikh Hasina: Longest-Serving Female Leader, Transforming Bangladesh","title_full":"Sheikh Hasina: Longest-Serving Female Leader, Transforming Bangladesh","published":"2023-11-04T12:30:00.000+02:00","replies_count":0,"participants_count":1,"site_type":"news","country":"US","main_image":"https://asianlite.com/wp-content/uploads/2023/11/Time-Cover-Hasina.jpg","performance_score":0,"domain_rank":371615,"domain_rank_updated":"2023-10-31T12:16:44.000+02:00","reach":null,"social":{"facebook":{"likes":0,"comments":0,"shares":0},"gplus":{"shares":0},"pinterest":{"shares":0},"linkedin":{"shares":0},"stumbledupon":{"shares":0},"vk":{"shares":0}}},"uuid":"378954273946037b5d816c084cd90968db997f21","url":"https://asianlite.com/2023/top-news/sheikh-hasina-longest-serving-female-leader-transforming-bangladesh/","ord_in_thread":0,"parent_url":null,"author":"Newsdesk","published":"2023-11-04T12:30:00.000+02:00","title":"Sheikh Hasina: Longest-Serving Female Leader, Transforming Bangladesh","text":"Having already won more elections than late Prime Minister Margaret Thatcher or Indira Gandhi, Hasina is determined to extend that run at the ballot box in January.\nAt 76-years-old, Bangladesh Prime Minister Sheikh Hasina is a political phenomenon who has guided the rise of this nation of 170 million from rustic jute producer into the Asia-Pacific’s fastest-expanding economy over the past decade, Time said in a cover story on the world’s longest-serving female head of govt.\nIn office since 2009, after an earlier term from 1996 to 2001, she has been credited with subduing both resurgent Islamists and a once meddlesome military, Time said.\nHaving already won more elections than late Prime Minister Margaret Thatcher or Indira Gandhi, Hasina is determined to extend that run at the ballot box in January.\n“I am confident that my people are with me,” she says in an interview with Time in September. “They’re my main strength.”\nBangladesh has taken an authoritarian turn under Hasina’s Awami League party. The last two elections were condemned by the US, E.U. and others for significant irregularities, including stuffed ballot boxes and thousands of phantom voters.\nShe won 84 per cene and 82 per cent of the vote, respectively.\nToday, Khaleda Zia, two-time former Premier and BNP leader, sits gravely ill under house arrest on dubious corruption charges.\nMeanwhile, BNP workers have been hit by a staggering 4 million legal cases, while independent journalists and civil society also complain of vindictive harassment.\nCritics say January’s vote is tantamount to a coronation and Hasina to a dictator, Time said.\n“The ruling party is controlling all the state machinery, whether it’s the law enforcement agencies or the judiciary,” says BNP Secretary-General Mirza Fakhrul Islam Alamgir, who has been charged in 93 cases—including vandalism and murder—and imprisoned nine times.\n“Whenever we raise our voices, they oppress us.”\nHasina’s economic achievements are impressive.\nBangladesh has gone from struggling to feed its people to a food exporter with a GDP rising from $71 billion in 2006 to $460 billion in 2022, making it South Asia’s second largest economy after India.\nSocial indicators have also improved, with 98 per cent of girls today receiving primary education. Bangladesh is moving into high-tech manufacturing, allowing international firms like Samsung to extricate supply chains from China.\n“We need to improve, of course, when it comes to democracy, human rights, free speech,” says Professor Mohammad Ali Arafat, an Awami League lawmaker from central Dhaka.\n“But we have come a long way.”\nHasina knows that a bitter and bruised opposition means failure is not an option.\n“It is not that easy to overthrow me through a democratic system,” she says. “The only option is just to eliminate me. And I am ready to die for my people.”\nALSO READ:\nWorld Bank Grants $210M to Bangladesh For Women, Children","highlightText":"","highlightTitle":"","highlightThreadTitle":"","language":"english","sentiment":null,"categories":null,"external_links":[],"external_images":[],"entities":{"persons":[{"name":"margaret thatcher","sentiment":"none"},{"name":"indira gandhi","sentiment":"none"},{"name":"hasina","sentiment":"none"},{"name":"hasin","sentiment":"none"},{"name":"sheikh hasina","sentiment":"none"}],"organizations":[{"name":"e.u.","sentiment":"none"},{"name":"awami league","sentiment":"none"},{"name":"time","sentiment":"none"}],"locations":[{"name":"bangladesh","sentiment":"none"},{"name":"asia-pacific","sentiment":"none"},{"name":"us","sentiment":"none"}]},"rating":null,"crawled":"2023-11-04T13:07:04.617+02:00","updated":"2023-11-04T13:07:04.617+02:00"}