{"thread":{"uuid":"37babc8627362b93f64018f11ffb014a0bf4e9f9","url":"http://www.bing.com/news/apiclick.aspx?ref=FexRss&aid&tid=65461f5292b5448495f9ad6bba3da20c&url=https://uk.movies.yahoo.com/going-green-vegan-diets-help-090000322.html&c=14178877402384526635&mkt=en-us","site_full":"www.bing.com","site":"bing.com","site_section":"https://www.deleciousfood.com","site_categories":["search_engine","tech"],"section_title":"deleciousfood -","title":"Vegan diets can help the planet - deleciousfood","title_full":"Vegan diets can help the planet - deleciousfood","published":"2023-11-04T12:39:00.000+02:00","replies_count":0,"participants_count":1,"site_type":"news","country":"US","main_image":"https://media.zenfs.com/en/yorkshire_evening_post_477/2fc112340ee68bd4b3ac662ce68f5d50","performance_score":0,"domain_rank":104,"domain_rank_updated":"2023-10-31T12:15:27.000+02:00","reach":null,"social":{"facebook":{"likes":0,"comments":0,"shares":0},"gplus":{"shares":0},"pinterest":{"shares":1},"linkedin":{"shares":0},"stumbledupon":{"shares":0},"vk":{"shares":0}}},"uuid":"37babc8627362b93f64018f11ffb014a0bf4e9f9","url":"http://www.bing.com/news/apiclick.aspx?ref=FexRss&aid&tid=65461f5292b5448495f9ad6bba3da20c&url=https://uk.movies.yahoo.com/going-green-vegan-diets-help-090000322.html&c=14178877402384526635&mkt=en-us","ord_in_thread":0,"parent_url":null,"author":"deleciousfood","published":"2023-11-04T12:39:00.000+02:00","title":"Vegan diets can help the planet - deleciousfood","text":"Vegan diets can help the planet [Vegan](https://www.deleciousfood.com/category/vegan/)| [No Comments](https://www.deleciousfood.com/vegan-diets-can-help-the-planet/#respond) There’s never a bad month to switch to plant-based products, but November is World Vegan Day on the 1st and it’s also Veg Pledge month where people are encouraged to go vegetarian for a week . As a member of a farming family, when I announced that I was becoming a vegetarian at the age of 14, my decision was met with disappointment from my family who could not contemplate a plate without meat. Not only that, but back then the vegan choices were basically chips, salad, and veggie bowls. Linda McCartney was my hero. It’s been incredible to watch the plant revolution develop since then. From now on, you shouldn’t miss anything because the food choices are very varied. If you want meat substitutes, there are plenty of vegan options, from faux pulled pork to sausage, bacon and everything in between. If you decide to start with a few vegetarian meals per week instead of jumping straight to plant-based meals, there are plenty of options when it comes to foods. Lentil bolognese is a thing of beauty, it has lots of seasonings and your family won’t really taste the difference. And beans and legumes are much cheaper than meat: eating plant-based cuts food costs by up to a third, according to an Oxford University study. Vegetable curries are delicious and vegetables are a great support for those spicy, warming flavors of the curry. There are great recipes for whole stuffed butternut squash that you cut up like you would a joint on Sunday so the meal ceremony doesn’t have to be sacrificed either. While there’s no need to compromise on taste or flavor when it comes to switching to plant-based products, it’s always worth remembering the staggering difference that ditching meat makes and dairy products will do in terms of the environment. Research from the University of Oxford found that plant-based diets lead to 75% less global heating emissions, land use and water pollution than carnivorous diets. That’s a huge impact by anyone’s standards. Vegan diets also make a huge difference to biodiversity. The same research found they reduced water consumption by 54 percent and wildlife destruction by 66 percent. But it’s not just the planet that will benefit if you decide to adopt a planet-based lifestyle. A study from an international medical journal found that vegans have a 9% reduced risk of death from all causes. Whatever your motivation for giving it a shot, there really are many benefits for everyone if you decide to go vegan or try being plant-based. So while I advise everyone to give it a try and see how they do, why not tell some friends and give it a try as many other people will too.","highlightText":"","highlightTitle":"","highlightThreadTitle":"","language":"english","sentiment":"positive","categories":["Environment","Health","Lifestyle and Leisure"],"external_links":[],"external_images":[],"entities":{"persons":[{"name":"linda mccartney","sentiment":"none"}],"organizations":[],"locations":[]},"rating":null,"crawled":"2023-11-04T13:11:38.866+02:00","updated":"2023-11-04T13:11:38.866+02:00"}