{"thread":{"uuid":"458a9bcebe86b92cd6f806b7d4e8947e314c4ef3","url":"https://whatsnew2day.com/us-tourist-sparks-anger-with-her-long-list-of-things-she-hates-about-europe/","site_full":"whatsnew2day.com","site":"whatsnew2day.com","site_section":"https://whatsnew2day.com","site_categories":["media"],"section_title":"WhatsNew2Day - Latest News And Breaking Headlines","title":"US Tourist Sparks Anger With Her Long List Of Things She Hates About Europe » WhatsNew2Day","title_full":"US Tourist Sparks Anger With Her Long List Of Things She Hates About Europe » WhatsNew2Day","published":"2023-11-04T07:55:00.000+02:00","replies_count":0,"participants_count":1,"site_type":"news","country":"DK","main_image":"https://whatsnew2day.com/wp-content/uploads/2023/11/US-tourist-sparks-anger-with-her-long-list-of-things.jpeg","performance_score":0,"domain_rank":66659,"domain_rank_updated":"2023-10-31T12:15:50.000+02:00","reach":null,"social":{"facebook":{"likes":0,"comments":0,"shares":0},"gplus":{"shares":0},"pinterest":{"shares":0},"linkedin":{"shares":0},"stumbledupon":{"shares":0},"vk":{"shares":0}}},"uuid":"458a9bcebe86b92cd6f806b7d4e8947e314c4ef3","url":"https://whatsnew2day.com/us-tourist-sparks-anger-with-her-long-list-of-things-she-hates-about-europe/","ord_in_thread":0,"parent_url":null,"author":"Jacky","published":"2023-11-04T07:55:00.000+02:00","title":"US Tourist Sparks Anger With Her Long List Of Things She Hates About Europe » WhatsNew2Day","text":"An American tourist has sparked a debate online after sharing a long list of all the things she doesn’t like about Europe. [No spices](#no-spices) [No shower curtains](#no-shower-curtains) [No washcloths](#no-washcloths) [No free water or free refills](#no-free-water-or-free-refills) [No free public bathrooms](#no-free-public-bathrooms) [Missing toilet seats](#missing-toilet-seats) [No free hotel breakfast or vending machines](#no-free-hotel-breakfast-or-vending-machines) [Long flat pillows](#long-flat-pillows) [Large beds were pushed together](#large-beds-were-pushed-together) [Only sheets on the bed](#only-sheets-on-the-bed) [Hot coffee served in glasses without handles](#hot-coffee-served-in-glasses-without-handles) [Two giant straws in cocktails](#two-giant-straws-in-cocktails) [Shopping bags cost money](#shopping-bags-cost-money) [Fries are really bad](#fries-are-really-bad) [Lemonade is ‘soda water’](#lemonade-is-8216soda-water8217) [Complete list of what an American TikToker said she doesn’t like about Europe](#complete-list-of-what-an-american-tiktoker-said-she-doesn8217t-like-about-europe) [Fries and salad are the only sides](#fries-and-salad-are-the-only-sides) [Small water glasses](#small-water-glasses) [No hair conditioner](#no-hair-conditioner) The first clip of the two-part video series of @thestrawberryannie was seen by more than 4.7 million people in one week. She told viewers: ‘I used to romanticize Europe, but after going there three times I feel like I’ve really gotten what it really is. This way I was able to make a list of the things I don’t like very much.’ The caption reads: ‘This list is largely based on the three-week trip I spent last month in southern Spain, southern France and Italy. “Not every city or establishment was like this, but this is what we found to be common. We still enjoy visiting European countries, but I definitely appreciate the Bucees bathrooms in the United States of America’ – read on for the TikToker’s full list. An American tourist has sparked a debate online after sharing a long list of all the things she doesn’t like about Europe No spices The first on her list was the lack of spices. She said: ‘I feel like in America we are very sassy people and we have sauces or dips that go with everything, it’s part of the meal. ‘They don’t have that there, so for example I ordered calamari, they didn’t serve it with cocktail sauce or tartar sauce or even a slice of lemon – there was nothing, it was dry. ‘The food there is so dry that you have to pay extra for the sauce.’ An American commentator added: ‘No sauces with calamari is insane. That and no ice and dr. pepper yes I would cry if I had to live there permanently’. No shower curtains The TikToker then complained about a lack of shower curtains: ‘There’s no curtain to be seen, it all looked like glass walls, but half of the bathtubs, the glass shower area only covered half of the bathtub. “So you felt like you were going to get water everywhere, which wasn’t very comfortable.” However, people were quick to defend this in the comments, with one user writing: ‘glass walls are so much better than curtains’. No washcloths She continued: ‘I couldn’t scrub in the shower, I just had to use my bare hands. “That’s fine, but not really because I was wearing a lot of sunscreen when I went and I just really wanted to scrub my skin off at the end of the day.” “They didn’t give you any washcloths, just a hand towel and a body towel — that’s it, not like a little washcloth.” Viewers were shocked by this point, writing, “You wanted to see a public washcloth!?!?!?” and ‘sincere question: I’d rather die than use a hotel washcloth even if it’s been washed between customers, is that normal in the US?’ The TikToker said, “Next, we don’t have free water or free refills at restaurants. ‘I spent so much money on water in restaurants, it really made me miss the unlimited giant glasses of cold water in America’ No free water or free refills The TikToker said, “Next, we don’t have free water or free refills at restaurants. “I’ve spent so much money on water at restaurants that I’ve really missed the unlimited giant glasses of cold water in America.” One commenter advised: ‘There are so many actually available in Europe… you just have to know what to ask for. In most of Northern Europe you have to ask for tap water.’ Another added: ‘Wait for the no free water? We literally drink tap water in most of Europe and it is completely safe and good.’ No free public bathrooms She then explained: ‘There are no free public toilets either, you have to go to the toilet somewhere where you bought something, so I used to go every time we went to restaurants. “You would think that because you are buying something and you are in a facility that the bathroom will at least be nice – wrong.” ‘Wrong, even the bathrooms you pay for are disgusting. This was the case in Spain, France and Italy. “Germany is a little better on the bathroom front, but man oh man, those bathrooms are crunchy.” Missing toilet seats On the topic of bathrooms, she added: “The toilets had no seats, so I had to squat or sit on the bare edge of a toilet. It was not fun.’ Viewers said: ‘I’m sorry. NO TOILET SEATS??’ and ‘I found the public toilets in Austria and Germany very clean, but was still shocked that I had to pay for them.’ Someone else wrote: ‘I was in Pompeii once and the bathroom was a hole in the ground.’ No free hotel breakfast or vending machines She continued: ‘The no free hotel breakfast also sucks, you have to pay extra for that. Not a good old continental. “There were also no vending machines in the hotels, so if you want a sneaky snack late at night, good luck because there are no vending machines in the hotels.” One commenter advised: ‘The hotel breakfast there is actually good food instead of powdered eggs. Definitely worth paying for.’ Long flat pillows Then the TikToker said she didn’t like the pillows: ‘Long flat pillows also in the hotels. They weren’t that fluffy, they covered the entire bed. ‘It was so long and it just looked flat, I didn’t get my own pillow, it was just weird. Sorry, is that rude? Not strange, different, it was different.’ Large beds were pushed together She continued, “Big beds because couples are just twins pushed together so when you want to cuddle one of you is in the crack. “You will lie in the crevice of the bed.” Only sheets on the bed The final complaint for hotel rooms was the lack of a duvet. She told viewers: ‘So the first week we were there we thought they just didn’t have any duvets or duvets there, but then we realized they just don’t fully make the bed for you. ‘The duvet is, as it were, in a cupboard somewhere, you have to find it and make it yourself, and that’s what I think.’ Hot coffee served in glasses without handles Moving on to drinks, she said, “They served hot coffee in glasses without handles. ‘When we were in Spain, we got coffee and churros from this churro place and they served them in a cup without a handle. “So we couldn’t drink it until it cooled down because the damn glass was on fire and it was so hot.” Two giant straws in cocktails When it came to alcoholic drinks, the American was again unimpressed: ‘They also serve two giant straws in cocktails, while in America we serve them as short, skinny black straws, two of them. “They put two giant straws which I thought was funny because I was like, should I drink from both? Because I’m going to drink this real quick if that’s the case. ‘Or is it just for decoration, but if so, why are the straws so big? I just don’t understand it.’ Shopping bags cost money Claiming that ‘nothing is free’, she said: ‘Shopping bags cost money so if you’re a tourist and you don’t have a bag with you and you’re just walking around then you just have to pay for a bag or carry all the stuff you buy , because nothing is free. “Nothing is free there, don’t think for a second that it will be, because it isn’t.” Fries are really bad Next on the list is the quality of the fries. She said: ‘French fries are really bad, they’re barely golden brown, not even crispy, a bit soggy. “I think we had one good chip shop the whole time we were there, it was quite disappointing.” Lemonade is ‘soda water’ The tourist was also confused by lemonade in Europe and explained: ‘Lemonade is just sugar water, so literally soda water with a packet of sugar and they squeeze it like a lime wedge and that’s your lemonade. I hope you enjoy it’ Complete list of what an American TikToker said she doesn’t like about Europe - No spices - No shower curtains - No washcloths - No free water or free refills - No free public bathrooms - Missing toilet seats - No free hotel breakfast - No vending machines - Long flat pillows - Large beds are twins pushed together - Only sheets on the bed - Hot coffee glasses without handles - To giant straws in cocktails - Shopping bags cost money - Fries are really bad - Lemonade is ‘soda water’ - Fries and salad are the only sides - Small water glasses - No hair conditioner Fries and salad are the only sides She also noted that there are limited food options: “Fries and salad are the only sides of literally everything. I was so tired of crappy fries, I thought, can I please have some macaroni and cheese or broccoli or literally anything else as a side dish? ‘Even their salads are not that extra, because we make our salad here so extra with all those toppings. “Their salad looks like greens and the oil and vinegar dressing and that’s it, that’s what you eat.” Small water glasses Towards the end of the list, she complained about the “little water glasses” that she said were getting “so old so quickly.” The TikToker said: ‘The water is so expensive, there are no free refills, so you just slurp this water out of this little teacup. ‘I’m so thirsty, I couldn’t get hydrated, it didn’t matter how much water I drank I wouldn’t get hydrated. “There’s something in that water, it just doesn’t penetrate the veins, I don’t know.” No hair conditioner Finally, her last complaint about Europe was the lack of hair conditioner. She told viewers: “I think they just don’t believe in hair conditioner, every hotel we were in didn’t have conditioner. ‘It was shower gel and shampoo or a combination of shower gel and shampoo, there was no conditioner anywhere in sight – the hair is dry, that’s all.’ Concluding her video, she clarified, “There are a lot of things that I liked too, but we just got so homesick being away for so long that we ended up making a list of all the things that we noticed were different from At home.’ However, the video sparked a debate in the comments, with Europeans defending their country and Americans agreeing with the TikToker. Viewers wrote: “I mean I’m only three deep into your list and they’re all wrong so far. Being updated’ and ‘This list is completely untrue’. Others chimed in with ‘this is such a tourist perspective on Europe’ and ‘I’ve got five items and I already know it’s completely wrong’. Others from the US defended the video, writing “I couldn’t survive without a ranch” and “The lack of washcloths is the absolute WORST.”","highlightText":"","highlightTitle":"","highlightThreadTitle":"","language":"english","sentiment":"negative","categories":["Human Interest","Social Issue"],"external_links":["https://www.tiktok.com/@thestrawberryannie/video/7291774832822308139","https://tiktok.com/@thestrawberryannie/video/7291774832822308139"],"external_images":[],"entities":{"persons":[{"name":"tiktoker","sentiment":"none"}],"organizations":[],"locations":[{"name":"europe","sentiment":"none"},{"name":"us","sentiment":"none"}]},"rating":null,"crawled":"2023-11-04T13:11:38.706+02:00","updated":"2023-11-04T13:11:38.706+02:00"}