{"thread":{"uuid":"4c739f991def8d1779d4ebdd5805fedec20721f6","url":"https://lacrossetribune.com/news/community/vernonbroadcaster/pfaff-colleagues-visit-viroqua-to-introduce-a-package-of-bills-supporting-agriculture/article_5eccb508-7a84-11ee-9a85-177b96973895.html","site_full":"lacrossetribune.com","site":"lacrossetribune.com","site_section":"http://lacrossetribune.com/search/?f=rss&amp;t=article&amp;l=50&amp;s=start_time&amp;sd=desc&amp;k[]=%23topstory","site_categories":["media"],"section_title":"lacrossetribune.com - RSS Results","title":"Pfaff, colleagues visit Viroqua to introduce a package of bills supporting agriculture","title_full":"Pfaff, colleagues visit Viroqua to introduce a package of bills supporting agriculture","published":"2023-11-04T13:00:00.000+02:00","replies_count":0,"participants_count":1,"site_type":"news","country":"US","main_image":"https://bloximages.chicago2.vip.townnews.com/lacrossetribune.com/content/tncms/assets/v3/editorial/0/5e/05e7872a-7a83-11ee-be20-47d2d6c5a3e5/608ecdebc6d42.image.jpg?crop=1868%2C981%2C0%2C64&amp;resize=1200%2C630&amp;order=crop%2Cresize","performance_score":0,"domain_rank":14784,"domain_rank_updated":"2023-10-31T12:15:27.000+02:00","reach":null,"social":{"facebook":{"likes":0,"comments":0,"shares":0},"gplus":{"shares":0},"pinterest":{"shares":0},"linkedin":{"shares":0},"stumbledupon":{"shares":0},"vk":{"shares":0}}},"uuid":"4c739f991def8d1779d4ebdd5805fedec20721f6","url":"https://lacrossetribune.com/news/community/vernonbroadcaster/pfaff-colleagues-visit-viroqua-to-introduce-a-package-of-bills-supporting-agriculture/article_5eccb508-7a84-11ee-9a85-177b96973895.html","ord_in_thread":0,"parent_url":null,"author":"Angela Cina angie.cina@lee.net","published":"2023-11-04T13:00:00.000+02:00","title":"Pfaff, colleagues visit Viroqua to introduce a package of bills supporting agriculture","text":"State Sen. Brad Pfaff (D-Onalaska) and legislative colleagues came to Fifth Season Cooperative in Viroqua, Wednesday, Nov. 1, to introduce a package of bills to invest in Wisconsin agriculture and fight food insecurity. The bills provide funding to connect food assistance organizations and schools with farmers, market Wisconsin products through the Something Special from Wisconsin program, support growth in value-added products and enhance regional farmer support. “We here in Wisconsin know how to grow food and work the land,” Pfaff said. “We come here with a strong package to meet the needs of farmers after hearing from farmers and consumers.” He said the agricultural industry is strong, generating a $107 billion economic impact annually for the state; however, there continues to be a need to create new markets and connect farmers with consumers. “We are excited about the proposals,” Pfaff said. People are also reading… Rep. Dave Considine (D-Baraboo), who represents Assembly District 81, said some of the proposals have been introduced before but it’s worth it to do so again. He highlighted the bill that would add two more full-time positions to the Wisconsin Department of Agriculture, Trade and Consumer Protection (DATCP) for regional farmer support and increase a department appropriation account in both fiscal years of the 2023-25 fiscal biennium for the positions. The dollar amount for fiscal year 2023-24 is increased by $352,600 and the dollar amount for fiscal year 2024-25 is also increased by $352,600. Considine said when he was a farmer 30 to 40 years ago Extension agents would come to farms to see how farmers were doing. He said adding two more staff members to DATCP is important, especially with the mental health of farmers and it could help farmers create a farm transition plan. Another bill, Considine said, would provide funding for DATCP to award grants to create and expand Farm to School programs. He said it would encourage schools and farmers to work together to market local food. That same bill creates a Farm to Fork program, similar to the existing Farm to School program. It would connect organizations that are not school districts and that have cafeterias to nearby farms to provide locally produced foods in meals and snacks. DATCP would provide the grants. “These bills will be beneficial to Vernon County and Wisconsin,” said Darin Von Ruden, Wisconsin Farmers Union president. He said the Farm to School program has been around for a while and brings money to local communities. Rep. Katrina Shankland (D-Stevens Point), who represents Assembly District 71, said the bills are straight-forward and commonsense. She said there is a bill being proposed that would require the Department of Health Services to provide a payment processing program for farmers and farmers markets. “(The bill) provides $735,000 in EBT (electronic benefits transfer) and credit and debit processing equipment,” Shankland said. “It will help increase access to good food and broadens the options for EBT benefits. It supports a direct link with farmers and consumers. It will boost sales and revenue for farmers and farmers markets.” Rep. Clinton Anderson (D-Beloit), who represents Assembly District 45, highlighted the bill relating to the Something Special from Wisconsin program. Anderson said a constituent told him that the Something Special from Wisconsin label is important. He said the program highlights producers. The proposed bill increases DATCP’s annual appropriation for the advertising and promotion of the Something Special from Wisconsin slogan, mark and logo by $142,300 in each year of the 2023-25 fiscal biennium. Another bill proposal supports the growth of value-added products, by providing education, technical assistance and grants through DATCP. Considine said the bill is specifically focused on smaller producers. Pfaff said there hasn’t been any pushback regarding the package of bills and noted again that portions of the legislation have been introduced in the past. He said it was important to continue to have outreach and education in rural areas.","highlightText":"","highlightTitle":"","highlightThreadTitle":"","language":"english","sentiment":"neutral","categories":["Politics","Economy, Business and Finance"],"external_links":[],"external_images":[],"entities":{"persons":[{"name":"pfaff","sentiment":"negative"},{"name":"brad pfaff","sentiment":"negative"},{"name":"dave considine","sentiment":"none"}],"organizations":[{"name":"assembly district","sentiment":"none"}],"locations":[{"name":"viroqua","sentiment":"none"},{"name":"onalaska","sentiment":"none"},{"name":"wisconsin","sentiment":"none"}]},"rating":null,"crawled":"2023-11-04T13:07:38.674+02:00","updated":"2023-11-04T16:49:03.916+02:00"}