{"thread":{"uuid":"52cd25b3c23de37d21d8e6dd381a10616ec315ce","url":"https://jobs.compassgroupcareers.com/USA/job/Minneapolis-ATTENDANT%2C-CATERING-%28FULL-TIME%29-MN-55467/1094407200/","site_full":"jobs.compassgroupcareers.com","site":"compassgroupcareers.com","site_section":"http://jobs.oodle.com//?v=rss","site_categories":["job_search","jobs"],"section_title":"","title":"Attendant, Catering (Full Time) (Compass Group)","title_full":"Attendant, Catering (Full Time) (Compass Group)","published":"2023-11-04T11:52:00.000+02:00","replies_count":0,"participants_count":0,"site_type":"news","country":"US","main_image":"","performance_score":0,"domain_rank":265851,"domain_rank_updated":"2023-10-31T12:16:22.000+02:00","reach":null,"social":{"facebook":{"likes":0,"comments":0,"shares":0},"gplus":{"shares":0},"pinterest":{"shares":0},"linkedin":{"shares":0},"stumbledupon":{"shares":0},"vk":{"shares":0}}},"uuid":"52cd25b3c23de37d21d8e6dd381a10616ec315ce","url":"https://jobs.compassgroupcareers.com/USA/job/Minneapolis-ATTENDANT%2C-CATERING-%28FULL-TIME%29-MN-55467/1094407200/","ord_in_thread":0,"parent_url":null,"author":null,"published":"2023-11-04T11:52:00.000+02:00","title":"Attendant, Catering (Full Time) (Compass Group)","text":"ATTENDANT, CATERING (FULL TIME)\nDate: Nov 3, 2023\nLocation: Minneapolis, MN, US, 55467\nCompany: Compass Group\n- We are hiring immediately for a full time ATTENDANT, CATERING position.\n- Location: 2701 Wells Fargo Way, Minneapolis, MN 55467 Note: online applications accepted only.\n- Schedule: Full time schedule. Monday through Friday, 6:30 am - 2:30 pm. More details upon interview.\n- Requirement: 1 year of experience is preferred.\n*Internal Employee Referral Bonus Available\n- Starting Pay: $17.00 per hour\nWe Make Applying Easy! Want to apply to this job via text messaging? Text JOB to 75000 and search requisition ID number 1248795.\nThe advertised program is a conversational recruiting assistant that helps you apply to jobs with Compass Group. Message frequency varies. Message and data rates may apply. Text STOP to opt out or HELP for help. Terms and conditions:\nhttp://olivia.paradox.ai/moSkg\nDiversity of thought and inclusion for all is what drives our success - we invite you to start your journey with us today!\nEurest is recognized worldwide for standards of service and excellence within the foodservice industry. Embracing an ownership mindset, Eurest leverages global resources, promotes a local presence and enriches the communities we serve. The Eurest Promise, “connect with people, inspire through food, create solutions, and live our promise,” is exemplified throughout our organization. Eurest is proud to serve the world’s most respected successful corporations, including many of the Fortune 500.\nJob Summary\nSummary: Delivers and serves food at scheduled functions under the supervision of the catering captain. Ensures the accurate execution of all events during his/her shift. May drive a catering delivery truck. Sets up and serves at functions; cleans event area during and after events; breaks down the setup and leaves the area neat and clean; returns leftover food and equipment to the catering facility in a timely manner.\nEssential Duties and Responsibilities:\n- Assembles and delivers all food and supplies for catered functions to their scheduled locations.\n- Logs and maintains food temperatures.\n- Arranges tables and decorations.\n- Arranges buffet tables with food, beverage and service items according to standards.\n- Serve food and beverages to guests.\n- Thoroughly cleans location after event is completed.\n- Returns food and beverages, serving equipment and utensils to catering facility.\n- Distributes and collects customer comment cards for catered functions.\n- Stocks, cleans and maintains catering facility and equipment.\n- Ensures guests receive friendly, courteous service at all times.\n- Maintains in-depth knowledge of complete menu and products on hand.\n- Maintains clean and safe work environment.\n- Follows safety and sanitation policy and procedures at all times.\n- Performs other duties as assigned.\nQualifications:\n- Valid driver's license may be required; must possess or able to obtain a valid food handler's permit and/or alcohol servers' permit where required by state law.\nAssociates at Eurest are offered many fantastic benefits.\nFull-time and part-time positions offer the following benefits to associates: Retirement Plan, Associate Shopping Program, Health and Wellness Programs, Discount Marketplace, Identity Theft Protection, Pet Insurance, Voluntary Benefits, including Critical Illness Insurance, Accident Insurance, Hospital Indemnity Insurance, Legal Services, and Choice Auto and Home Program\nFull-time positions also offer the following benefits to associates: Medical, Dental, Vision, Life Insurance/AD, Disability Insurance, Commuter Benefits, Employee Assistance Program, Flexible Spending Accounts (FSAs)\nAbout Compass Group: Achieving leadership in the foodservice industry\nCompass Group is an equal opportunity employer. At Compass, we are committed to treating all Applicants and Associates fairly based on their abilities, achievements, and experience without regard to race, national origin, sex, age, disability, veteran status, sexual orientation, gender identity, or any other classification protected by law.\nQualified candidates must be able to perform the essential functions of this position satisfactorily with or without a reasonable accommodation. Disclaimer: this job post is not necessarily an exhaustive list of all essential responsibilities, skills, tasks, or requirements associated with this position. While this is intended to be an accurate reflection of the position posted, the Company reserves the right to modify or change the essential functions of the job based on business necessity. *We will consider for employment all qualified applicants, including those with a criminal history (including relevant driving history), in a manner consistent with all applicable federal, state, and local laws, including the City of Los Angeles’ Fair Chance Initiative for Hiring Ordinance, the San Francisco Fair Chance Ordinance, and the New York Fair Chance Act.\nEurest maintains a drug-free workplace.\nReq ID: 1248795\n[[req_classification]]\nNearest Major Market: Minneapolis\nJob Segment: Food Service, Activities, Catering, Hospitality","highlightText":"","highlightTitle":"","highlightThreadTitle":"","language":"english","sentiment":null,"categories":null,"external_links":["https://nam11.safelinks.protection.outlook.com/?url=http%3A%2F%2Folivia.paradox.ai%2FmoSkg&data=05%7C01%7CKathleen.McDermid%40compass-usa.com%7C859493b20a6f466fd4da08db517cadc0%7Ccd62b7dd4b4844bd90e7e143a22c8ead%7C0%7C0%7C638193368152930337%7CUnknown%7CTWFpbGZsb3d8eyJWIjoiMC4wLjAwMDAiLCJQIjoiV2luMzIiLCJBTiI6Ik1haWwiLCJXVCI6Mn0%3D%7C3000%7C%7C%7C&sdata=Galm3rHPK6vJZl3z7SDmTv%2FZfbFG4WOd0kimnSOGH4o%3D&reserved=0","http://olivia.paradox.ai/moSkg","https://www.nam11.safelinks.protection.outlook.com/?url=http%3A%2F%2Folivia.paradox.ai%2FmoSkg&data=05%7C01%7CKathleen.McDermid%40compass-usa.com%7C859493b20a6f466fd4da08db517cadc0%7Ccd62b7dd4b4844bd90e7e143a22c8ead%7C0%7C0%7C638193368152930337%7CUnknown%7CTWFpbGZsb3d8eyJWIjoiMC4wLjAwMDAiLCJQIjoiV2luMzIiLCJBTiI6Ik1haWwiLCJXVCI6Mn0%3D%7C3000%7C%7C%7C&sdata=Galm3rHPK6vJZl3z7SDmTv%2FZfbFG4WOd0kimnSOGH4o%3D&reserved=0","https://nam11.safelinks.protection.outlook.com/","http://www.olivia.paradox.ai/moSkg"],"external_images":[],"entities":{"persons":[],"organizations":[{"name":"eurest","sentiment":"none"},{"name":"wells fargo way","sentiment":"none"},{"name":"compass group","sentiment":"none"}],"locations":[{"name":"minneapolis","sentiment":"none"},{"name":"us","sentiment":"none"}]},"rating":null,"crawled":"2023-11-04T13:07:28.306+02:00","updated":"2023-11-04T13:07:28.306+02:00"}