{"thread":{"uuid":"5d23ad2f3e3ee762e9c1392d11276ffa8ca1fdc0","url":"https://boston.i3investor.com/web/blog/detail/kianweiaritcles/2023-11-04-story-h-215974824-Rescuers_struggle_to_find_Nepal_quake_survivors_deaths_at_137","site_full":"boston.i3investor.com","site":"i3investor.com","site_section":"https://boston.i3investor.com","site_categories":[],"section_title":"Bursa Malaysia (KLSE) Stock Investment Portal | I3investor","title":"Rescuers struggle to find Nepal quake survivors, deaths at 137 | I3investor","title_full":"Rescuers struggle to find Nepal quake survivors, deaths at 137 | I3investor","published":"2023-11-04T12:02:00.000+02:00","replies_count":0,"participants_count":1,"site_type":"blogs","country":"MY","main_image":"https://cdn6.i3investor.com/web/img/icon/i3investor256.png","performance_score":0,"domain_rank":127460,"domain_rank_updated":"2023-10-31T12:16:03.000+02:00","reach":null,"social":{"facebook":{"likes":0,"comments":0,"shares":0},"gplus":{"shares":0},"pinterest":{"shares":0},"linkedin":{"shares":0},"stumbledupon":{"shares":0},"vk":{"shares":0}}},"uuid":"5d23ad2f3e3ee762e9c1392d11276ffa8ca1fdc0","url":"https://boston.i3investor.com/web/blog/detail/kianweiaritcles/2023-11-04-story-h-215974824-Rescuers_struggle_to_find_Nepal_quake_survivors_deaths_at_137","ord_in_thread":0,"parent_url":null,"author":"Tan KW","published":"2023-11-04T12:02:00.000+02:00","title":"Rescuers struggle to find Nepal quake survivors, deaths at 137 | I3investor","text":"KATHMANDU - Rescue workers in Nepal began digging through the rubble of collapsed houses with their hands on Saturday, searching for survivors after the country's worst earthquake in eight years killed 137 people and shook buildings as far away as New Delhi. The quake struck the Jajarkot region in the west of the Himalayan nation at 11:47 p.m. (1802 GMT) on Friday with a 6.4 magnitude, Nepal's National Seismological Centre said. The German Research Centre for Geosciences measured it at 5.7 and the U.S. Geological Survey at 5.6. Officials fear the death toll could rise as first responders had reached the hilly area near the epicentre, some 500 km (300 miles) west of the capital Kathmandu, only early on Saturday and began searching for survivors. \"The number of injured could be in the hundreds and the deaths could go up as well,\" Jajarkot district official Harish Chandra Sharma told Reuters by phone. Although the quake's magnitude was not severe, the damage and the death toll would likely be high due to the poor quality of construction in the area and that it struck while people slept, officials said. Rescue work was expected to be slow as emergency teams must first clear roads blocked by landslides in many places, they said, adding that helicopters and small planes have been asked to be ready to join the effort. The quake is the deadliest since 2015 when about 9,000 people were killed in two earthquakes. Whole towns, centuries-old temples and other historic sites were reduced to rubble then, with more than a million houses destroyed, at a cost to the economy of $6 billion. Officials said 99 people were killed in Jajarkot and 38 in neighbouring Rukum West district, both in Karnali province. The epicentre was in the village of Ramidanda. Three towns and three villages were known to be affected in Jajarkot, which has a population of 190,000 with villages scattered in remote hills, authorities said. At least 85 people were injured in Rukum West and 55 in Jajarkot, an official in the prime minister's office said. APPEAL FOR HELP \"Many houses have collapsed, many others have developed cracks. Thousands of residents spent the entire night in cold, open grounds because they were too scared to go in into the cracked houses as aftershocks struck,\" Sharma said. \"I have myself not been able to go in.\" Local TV channels showed rescuers digging through the rubble with their bare hands looking for survivors in the debris of collapsed houses. Injured people were shown being carried to a rescue helicopter to move them to hospitals. Prime Minister Pushpa Kamal Dahal flew to the area early on Saturday with a 16-member army medical team to oversee search, rescue and relief, his office said. His office appealed to political parties, social workers and the public to donate funds to help arrange food, water, clothes and tents for the survivors. A small aeroplane carrying medical supplies and health workers was diverted to nearby Surkhet after it failed to land in Chaurjahari in nearby Rukum district due to bad weather, said army spokesman Krishna Bhandari. Local media footage showed crumbled facades of multi-storied brick houses, with large pieces of furniture scattered. Videos on X showed people running into the street as some buildings were evacuated. The tremors were felt in New Delhi, about 600 km (370 miles) away, and other parts of north India, shaking buildings and forcing people to run into the street late in the night. Authorities in the northern Indian states of Uttar Pradesh and Uttarakhand, both of which border Nepal, said there were no reports of any damage there. Indian Prime Minister Narendra Modi said he was deeply saddened by the loss of lives and damage in Nepal. \"India stands in solidarity with the people of Nepal and is ready to extend all possible assistance. Our thoughts are with the bereaved families and we wish the injured a quick recovery,\" he posted on X. - Reuters Created by [Tan KW](/web/cube/profile/kianwei) | Nov 04, 2023 Created by [Tan KW](/web/cube/profile/kianwei) | Nov 04, 2023 Created by [Tan KW](/web/cube/profile/kianwei) | Nov 04, 2023 Created by [Tan KW](/web/cube/profile/kianwei) | Nov 04, 2023 Created by [Tan KW](/web/cube/profile/kianwei) | Nov 04, 2023 Created by [Tan KW](/web/cube/profile/kianwei) | Nov 04, 2023 Created by [Tan KW](/web/cube/profile/kianwei) | Nov 04, 2023 Created by [Tan KW](/web/cube/profile/kianwei) | Nov 04, 2023 Created by [Tan KW](/web/cube/profile/kianwei) | Nov 04, 2023","highlightText":"","highlightTitle":"","highlightThreadTitle":"","language":"english","sentiment":null,"categories":null,"external_links":[],"external_images":[],"entities":{"persons":[{"name":"harish chandra sharma","sentiment":"none"}],"organizations":[{"name":"national seismological centre","sentiment":"none"},{"name":"german research centre for geosciences","sentiment":"none"},{"name":"reuters","sentiment":"none"}],"locations":[{"name":"kathmandu","sentiment":"none"},{"name":"nepal","sentiment":"none"},{"name":"new delhi","sentiment":"none"},{"name":"u.s.","sentiment":"none"},{"name":"kathmandu","sentiment":"none"},{"name":"jajarkot","sentiment":"none"}]},"rating":null,"crawled":"2023-11-04T13:07:04.437+02:00","updated":"2023-11-04T13:07:04.437+02:00"}