{"thread":{"uuid":"665d8a63383793186841a711d06c2dfb335530b0","url":"https://brentford.nub.news/news/local-news/five-jobs-available-near-brentford-right-now-barista-receptionist-and-cashier-roles-210008","site_full":"brentford.nub.news","site":"nub.news","site_section":"https://brentford.nub.news","site_categories":[],"section_title":"Home | Brentford Nub News","title":"Five jobs available near Brentford right now: Barista, receptionist and cashier roles | Local News | News | Brentford Nub News | by Cesar Medina","title_full":"Five jobs available near Brentford right now: Barista, receptionist and cashier roles | Local News | News | Brentford Nub News | by Cesar Medina","published":"2023-11-04T11:00:00.000+02:00","replies_count":0,"participants_count":1,"site_type":"news","country":"US","main_image":"https://storage.googleapis.com/nub-news-files/nub-news-file-storage/508474/conversions/text-article.jpg","performance_score":0,"domain_rank":134170,"domain_rank_updated":"2023-10-31T12:16:03.000+02:00","reach":null,"social":{"facebook":{"likes":0,"comments":0,"shares":0},"gplus":{"shares":0},"pinterest":{"shares":0},"linkedin":{"shares":0},"stumbledupon":{"shares":0},"vk":{"shares":0}}},"uuid":"665d8a63383793186841a711d06c2dfb335530b0","url":"https://brentford.nub.news/news/local-news/five-jobs-available-near-brentford-right-now-barista-receptionist-and-cashier-roles-210008","ord_in_thread":0,"parent_url":null,"author":"Cesar Medina","published":"2023-11-04T11:00:00.000+02:00","title":"Five jobs available near Brentford right now: Barista, receptionist and cashier roles | Local News | News | Brentford Nub News | by Cesar Medina","text":"Five jobs available near Brentford right now: Barista, receptionist and cashier roles By Cesar Medina 4th Nov 2023 9:00 am | [ Local News ](https://brentford.nub.news/news/local-news) Here is a list of job opportunities that are currently available in and around Brentford. And if your business is hiring, why not place an advertisement on our jobs page? Click [here](https://brentford.nub.news/jobs) to find out more. Crone Corkill Crone Corkill is looking for a Temporary Receptionist for immediate start. They need applicants who are \"professional\" and \"enthusiastic\". Its £12-13ph and office based in Brentford. Responsibilities include: - Answering, fielding, and transferring calls. - Greeting visitors and offering refreshments. - Making sure that the office is kept clean and tidy. - Booking couriers. Island Poke Island Poke is recruiting for a team member to work a minimum of 20 hours a week for £10.70ph. The job advert says: \"We're a fresh grab-and-go concept serving an interactive offering of poké. \"We make amazing poké bowls and want equally amazing, vibrant team members to build and serve them with energy and enthusiasm; dull is not in our dictionary.\" Job includes: - Free poké bowls - Regular team socials. - Paid experience shift if you’re successful. - Going beyond the bowl is what we’re renowned for; we want to help our people ‘go beyond…’ - The regular hospitality work life balance – we offer sociable working hours with no late nights. - Grey places of work – Our ‘Islands’ are full of colour, music and lively teams. - All being the same – bring your individual energy and personality to work. - Career progression. Artisan Artisan, an independent coffee shop, are offering full-time Barista roles at their Ealing branch. It pays £11.50ph with company events, gym membership and employee discount in store. The listing says: - Dedicated Artisan Coffee School training - before going into a shop - Paired on site training with a senior barista or manager including 4 shadow shifts - A coffee training chat @ 6 weeks where we ask “how we can support you more?” - A 4 month review with a coffee test - comprehensively testing all aspects of your skills - A Home Brew Master class after you have been with us 4 months - Each month the opportunity to be ‘Barista of the Month’ and earn £100 YoSushi A Kiosk Supervisor is needed at YoSushi in Isleworth. The role starts at £11.50 an hour with free food, discount and gym membership included. The job advert says: \"Become a YO! pro and pioneer our new concept, bringing restaurant quality sushi and sensational street food to a supermarket near you.\" Responsibilities include: - Responsible for supporting the multi-site/cluster manager with the daily operation of the kiosk including the whole shift in the absence of the manager overseeing food prep and service standards. - Manage stock and ordering to ensure you and the team hit production and waste targets. - Ensure budget is hit by managing labour and food costs as well as gross sales to achieve profit. - Lead consistent standards and analyse profit performance. - Drive standards and lead team to achieve high levels of customer service. - Know and understand what it means to deliver amazing service. - Create an engaged team with a culture of team work and support.","highlightText":"","highlightTitle":"","highlightThreadTitle":"","language":"english","sentiment":null,"categories":null,"external_links":[],"external_images":[],"entities":{"persons":[{"name":"cesar medin","sentiment":"none"},{"name":"crone corkill crone corkill","sentiment":"none"}],"organizations":[{"name":"brentford nub news","sentiment":"none"},{"name":"cesar medina five","sentiment":"none"}],"locations":[{"name":"brentford","sentiment":"none"}]},"rating":null,"crawled":"2023-11-04T13:07:25.742+02:00","updated":"2023-11-04T13:07:25.742+02:00"}