{"thread":{"uuid":"6bdd5fa0ad13a05cf818042188e354b02d7acca6","url":"https://caribbeanfinancials.com/a-national-intelligence-and-security-agency-at-long-last-12/","site_full":"caribbeanfinancials.com","site":"caribbeanfinancials.com","site_section":"https://caribbeanfinancials.com","site_categories":["travel","caribbean"],"section_title":"Caribbean Financials &#8211; Caribbean Business And Finance News","title":"A National Intelligence and Security Agency: At Long Last – Caribbean Financials","title_full":"A National Intelligence and Security Agency: At Long Last – Caribbean Financials","published":"2023-11-03T20:32:00.000+02:00","replies_count":0,"participants_count":0,"site_type":"news","country":null,"main_image":"https://caribbeanfinancials.com/wp-content/uploads/2021/10/caribbeanfinancials-logo-profile@0.5x.jpg","performance_score":0,"domain_rank":null,"domain_rank_updated":null,"reach":null,"social":{"facebook":{"likes":0,"comments":0,"shares":0},"gplus":{"shares":0},"pinterest":{"shares":0},"linkedin":{"shares":0},"stumbledupon":{"shares":0},"vk":{"shares":0}}},"uuid":"6bdd5fa0ad13a05cf818042188e354b02d7acca6","url":"https://caribbeanfinancials.com/a-national-intelligence-and-security-agency-at-long-last-12/","ord_in_thread":0,"parent_url":null,"author":null,"published":"2023-11-03T20:32:00.000+02:00","title":"A National Intelligence and Security Agency: At Long Last – Caribbean Financials","text":"By Daniel K. Gibran Finally, a government in Guyana has taken a bold and puissant step to establish through legislation a National Intelligence and Security Agency (NISA). This step is the first cock’s crow heralding a new day for the Co-Operative Republic. Now at last the citizens of Guyana can breathe a sigh of relief from fear and uncertainty that once stalked the land in days gone by. Well do we remember the wanton abuse of power from a chief executive who presided over a bunch of sycophants who unleashed a reign of terror on not a few. The passage of legislation to create NISA will put a stop to the abuse of this type of presidential power and at the same time through its information gathering and rigorous analysis (of said information) by its collection and analysis capabilities provide value-added to executive decision making. In short, this is another worthwhile step propelling Guyana forward into the twenty-first century. But it must be done right and with a keen sense of weighty responsibility. For this is a weighty step. What is loosely called “intelligence” is not a new or novel phenomenon in statecraft. The intelligence function is traceable to Biblical times when Moses sent out 12 spies to gather “useful” information, not intelligence, about the lay of the land, its topography, peoples, resources such as food and water, and how much of a threat the peoples of this “promised” land posed to Israel. In modern times, States, small and large, powerful and not so powerful, established national intelligence agencies to gather secret information about the capabilities and intentions of other States in order to be prepared to respond to threats to their national security. For example, Guyana has no way of knowing what Maduro’s plans and intentions are, real or imagined, towards Guyana. Why, because it lacks a dedicated Intelligence capability that will have the requisite mechanisms in place to find out. Flip this script for a moment and imagine the advantage Caracas has over Guyana. The Venezuelan Embassy in Georgetown has a number of “spies” working under diplomatic cover in Guyana. Maduro knows much more about Guyana’s secrets than his counterpart in Georgetown knows about Venezuela’s. Guyana’s Embassy in Caracas does not have any operator who is trained in espionage. The Venezuelan Embassy has quite a few as do the US, Russia, and China operating in Guyana with a free reign. And Guyana’s counterintelligence capability is at best immature and inchoate. This brings us to the functions of a national intelligence agency. But contrary to the adumbrations and fears expressed in one of the Dailies a day ago, the citizens of Guyana have nothing to fear with the legal creation and operation of NISA. The guardrails that would and must be in place in the legislation combined with laws relating to the interception of communications should act as robust barriers against the abuses of political power. The idea expressed in that Daily newspaper about the Director reporting and answerable only to the President is nothing to lose sleep over. The CIA, which was created by the National Security Act in 1947 is a good example. The Director of the CIA answers to and executes the directives of one person, the President of the United States of America. In other words, the CIA works for a customer of One. The GRU in Russia also works for a customer of one, Putin. Unlike the GDF and the Special Branch of the GPF, state entities with Intelligence Units that gather a narrow bandwidth of information to execute specific functions such as logistics operations or crime-related information to solve a specific case, that of a national intelligence agency is broad in scope and gears toward protecting the nation’s interests. Information gathering, for example, is one of the primary functions of a national intelligence agency. This function involves collecting information from varied sources, both domestic and international, in order to identify potential threats to national security. And this information can be collected through a variety of platforms that include signals intelligence (SIGINT), human intelligence (HUMINT), open-source intelligence (OSINT), and other technical mechanisms such as satellite imagery, acoustic and laser and infrared signals. Technical collection platforms are reliable, sophisticated and very costly, hence out of NISA’s range of acquisition capability. After information of national security interests is collected, it is then rigorously analyzed by the agency’s intelligence analysts to determine the potential threat to national security. Before providing a judgment or insight, the agency will assess or evaluate the credibility and reliability of the information and try to piece together the bigger picture. This rigor embedded in the analytical process is essential to helping policy makers make informed decisions about national security. In short, intelligence adds value to both tactical and strategic decision making. Another important function of a national intelligence agency is counterintelligence. This involves identifying and then neutralizing threats to national security posed by foreign intelligence operators, terrorist groups, and other hostile actors. Counterintelligence activities involve monitoring and surveilling potential threats, identifying potential vulnerabilities in government’s operational systems that could be exploited by foreign adversaries. Guyana needs a national intelligence agency with a robust counterintelligence capability to conduct surveillance of foreign operators. It must shake itself out of its long bout of senescence. Finally, a national intelligence agency, legally created and functioning by strict adherence to the laws that govern its operations does not pose a threat to its citizens. The singular advantage such an agency has lies its capability to collect secret information secretly. The time has come at this propitious juncture in its history when heightened interest in Guyana’s economic development comes calling, Parliament must do the right thing and act in the national interest to protect the country from threats to national security. Donate At Caribbean News Service, we do not charge for our content and we want to keep it that way. We are seeking support from individuals and organisations so we can continue our work & develop CNS further.","highlightText":"","highlightTitle":"","highlightThreadTitle":"","language":"english","sentiment":null,"categories":null,"external_links":[],"external_images":[],"entities":{"persons":[{"name":"daniel k. gibran","sentiment":"none"}],"organizations":[{"name":"national intelligence and security agency","sentiment":"none"},{"name":"nisa","sentiment":"none"}],"locations":[{"name":"guyana","sentiment":"none"},{"name":"co-operative republic","sentiment":"none"}]},"rating":null,"crawled":"2023-11-04T13:10:58.356+02:00","updated":"2023-11-04T13:10:58.356+02:00"}