{"thread":{"uuid":"6d19b6e5f6cd887d34d0309feaa371865c5aeb8d","url":"https://news.yam.md/ro/story/14677247","site_full":"news.yam.md","site":"yam.md","site_section":"https://news.yam.md/ro/feeds/rss201","site_categories":["media"],"section_title":"News.yam.md","title":"Aur pentru Republica Moldova: Judocanul Denis Vieru a devenit campion european","title_full":"Aur pentru Republica Moldova: Judocanul Denis Vieru a devenit campion european","published":"2023-11-04T12:50:00.000+02:00","replies_count":0,"participants_count":0,"site_type":"news","country":"MD","main_image":"","performance_score":0,"domain_rank":967552,"domain_rank_updated":"2023-10-31T12:19:52.000+02:00","reach":null,"social":{"facebook":{"likes":0,"comments":0,"shares":0},"gplus":{"shares":0},"pinterest":{"shares":0},"linkedin":{"shares":0},"stumbledupon":{"shares":0},"vk":{"shares":0}}},"uuid":"6d19b6e5f6cd887d34d0309feaa371865c5aeb8d","url":"https://news.yam.md/ro/story/14677247","ord_in_thread":0,"parent_url":null,"author":null,"published":"2023-11-04T12:50:00.000+02:00","title":"Aur pentru Republica Moldova: Judocanul Denis Vieru a devenit campion european","text":"Aur pentru Republica Moldova: Judocanul Denis Vieru a devenit campion european\n[Jurnal.md](/ro/b/jurnal), 4 noiembrie 2023 12:50\nAur pentru Republica Moldova: Judocanul Denis Vieru a devenit campion european Judocanul Denis Vieru a devenit campion european la seniori. Sportivul nostru l-a învins în finala categoriei de greutate de până la 66 kg pe spaniolul David Garcia Torne. Până a ajunge în ultimul act al competiției, care se desfășoară în aceste zile în orașul Montpellier, Franța, Denis Vieru a trecut pe rând de armeanul Artyom Ghalachyan, finlandezul Luukas Saha și azerul Yashar Najafov. Denis Vieru a mai fost premia...\n• • •\nAlte ştiri de Jurnal.md\nAcum 10 minute\n13:00\n[Zaharova, corectată de MAE român, după mesajul despre Dimitrie Cantemir: „Aşa-zisa limbă moldovenească nu există”](/ro/s/14677272) [#](/ro/story/14677272) [Jurnal.md](/ro/b/jurnal)\nZaharova, corectată de MAE român, după mesajul despre Dimitrie Cantemir: „Aşa-zisa limbă moldovenească nu există” Purtătorul de cuvânt al Ministerului Afacerilor Externe, Radu Filip, i-a răspuns purtătoarei de cuvânt a MAE rus, Maria Zaharova, care a făcut referire la limba moldovenească, şi a afirmat că există dovezi ştiinţifice că aceasta nu există, fiind doar limba română. Purtătoarea de cuvânt a MAE rus, Maria Zaharova, a transmis, vineri, un mesaj la marcarea a 350 de ani de la naşterea lui...\nAcum 30 minute\n12:50\nAur pentru Republica Moldova: Judocanul Denis Vieru a devenit campion european Judocanul Denis Vieru a devenit campion european la seniori. Sportivul nostru l-a învins în finala categoriei de greutate de până la 66 kg pe spaniolul David Garcia Torne. Până a ajunge în ultimul act al competiției, care se desfășoară în aceste zile în orașul Montpellier, Franța, Denis Vieru a trecut pe rând de armeanul Artyom Ghalachyan, finlandezul Luukas Saha și azerul Yashar Najafov. Denis Vieru a mai fost premia...\nAcum 2 ore\n11:50\nFAO: Prețurile mondiale la alimente au scăzut ușor în luna noiembrie Indicele global al preţurilor produselor alimentare a coborât în luna octombrie la cel mai redus nivel din ultimii doi ani şi jumătate graţie scăderile înregistrate la zahăr, cereale, uleiuri vegetale şi carne, a anunţat vineri Organizaţia Naţiunilor Unite pentru Alimentaţie şi Agricultură (FAO). FAO publică lunar propriul său Food Price Index, care măsoară modificările de preţuri înregistrate la un coş de alimente format din c...\n11:10\n[Împărțeau pliante electorale cu „Șansa” la Bălți; 11 persoane, printre care 4 minori, au ajuns pe mâna Poliției](/ro/s/14677077) [#](/ro/story/14677077) [Jurnal.md](/ro/b/jurnal)\nÎmpărțeau pliante electorale cu „Șansa” la Bălți; 11 persoane, printre care 4 minori, au ajuns pe mâna Poliției Poliția din Bălți a reținut pentru documentare 11 persoane, reprezentanți ai partidului politic Șansa, printre care și 4 minori. Oamenii legii au stabilit că suspecții, aseară, au fost implicați în activitatea ilegală de repartizare a pliantelor electorale în susținere unui alt candidat afliliat partidului politic, scos în afara legii, „Șor”. Din declarațiile persoanelor, polițiștii au...\nAcum 4 ore\n10:40\n[Un nou caz de corupere a alegătorilor: O femeie a încercat să „cumpere” votul unui bărbat de la Vatra](/ro/s/14677014) [#](/ro/story/14677014) [Jurnal.md](/ro/b/jurnal)\nUn nou caz de corupere a alegătorilor: O femeie a încercat să „cumpere” votul unui bărbat de la Vatra Poliția a fost sesizată ieri seara de un bărbat din localitatea Vatra, municipiul Chişinău, care a semnalat că la poarta gospodăriei sale s-a apropiat o femeie care i-a propus o sumă de bani, pentru a vota duminică candidatul din partea unui partid politic. S-a stabilit că este vorba despre o femeie de 45 de ani, din Vatra, care avea asupra sa o listă cu 17 persoane și numerele de telefon ale ac...\n10:10\n[31 de persoane nu au fost lăsate să intre în Republica Moldova în ultimele 24 de ore; Situația la frontieră](/ro/s/14676950) [#](/ro/story/14676950) [Jurnal.md](/ro/b/jurnal)\n31 de persoane nu au fost lăsate să intre în Republica Moldova în ultimele 24 de ore; Situația la frontieră În punctele de trecere a frontierei, fluxul de persoane a constituit 56.356 traversări, un număr mai mare fiind consemnat pe sensul de intrare în Republica Moldova – 28.313 traversări persoane. Mai multe traversări au fost ale cetățenilor străini – 31.874, iar traversările cetățenilor moldoveni au constituit 24.482. Cea mai activă frontieră a fost cu România – 32.672 traversări, la granița...\n10:00\nPreşedinta Comisiei Europene, Ursula von der Leyen, a ajuns astăzi la Kiev într-o vizită care nu fusese anunţată oficial, a scris deputatul ucrainean Iaroslav Jelezniak într-un mesaj pe canalul său de Telegram, preluat de Reuters și Agerpres....\n09:40\n[Ploi slabe în aproape toată țara, astăzi; Cum va fi vremea în weekend și ce temperaturi ne promit meteorologii](/ro/s/14676885) [#](/ro/story/14676885) [Jurnal.md](/ro/b/jurnal)\nUrmătoarele trei zile ne aduc o vreme destul de variabilă, cu un regim termic ușor mai ridicat decât în zilele recente. Astăzi se prevăd ploi slabe într-o mare parte a țării, izolat însoțite de descărcări electrice și vijelie, în partea de nord local averse puternice....\nAcum 6 ore\n07:10\n[O moldoveancă, proprietara unui restaurant la Bordeaux; Mâncărurile din Basarabia cuceresc inimile francezilor](/ro/s/14676725) [#](/ro/story/14676725) [Jurnal.md](/ro/b/jurnal)\nO moldoveancă, proprietara unui restaurant la Bordeaux; Mâncărurile din Basarabia cuceresc inimile francezilor O femeie din Cahul a devenit cunoscută în toată Europa datorită talentului său culinar. Oxana Crețu aduce aromele copilăriei din Basarabia în bucătăria franceză de top. Este proprietara unui restaurant în orașul francez Bordeaux și recent a atras atenția inspectorilor Michelin. Aceștia au inclus-o pe femeia de afaceri în celebrul Ghid al gastronomiei. Oxana Crețu a venit pentru câteva z...\nAcum 24 ore\n22:30\nBarcelona îi caută înlocuitor lui Robert Lewandowski Robert Lewandowski (35 de ani) a fost transferat de Barcelona în vara anului 2022, după ce catalanii le-au plătit celor de la Bayern Munchen 45 de milioane de euro. Chiar dacă a avut un aport foarte mare în titlul câștigat de Barcelona în sezonul trecut, Lewandowski a început să aibă probleme cu accidentările, iar catalanii îi caută deja înlocuitor polonezului. Chiar dacă l-au transferat pe brazilianul Vitor Roque, catalanii mai vor întăriri î...\n21:00\nDecizia luată de Bas Dost după ce s-a prăbușit pe teren Atacantul olandez Bas Dost (34 de ani) s-a prăbuşit din senin pe gazon în prelungirile meciului pe care echipa sa, NEC Nijmegen, îl juca împotriva celor de la AZ Alkmaar, în etapa a 10-a din Eredivisie. Din fericire, situația lui Bas Dost a fost remediată, după ce acesta a ajuns la spital și a fost ajutat de serviciile de urgență prezente. Atacantul olandez a luat o decizie după problemele medicale. Astfel, după ce a ajuns la spital și a fo...\n20:30\n[Reprezentantul unui partid, prins în sudul țării în timp ce împărțea plicuri cu bani în schimbul promisiunii votului](/ro/s/14676298) [#](/ro/story/14676298) [Jurnal.md](/ro/b/jurnal)\nVIDEO: Reprezentantul unui partid, prins în sudul țării în timp ce împărțea plicuri cu bani în schimbul promisiunii votului Un tânăr din Comrat a fost prins în această seară împărțind plicuri cu bani, în schimbul promisiunii voturilor la alegerile de duminică, 5 noiembrie. În jurul orei 17:00, un cetățean din sudul țării a sesizat Poliția despre faptul că reprezentantul unui partid politic corupe localnicii în schimbul voturilor. „În rezultatul documentării, polițiștii au stabilit că în activita...\n20:10\nVIDEO: Mesajul Maiei Sandu către cetățeni înainte de alegerile de duminică Republica Moldova face pași mari pe calea integrării europene datorită votului cetățenilor la alegerile parlamentare, iar votul de duminică, 5 noiembrie, la alegerile locale, are o putere la fel de mare. În următorii patru ani, de primarii și consilierii pe care-i alegem acum va depinde cum se va trăi în fiecare localitate. Declarațiile au fost făcute de președinta Maia Sandu într-o adresare către cetățeni, în contextul a...\n19:50\n[Biserica Rusă vrea ca Alla Pugaciova, întoarsă recent din Israel, să prezinte scuze pentru că a criticat invadarea Ucrainei](/ro/s/14676180) [#](/ro/story/14676180) [Jurnal.md](/ro/b/jurnal)\nBiserica Rusă vrea ca Alla Pugaciova, întoarsă recent din Israel, să prezinte scuze pentru că a criticat invadarea Ucrainei Biserica Ortodoxă Rusă vrea ca artista Alla Pugaciova, care săptămâna aceasta s-a întors în Rusia din Israel, să prezinte scuze pentru criticile sale la adresa războiului Rusiei din Ucraina. Alla Pugaciova, în vârstă de 74 de ani, care timp de decenii a fost extrem de populară în Rusia şi în alte părţi ale fostei Uniuni Sovietice, a părăsit ţara ducându-se în Israel împreun...\n19:40\nLituania cere bani de la UE pentru a-şi extinde infrastructura militară Lituania vrea ajutor financiar din partea UE pentru a-şi extinde infrastructura de mobilitate rapidă pentru forţele NATO de la graniţa de est a alianţei militare, a spus vineri, la Vilnius, ministrul lituanian de finanţe Gintare Skaiste. În urma deciziei Germaniei privind staţionarea permanentă a circa 4.000 de militari în Lituania, Vilnius şi-a bugetat 280 de milioane de euro pentru dezvoltarea infrastructurii, a spus Skais...\n19:00\nL'Equipe a anunțat cele două echipe care se luptă pentru semnătura lui Kylian Mbappe Viitorul lui Kylian Mbappe (24 de ani) continuă să fie unul dezbătut, iar destinația starului francez din vara anului 2024 rămâne un adevărat mister. Kylian Mbappe va deveni jucător liber de contract la finalul acestui sezon, în cazul în care nu se va decide să semneze prelungirea cu PSG. De situația fotbalistului vrea să profite Real Madrid, care îi pregătește starului francez o ofertă pe măsură, dar și un stat...\n18:30\n[Criză de notari în mai multe raioane; Ministerul Justiției anunță concurs pentru 33 de funcții de notar](/ro/s/14676002) [#](/ro/story/14676002) [Jurnal.md](/ro/b/jurnal)\nCriză de notari în mai multe raioane; Ministerul Justiției anunță concurs pentru 33 de funcții de notar Ministerul Justiției anunță că a actualizat numărul locurilor de notari necesari în întreaga țară și a scos 33 de funcții la concurs. Deși Legea cu privire la organizarea activității notarilor prevede că numărul necesar de notari se stabilește de către Ministerul Justiției, o dată la fiecare trei ani, după consultarea Camerei Notariale, acest lucru nu s-a efectuat din anul 2016. Din această ca...\n17:50\nErik ten Hag a egalat un record negativ vechi de 61 de ani Olandezul Erik ten Hag (53 de ani) a fost numit antrenorul lui Manchester United în vara anului 2022, după o perioadă foarte bună pe care a avut-o la Ajax Amsterdam. Chiar dacă a reușit să le aducă ”diavolilor” în sezonul trecut primul trofeu după o pauză de șase ani, și anume Cupa Ligii câștigată în fața lui Newcastle United, scor 2-0, olandezul nu are parte de cea mai bună perioadă a sa la Manchester. United a pierdut derby-ul orașului...\n17:40\nSecretarul de stat american Antony Blinken, din nou la Tel Aviv Armata israeliană a anunţat că a încercuit ieri oraşul Gaza, la o săptămână de la începerea operaţiunii sale terestre în Fâşie, și că a eliminat peste 130 de terorişti Hamas. Israelul spune că îi returnează în Gaza pe toţi muncitorii din Fâşie, blocaţi pe teritoriul israelian după atacul din 7 octombrie şi că taie toate legăturile cu enclava palestiniană controlată de islamiști. Între timp, la Tel Aviv a ajuns, din nou, secretarul d...\n17:30\n[TOȚI candidații PP „Șansa”, excluși din alegeri; Recean: „E scoasă o grupare criminală, nu un partid”](/ro/s/14675827) [#](/ro/story/14675827) [Jurnal.md](/ro/b/jurnal)\nUltima oră! TOȚI candidații PP „Șansa”, excluși din alegeri; Recean: „E scoasă o grupare criminală, nu un partid” Toți candidații Partidului Politic „Șansa” au fost excluși din cursa electorală a alegerilor locale de duminică. Anunțul a fost făcut de premierul Dorin Recean, decizia fiind luată cu puțin timp în urma de Comisia Situații Excepționale. „Se anulează înregistrarea concurenților electorali desemnați de către PP Șansa în cadrul alegerilor locale generale din 5 noiembrie 2023. Comisia El...\n17:20\n[TOȚI candidații PP „Șansa”, exluși din alegeri; Recean: „E scoasă o grupare criminală, nu un partid”](/ro/s/14675783) [#](/ro/story/14675783) [Jurnal.md](/ro/b/jurnal)\nUltima oră! TOȚI candidații PP „Șansa”, excluși din alegeri; Recean: „E scoasă o grupare criminală, nu un partid” Toți candidații Partidului Politic „Șansa” au fost excluși din cursa electorală a alegerilor locale de duminică. Anunțul a fost făcut de premierul Dorin Recean, decizia fiind luată cu puțin timp în urma de Comisia Situații Excepționale. „Se anulează înregistrarea concurenților electorali desemnați de către PP Șansa în cadrul alegerilor locale din 5 noiembrie 2023”, este decizia CSE....\n16:40\n[Energocom va vinde către Moldovagaz, pentru lunile octombrie-decembrie, gaze cu circa 605 dolari/1000 de metri cubi](/ro/s/14675624) [#](/ro/story/14675624) [Jurnal.md](/ro/b/jurnal)\nEnergocom va vinde către Moldovagaz, pentru lunile octombrie-decembrie, gaze cu circa 605 dolari/1000 de metri cubi Energocom va vinde către Moldovagaz, pentru lunile octombrie-decembrie, gaze cu circa 605 dolari/ 1000 de metri cubi. Decizia a fost aprobată la Consiliul Energocom astăzi, 3 noiembrie. Relația comercială dintre Energocom și Moldovagaz se bazează pe hotărârea de Guvern nr. 589 din 2022 cu privire la impunerea obligației de serviciu public în vederea asigurării securității aprovizio...\n16:30\n[Traficul rutier de pe strada Nicolae Dimo din capitală, suspendat pe 6 și 7 noiembrie; Cum va circula transportul public](/ro/s/14675589) [#](/ro/story/14675589) [Jurnal.md](/ro/b/jurnal)\nTraficul rutier de pe strada Nicolae Dimo din capitală, suspendat pe 6 și 7 noiembrie; Cum va circula transportul public Primăria Municipiului Chișinău informează că pe 6 și 7 noiembrie va fi suspendat traficul rutier pe strada Nicolae Dimo, în perimetrul străzilor Miron Costin și Alecu Russo. Măsura este luată în legătură cu necesitatea executării lucrărilor de lichidare a consecințelor unei avarii la rețelele de apeduct și canalizare din strada Nicoale Dimo. În perioada menționată, transportul...\n16:30\nPremieră pentru Denis Vieru: S-a calificat în finala Campionatului European Un nou succes de răsunet pentru judo-ul moldovenesc. Denis Vieru și-a asigurat o medalie la Campionatul European. Denis Vieru, în limitele categoriei de 66 kg, s-a calificat în premieră în finala Campionatului European, asigurându-și cel puțin medalia de argint! În Franța el i-a învins pe armeanul Artyom Ghalachyan, finlandezul Luukas Saha și azerul Yashar Najafov. În lupta pentru medalia de aur continentală Denis Vieru...\n15:50\n[”Lovitură” pentru Michael Jordan, înaintea căsătoriei fiului său cu o femeie cu 17 ani mai în vârstă: ”Păstrăm tradiția”](/ro/s/14675430) [#](/ro/story/14675430) [Jurnal.md](/ro/b/jurnal)\n”Lovitură” pentru Michael Jordan, înaintea căsătoriei fiului său cu o femeie cu 17 ani mai în vârstă: ”Păstrăm tradiția” Larsa Pippen (49 de ani), fosta soție a legendarului baschetbalist Scottie Pippen (58 de ani), și-a oficializat în iarna anului trecut relația cu Marcus Jordan (32 de ani), iar cei doi vor să se căsătorească. Marcus Jordan este nimeni altul decât fiul lui Michael Jordan (60 de ani), coechipier cu Scottie Pippen la Chicago Bulls în anii '90, când au făcut parte dintr-una dintre...\n15:50\n[„Îi dau lui Petrovici 30; Numără-i tu”: CNA a publicat imagini din dosarul deputatei Irina Lozovan](/ro/s/14675429) [#](/ro/story/14675429) [Jurnal.md](/ro/b/jurnal)\nVIDEO: „Îi dau lui Petrovici 30; Numără-i tu”: CNA a publicat imagini din dosarul deputatei Irina Lozovan Centrul Național Anticorupție a publicat vineri, 3 noiembrie, imagini video din dosarul în care deputata Irina Lozovan și soțul său, consilier în cadrul Consiliului raional Ocnița, Pavel Gîrleanu, sunt acuzați că au acceptat ca grupul criminal condus de fugarul Ilan Șor să finanțeze ilegal Partidul „Renaștere”. Precizăm că Procuratura Anticorupție a anunțat ieri că a finalizat urmărirea pena...\n15:10\n[Două medalii de bronz și o mențiune de onoare pentru Republica Moldova la Olimpiada Balcanică de Informatică](/ro/s/14675296) [#](/ro/story/14675296) [Jurnal.md](/ro/b/jurnal)\nDouă medalii de bronz și o mențiune de onoare pentru Republica Moldova la Olimpiada Balcanică de Informatică Echipa Republicii Moldova a obținut două medalii de bronz și o mențiune de onoare la Olimpiada Balcanică de Informatică, care a avut loc la Maribor, Slovenia, în perioada 29 octombrie - 3 noiembrie 2023, informează Ministerul Educației. Medaliați cu bronz sunt Timur Degteari, elev al Liceului Teoretic „Orizont” din mun. Chișinău și Marian Soltan, elev al Liceului Teoretic Republican „Aris...\n14:40\nNouă spitale din țară au primit ambulanțe noi, cumpărate cu suportul Uniunii Europene Ministerul Sănătății informează că a distribuit astăzi nouă ambulanțe de tip A mai multor instituții medico-sanitare din țară. Autosanitare au primit spitalele raionale Edineț, Căușeni, Ungheni, Orhei, Soroca, Ceadîr-Lunga, insituțiile republicane Spitalul Clinic Bălți, Institutul Mamei și Copilului și instituția municipală Spitalul Clinic Municipal „Gheorghe Paladi”. Autosanitarele, în valoare de 586 de mii de...\n14:40\n[Program special la Jurnal TV de alegeri; Știri din oră în oră, ediții speciale și rezultatele scrutinului în direct](/ro/s/14675176) [#](/ro/story/14675176) [Jurnal.md](/ro/b/jurnal)\nProgram special la Jurnal TV de alegeri; Știri din oră în oră, ediții speciale și rezultatele scrutinului în direct Duminică, 5 noiembrie, fiți cu ochii pe Jurnal TV pentru a urmări mersul alegerilor în direct și a fi la curent cu cele mai noi și importante informații ale zilei. Jurnal TV te va informa pe parcursul întregii zile, din oră în oră, despre cum decurge procesul de vot. Reporterii Jurnal TV vor umări cu atenție tot ce se va întâmpla la secțiile de votare și vor transmite în direct din...\n14:30\n[Moldovenii pot călători mai ușor în Grecia; Start zborurilor regulate Atena - Chișinău - Atena](/ro/s/14675148) [#](/ro/story/14675148) [Jurnal.md](/ro/b/jurnal)\nMoldovenii pot călători mai ușor în Grecia; Start zborurilor regulate Atena - Chișinău - Atena Pe Aeroportul Internațional Chișinău a aterizat astăzi, în premieră, aeronava companiei elene Aegean Airlines, care a efectuat prima cursă pe direcția Atena – Chișinău. Astfel, de astăzi, Aegean Airlines va opera zboruri directe regulate Atena – Chișinău – Atena. Frecvența zborurilor va fi de două ori pe săptămână, în zilele de marți și vineri. „Începând de astăzi, cetățenii noștri vor putea călători m...\n14:20\n[Moldovenii vor putea călători mai ușor în Grecia; Start zborurilor regulate Atena - Chișinău - Atena](/ro/s/14675112) [#](/ro/story/14675112) [Jurnal.md](/ro/b/jurnal)\nMoldovenii pot călători mai ușor în Grecia; Start zborurilor regulate Atena - Chișinău - Atena Pe Aeroportul Internațional Chișinău a aterizat astăzi, în premieră, aeronava companiei elene Aegean Airlines, care a efectuat prima cursă pe direcția Atena – Chișinău. Astfel, de astăzi, Aegean Airlines va opera zboruri directe regulate Atena – Chișinău – Atena. Frecvența zborurilor va fi de două ori pe săptămână, în zilele de marți și vineri. „Începând de astăzi, cetățenii noștri vor putea călători m...\n13:30\nANRE anunță cât vor costa benzina și motorina în următoarele trei zile Agenția Națională pentru Reglementare în Energetică (ANRE) a stabilit noi prețuri plafon la carburanţi pentru următoarele trei zile, 4-6 noiembrie. Benzina va costa cu 4 bani mai ieftin, iar motorina cu 7 bani mai puțin. ANRE informează că constată în ultima perioadă o ușoară tendință de descreștere a cotațiilor Platts la produsele petroliere pe bursele internaționale. Astfel, în intervalul ultimelor 14 zile utilizat la calcu...\n13:10\nO casă din Dondușeni a luat foc; Un copil de 2 ani, scos din flăcări de verișorul său Un copil de doi ani și jumătate a fost salvat din flăcări de verișorul său în vârstă de 17 ani, după ce le-a luat foc casa. Potrivit IGSU, cazul s-a întâmplat aseară, în localitatea Tîrnova din raionul Dondușeni. Minorii erau singuri acasă. Copilul de 2 ani nu a avut de suferit, iar adolescentul s-a ales cu arsuri la membrele superioare. Acesta a fost preluat de medici și dus la spitalul raional. Pompierii IGSU...\nIeri\n13:00\nChelsea, ofertă de 52.000.000€ pentru un atacant din Serie A Chelsea a cheltuit în această vară nu mai puțin de 465 de milioane de euro pentru transferuri. Totuși, ”Aristocrații” au reușit să îi aducă lui Mauricio Pochettino un singur atacant: Nicolas Jackson (22 de ani), de la Villarreal pentru 37 de milioane de euro. Tehnicianul argentinian își mai dorește un vârf de atac, iar Todd Boehly e gata să îi facă pofta. Potrivit celor de la Fichajes, Chelsea a pregătit o ofertă în valoare de 52 de mi...\n12:30\n[Iran: Peste 30 de persoane au murit într-un incendiu izbucnit la un centru de reabilitare a consumatorilor de droguri](/ro/s/14674751) [#](/ro/story/14674751) [Jurnal.md](/ro/b/jurnal)\nIran: Peste 30 de persoane au murit într-un incendiu izbucnit la un centru de reabilitare a consumatorilor de droguri Un incendiu de proporţii izbucnit la un centru de reabilitare a consumatorilor de droguri a provocat, în nordul Iranului, moartea a cel puţin 32 de persoane şi rănirea alor 16, dintre care patru sunt în stare gravă, a anunţat vineri presa iraniană, relatează Reuters și News.ro. Investigaţiile iniţiale au arătat că un reşou din centrul de dezintoxicare pentru opiu din Langarud, în...\n12:10\n[Transferul e iminent: Luis Suarez merge să semneze contractul! La ce echipă va juca din iarnă](/ro/s/14674677) [#](/ro/story/14674677) [Jurnal.md](/ro/b/jurnal)\nTransferul e iminent: Luis Suarez merge să semneze contractul! La ce echipă va juca din iarnă Luis Suarez (36 de ani) urmează să plece de la Gremio, echipă care l-a convins să semneze la finalul anului trecut, în perioada de mercato a iernii. După ce a părăsit fotbalul european pentru Brazilia, \"El Pistolero\" va schimba din nou continentul și va ajunge în Statele Unite ale Americii, unde va semna cu Inter Miami. Potrivit publicației spaniole El Pais, nu mai există cale de întoarcere pentru Suare...\n12:00\n[SIS: Peste un miliard de lei a cheltuit Rusia pentru destabilizarea situației din R. Moldova](/ro/s/14674639) [#](/ro/story/14674639) [Jurnal.md](/ro/b/jurnal)\nSIS: Peste un miliard de lei a cheltuit Rusia pentru destabilizarea situației din R. Moldova // VIDEO În contextul alegerilor locale din 5 noiembrie, SIS a identificat activități de influențare a proceselor electorale în scopul promovării interesului Federației Ruse prin intermediul grupului criminal organizat condus de Ilan Șor, a anunțat directorul Serviciului de Informații și Securitate, Alexandru Musteață, în cadrul unui briefing. Potrivit lui Musteață, banii oferiți de Rusia pentru destabil...\n11:10\nCe se întâmplă cu meciul Marseille - Lyon! Decizia Ligii Profesioniste din Franța Meciul Marseille - Lyon, anulat duminică, după ce autocarul echipei oaspete a fost lovit cu pietre şi antrenorul lui OL, Fabio Grosso, a fost rănit, se va juca pe 6 decembrie într-un loc care va fi stabilit \"ulterior\", a anunţat joi Liga Profesionistă Franceză de fotbal (LFP). \"Comisia de competiţii a LFP a decis pe de o parte, aplicând articolul 544 din regulament, (...) ca acest meci să se joace miercuri, 6 decem...\n10:50\nLe-a promis o piață modernă, dar vând și azi, prostiți, în stradă // FOTO Cu trei ani în urmă, odată cu începutul pandemiei de Covid, vânzătorii din piața agricolă de pe bulevardul Dacia s-au trezit alungați în stradă. Afaceriștii care au pus mâna pe piață au profitat de perioada de izolare de la început de pandemie și au început rapid construcția unei clădiri. Acest fapt a stârnit scandal în spațiul public, atât din partea vânzătorilor, care se simțeau prostiți, dar și a cumpărătorilor, care vo...\n10:30\n[LIVE: Directorul SIS, anunț de ultimă oră privind securitatea națională în contextul războiului hibrid](/ro/s/14674291) [#](/ro/story/14674291) [Jurnal.md](/ro/b/jurnal)\nLIVE: Directorul SIS, anunț de ultimă oră privind securitatea națională în contextul războiului hibrid Directorul Serviciului de Informații și Securitate, Alexandru Musteață, susține un briefing de presă începând cu ora 10:00. Potrivit SIS, Alexandru Musteață va comunica un mesaj important pentru securitatea națională în contextul războiului hibrid....\n10:30\nSergio Ramos are ușa închisă la naționala Spaniei; Anunțul selecționerului Din această vară, Sergio Ramos (36 de ani) a revenit la Sevilla, iar fundașul spaniol și-ar fi dorit să revină la prima reprezentativă, chiar dacă își anunțase retragerea la începutul acestui an. Cu toate acestea, Sergio Ramos are șanse minime să revină la națională, iar selecționerul Luis de la Fuente a făcut un anunț clar. Tehnicianul a spus că fostul fundaș de la Real Madrid și PSG nu intră în planurile sale și că pref...\n10:30\n[Asigura deținuții cu droguri: Un pușcăriaș de la penitenciarul Soroca, trimis în judecată](/ro/s/14674289) [#](/ro/story/14674289) [Jurnal.md](/ro/b/jurnal)\nAsigura deținuții cu droguri: Un pușcăriaș de la penitenciarul Soroca, trimis în judecată // VIDEO Un deținut de la penitenciarul din Soroca și complicele său de la libertate au fost trimiși în judecată pentru asigurarea deținuților cu droguri. Potrivit PCCOCS, este vorba despre droguri de tip marijuana și hașiș, dar și pastile cu efect psihotrop. Faptele au avut loc începând cu noiembrie 2022 și până în primele patru luni ale lui 2023. Astfel, deținutul cu vârsta de 33 de ani, care-și ispășește...\n10:20\n[Fundația Moldcell oferă 20 de burse studenților la programul de licență Profesiile Viitorului](/ro/s/14674242) [#](/ro/story/14674242) [Jurnal.md](/ro/b/jurnal)\nFundația Moldcell oferă 20 de burse studenților la programul de licență Profesiile Viitorului Fundația Moldcell a lansat concursul de Burse de Merit 2023-2024 pentru programele de învățământ superior „Profesiile viitorului” la trei universități din Republica Moldova: Universitatea de Stat din Moldova, Universitatea Tehnică și Universitatea Pedagogică de Stat „Ion Creangă”. Această inițiativă are scopul de a recunoaștere și a recompensa performanțelor academice excepționale ale studenților la pro...\n10:00\n[LIVE: Directorul SIS, mesaj important privind securitatea națională în contextul războiului hibrid](/ro/s/14674165) [#](/ro/story/14674165) [Jurnal.md](/ro/b/jurnal)\nLIVE: Directorul SIS, mesaj important privind securitatea națională în contextul războiului hibrid Directorul Serviciului de Informații și Securitate, Alexandru Musteață, susține un briefing de presă începând cu ora 10:00. Potrivit SIS, Alexandru Musteață va comunica un mesaj important pentru securitatea națională în contextul războiului hibrid....\n09:50\n[\"Cel mai mare impostor al secolului 21\": cum a reușit un fotbalist-fantomă să semneze cu 4 echipe fără să joace un minut](/ro/s/14674122) [#](/ro/story/14674122) [Jurnal.md](/ro/b/jurnal)\n\"Cel mai mare impostor al secolului 21\": cum a reușit un fotbalist-fantomă să semneze cu 4 echipe fără să joace un minut Bernio Verhagen are o poveste atipică oricărui fotbalist profesionist, iar asta tocmai pentru că, în realitate, nu a fost niciodată unul, deși a avut mai multe contracte în acest sens. Născut în Suriname, tânărul de 29 de ani s-a mutat cu familia în Olanda, unde și-a petrecut copilăria, iar junioratul la Willem II. Când a venit vremea să treacă la nivel de seniori, nu a avut c...\n09:30\nAstăzi este ultima zi în care este permisă agitația electorală Comisia Electorală Centrală atenționează că astăzi, 3 noiembrie 2023, este ultima zi în care sunt admise acțiuni de agitație electorală pentru alegerile locale generale, care vor avea loc în această duminică, 5 noiembrie 2023. Conform prevederilor Codului electoral, agitația electorală este strict interzisă în ziua alegerilor și cea precedentă ei. În această perioadă nu este permisă nici apariția candidaților în alegeri la emisiuni t...\n09:20\nProiect de promovare a modului sănătos de viață: Polițiștii au trecut testul HIV // VIDEO Mai mulți ofițeri de poliție din Chișinău, Bălți, Cahul și Leova au fost testați joi, 2 noiembrie, la HIV, într-un proiect de promovare a modului sănătos de viață. Dacă oamenii află mai multe despre statutul lor în acest sens, ei primesc tratamentul şi sprijinul necesar. Cel mai important este că nu transmit mai departe maladia și contribuie la stoparea epidemiei HIV, afirmă inițiatorii proiectului. Activit...\n09:00\n[Premieră în comunicații unificate: Moldtelecom a devenit partenerul exclusiv Wildix în Republica Moldova](/ro/s/14673950) [#](/ro/story/14673950) [Jurnal.md](/ro/b/jurnal)\nPremieră în comunicații unificate: Moldtelecom a devenit partenerul exclusiv Wildix în Republica Moldova Moldtelecom a devenit partener unic Wildix în Republica Moldova. Acest statut oferă companiei posibilitatea de a extinde portofoliul de servicii și să-și consolideze poziția de furnizori principali pe piața telecomunicațiilor din țară. Prin intermediul acestei colaborări, Moldtelecom își demonstrează angajamentul față de digitalizarea continuă a serviciilor și îmbunătățirea experienței clienț...\n08:50\n[Urmează o nouă reducere a angajaților Ambasadei Ruse la Chișinău? Grosu: „Au mai rămas din cei ce n-au treabă cu diplomația”](/ro/s/14673918) [#](/ro/story/14673918) [Jurnal.md](/ro/b/jurnal)\nAmbasadorul rus la Chișinău a fost informat despre faptul că în structura Ambasadei Ruse în Republica Moldova au mai rămas persoane care nu au nicio legătură cu diplomația. Despre aceasta a menționat speakerul Igor Grosu, în cadrul emisiunii „Cabinetul din Umbră” de la Jurnal TV....\n08:50\nPapa Francisc: Nu există învingători reali în niciun război Nu există învingători reali în niciun război, a spus, Papa Francisc, în timpul unei vizite la un cimitir militar din Roma, făcând referire la conflictele din Orientul Mijlociu şi din Ucraina, au transmis ANSA şi Reuters, citate de Agerpres „Războaiele sunt întotdeauna o înfrângere, întotdeauna. Nu există victorie totală. O parte o învinge pe cealaltă, dar preţul plătit este întotdeauna o înfrângere”, a spus Papa, într-o slujbă oficiată...\n©2004—2023\nRepublicarea materialelor este posibila doar cu acordul sursei.\nNews.yam.md. Toate titlurile si continutul stirilor apartin surselor respective.\nRepublicarea materialelor este posibila doar cu acordul sursei.","highlightText":"","highlightTitle":"","highlightThreadTitle":"","language":"romanian","sentiment":null,"categories":null,"external_links":[],"external_images":[],"entities":{"persons":[],"organizations":[],"locations":[]},"rating":null,"crawled":"2023-11-04T13:07:15.279+02:00","updated":"2023-11-04T13:07:15.279+02:00"}