{"thread":{"uuid":"9791edf5a7e5ed89448f41e30b80348c985dc0a5","url":"http://csnbbs.com/thread-978948-page-29.html","site_full":"csnbbs.com","site":"csnbbs.com","site_section":"https://csnbbs.com/forum-540.html","site_categories":["tech","net_conferencing"],"section_title":"CSNbbs - The Kyra Memorial Spin Room ","title":"The Israeli-Hamas War","title_full":"The Israeli-Hamas War","published":"2023-11-03T16:13:00.000+02:00","replies_count":19,"participants_count":14,"site_type":"discussions","country":"US","main_image":"","performance_score":0,"domain_rank":454279,"domain_rank_updated":"2023-10-31T12:16:55.000+02:00","reach":null,"social":{"facebook":{"likes":0,"comments":0,"shares":0},"gplus":{"shares":0},"pinterest":{"shares":0},"linkedin":{"shares":0},"stumbledupon":{"shares":0},"vk":{"shares":0}}},"uuid":"6dc7a67d9cd9a72866a1eba24866da736a890737","url":"http://csnbbs.com/thread-978948-page-29.html#pid19252921","ord_in_thread":7,"parent_url":null,"author":"BlueDragon","published":"2023-11-01T20:35:00.000+02:00","title":"","text":"(11-01-2023 01:35 PM) Quote: : (11-01-2023 12:39 PM) Quote: : (11-01-2023 09:11 AM) Quote: : My opinion only:\nLet's say this is true. This will accomplish a very important objective for Russia and Iran. It will force even more that te USA gets bogged down in the middle east, taking pressure off of the Ukraine War.\nRussia has the same issues as the USA, it is why they are so dependent on Iranian arms.\nIt opens the door for China to invade Taiwan.\nObviously, if ends up being true instead of rhetoric sabre rattling....they see America as weak. Israel being bogged down in Gaza as a great opportunity to advance their hopes and dreams of destroying Israel.\nGlobal war will be more than just a regional conflict, not so much as a military to miitary conflict, except in Ukraine and Middle East and maybe Taiwan, but rather an interior within the countries at war with their radicalized muslim inhibitants, etc. But that is just me.\nI dont think we are going to get bogged down there. Not in any real boots on the ground sense. It does help Russia in that some weapons/ammo that might have been sent to Ukraine will now be diverted to Israel---but I dont see any artillery hungry war developing in the Middle East like what we see in Ukraine. Frankly, if there was going to be a set up for China to attack Taiwan----I think we'd see a major move by their puppet in N Korea. A move south by N Korea would tend to tie up a significant amount of US forces and be the kind of artillery/missile heavy conflict that might put us in a position where ammo supplies become a serious problem----serious enough that we might be very limited in how much help we can supply Taiwan, Ukraine, and Israel. The only glimmer of hope for Taiwan in that situation is Korea, Israel, and Ukraine are not theaters that require many anti-ship missiles or torpedoes. So, supplies of those kinds of weapons---that would be very helpful to Taiwan should be in fairly good supply.\nI can't picture a outcome of where China comes out better by invading Taiwan. No matter what some people think, long term, hell even short term China needs the American markets more than America needs China. To survive.\nThe only outcome where that doesn't happen is if Russia control Europe. I don't see a outcome where that happens without destroying the world. Without the USA and Europe markets with in 5 years China is back to being poor farmers.\nInvading Taiwan, is the start of that unless we are all under China or Russia's control. That just isn't going to happen unless most of this world is destroyed. Even if America is broke almost everything we need to survive is already here or can be in place with in a year or so\nChina on the other hand has to have the money to import their food, oil, many other things it takes to survive. Without the American dollars or control of Europe they can not do that long term.\nSo their only other step is to have Russia's help in taking over Europe, along with Africa which they already have both feed in but would be harder to actually control in a war.\nSo unless China believes they can win control of this world I don't see them invading Taiwan. Some people on this board can think what they want of the American people of today\nif it comes a point where freedom is at stake most of these people will grow up fast and will learn quickly what it means to have that freedom. Just as in the 1st and 2nd World War. I don't believe Americans in their soul has changed much from when Washington said...\n\"The Christian America would rather die on their feet than to survive on their knees\"\nTherein lies the whole CRUX of your Dilemma","highlightText":"","highlightTitle":"","highlightThreadTitle":"","language":"english","sentiment":null,"categories":null,"external_links":null,"external_images":[],"entities":{"persons":[],"organizations":[],"locations":[]},"rating":null,"crawled":"2023-11-04T13:11:33.640+02:00","updated":"2023-11-04T13:11:33.640+02:00"}