{"thread":{"uuid":"6e46e4fd2e5b49da030b80c15c3eb78279ff1ccc","url":"https://www.spamchronicles.com/us-tourist-stirs-up-trouble-with-her-long-list-of-things-she-hates-about-europe/","site_full":"www.spamchronicles.com","site":"spamchronicles.com","site_section":"https://www.spamchronicles.com","site_categories":[],"section_title":"S Chronicles","title":"US Tourist Stirs Up Trouble With Her Long List Of Things She Hates About Europe - S Chronicles","title_full":"US Tourist Stirs Up Trouble With Her Long List Of Things She Hates About Europe - S Chronicles","published":"2023-11-04T13:02:00.000+02:00","replies_count":0,"participants_count":1,"site_type":"news","country":null,"main_image":"https://www.spamchronicles.com/wp-content/uploads/2023/11/US-tourist-stirs-up-trouble-with-her-long-list-of.jpeg","performance_score":0,"domain_rank":866504,"domain_rank_updated":"2023-10-31T12:18:16.000+02:00","reach":null,"social":{"facebook":{"likes":0,"comments":0,"shares":0},"gplus":{"shares":0},"pinterest":{"shares":0},"linkedin":{"shares":0},"stumbledupon":{"shares":0},"vk":{"shares":0}}},"uuid":"6e46e4fd2e5b49da030b80c15c3eb78279ff1ccc","url":"https://www.spamchronicles.com/us-tourist-stirs-up-trouble-with-her-long-list-of-things-she-hates-about-europe/","ord_in_thread":0,"parent_url":null,"author":"Ashley Cornell, email: ashley.cornell@spamchronicles.com","published":"2023-11-04T13:02:00.000+02:00","title":"US Tourist Stirs Up Trouble With Her Long List Of Things She Hates About Europe - S Chronicles","text":"An American tourist has sparked debate online after sharing a long list of all the things she doesn’t like about Europe. The first clip in @thestrawberryannie’s two-part video series was seen by over 4.7 million people in one week. She told viewers: “I used to romanticize Europe, but after going there three times I feel like I’ve really seen what it really is.” So I was able to make a list of the things I didn’t really like.” The headline reads: “This list is based largely on the three week trip I spent last month in southern Spain, southern France and Italy.” “Not every single city or company was like this, but we found this to be common.” “We still love visiting European countries, but I definitely appreciate the Bucees toilets in the United States of America ” – read on for the TikToker’s full list. An American tourist has sparked debate online after sharing a long list of all the things she doesn’t like about Europe No spices The first thing on their list was the lack of spices. She said: “I feel like in America, we are very cheeky people and we have sauces or dips that go with everything, it comes with the food.” “They don’t have that there, so for example I ordered calamari, they didn’t serve it with cocktail sauce or tartar sauce or even a lemon wedge – there was nothing, it was dry.” “The food there is so dry that you have to pay extra for the sauce.” An American commentator added: “No calamari sauces are crazy.” That and no ice cream and Dr. Pepper, yes, I would cry if I had to live there permanently. No shower curtains Next, the TikToker complained about the lack of shower curtains: “There’s not a curtain in sight, it was all like glass walls, but half the tubs, the glass wall shower, only covered half the tub.” “You just had the feeling that you were getting water everywhere, which wasn’t very pleasant.” However, this was quickly defended in the comments, with one user writing: “Glass walls are so much better than curtains.” No washcloths She continued: “I couldn’t exfoliate in the shower, I just had to use my bare hands.” “That’s fine, but not really, because I put on a lot of sunscreen while I was there and at the end of the day I just wanted to scrub my skin off.” “They didn’t give you any washcloths, just a towel and a body towel – that’s it, not like a little washcloth.” Viewers were shocked by this point, writing: “You wanted to see a public washcloth!?!?!?” and “Real question: I would rather die than use a hotel washcloth, even if it was washed between customers.” Is this normal in the US?” The TikToker said: “Next up, we don’t have free water or free refills at restaurants.” “I spent so much money on water at restaurants that I really missed the unlimited giant glasses of cold water in America.” No free water or free refills The TikToker said: “Next up, we don’t have free water or free refills at restaurants.” “I spent so much money on water at restaurants that I really missed the unlimited giant glasses of cold water in America.” One commenter advised: “So many of these are actually available in Europe… you just have to know what to ask for.” “In most of Northern Europe you have to ask for tap water.” Another added: “Wait until there’s no more free water?” In most parts of Europe we literally drink tap water and it is completely safe and good.” No free public toilets Next she explained: “There are no free public toilets either, you have to go to the toilet somewhere you bought something, so I always went there when we went to restaurants.” “You would think that if you buy something and are in a facility, the bathroom will at least be nice – wrong.” “Wrong, even the bathrooms you pay for are disgusting.” This was the case in Spain, France and Italy. “Germany is a little better when it comes to bathroom amenities, but man oh man, those bathrooms are crusty.” Missing toilet seats On the subject of bathrooms, she added: “The toilets didn’t have seats, so I had to either squat or sit on the bare edge of a toilet. ‘It wasn’t fun.’ Viewers commented: “I’m sorry, NO TOILET SEATS??” and “I found the public toilets in Austria and Germany to be very clean but was still shocked that I had to pay for them.” Someone else wrote: “I went to Pompeii once and the bathroom was a hole in the ground.” No free hotel breakfast or vending machines She continued: “The hotel breakfast, which isn’t free, sucks too, you have to pay extra for that.” Not good old continental food. “There were also no vending machines in the hotels. So if you want a quick snack late at night, you’re in luck because there are no vending machines in the hotels.” One commenter advised: “The hotel breakfast actually has good food instead of egg powder. “It’s definitely worth paying for.” Long flat pillows Next, the TikToker said she didn’t like the pillows: “Even in the hotels, long, flat pillows.” They weren’t that fluffy, they rather covered the entire bed. “It was so long and just flat, I didn’t get my own pillow, it was just weird.” Sorry, is that rude? Not strange, different, it was different.’ Large beds were single beds pushed together She continued: “Large beds for similar couples are simply twins pushed together. So if you want to cuddle, one of you will be in the crack.” “You’ll be lying in the crack of the bed.” Only sheets on the bed The final complaint for hotel rooms was the lack of a duvet. She told viewers: “The first week we were there we thought there were just no duvets or duvets there, but then we realized they just didn’t fully make the bed for us.” “The duvet is like in a closet somewhere, you have to look for it and make it yourself, whatever I guess.” Hot coffee is served in glasses without handles When she got to the drinks, she said, “They served hot coffee in glasses with no handles.” “When we were in Spain we got coffee and churros at this churro restaurant and they served it in a cup without a handle. “So we couldn’t drink it until it cooled down because the damn glass was burning and it was so hot.” Two huge straws in cocktails The American was also not impressed when it came to alcoholic beverages: “Also, in cocktails they serve two giant straws, whereas in America we use like short, thin black straws, two of them.” “They make two giant straws, which I just thought was funny, because I’m wondering, should I drink out of both?” Because if that’s the case, I’m going to drink this really quickly. “Or is it just for decoration, but if so, why are the straws so big? I just don’t get it.” Shopping bags cost money She claimed that “nothing is free,” and said, “Shopping bags cost money. So if you’re a tourist and you don’t have a bag with you and you’re just walking around, you only have to pay for a bag.” Or carry all the things you buy with you because nothing is free. “Nothing is free there, don’t think for a second that it will be, because that’s not the case.” French fries are really bad Next on the list is the quality of the fries. She said: “French fries are really bad, they’re barely golden brown, not even crispy, kind of mushy.” “I think we had a good french fry place the whole time, so that was pretty disappointing.” Lemonade is “sugar-soda-water” The tourist was also confused by the lemonade in Europe, explaining, “Lemonade is just sugar soda water, so literally soda water with a packet of sugar, and they squeeze in like a slice of lime and that’s your lemonade. “I hope you enjoy it.” Full list of what an American TikToker said she doesn’t like about Europe - No spices - No shower curtains - No washcloths - No free water or free refills - No free public toilets - Missing toilet seats - No free hotel breakfast - No vending machines - Long flat pillows - The large beds are single beds pushed together - Only sheets on the bed - Hot coffee glasses without handles - To giant straws in cocktails - Shopping bags cost money - French fries are really bad - Lemonade is “sugar-soda-water” - Fries and salad are the only side dishes - Tiny water glasses - No hair conditioner Fries and salad are the only side dishes She also noted that there was a limited choice of food: “French fries and salad are the only sides with literally everything.” I was so sick of the crappy fries that I thought, could I please have some mac and cheese or broccoli or Have anything else as a side dish? “Even their salads aren’t that extra because we make our salad here so extra with all the toppings.” “Her salad is just like vegetables and the oil and vinegar dressing and that’s it, that’s what you eat.” Tiny water glasses Towards the end of the list, she complained about the “tiny water glasses” that she said “get old so quickly.” The TikToker said: “The water is so expensive, there are no free refills, so you just drink the water out of this tiny little tea cup.” “I’m just so thirsty, I couldn’t hydrate myself, no matter how much water I drank, I wouldn’t hydrate.” “There’s something in this water, it just doesn’t penetrate the veins, I don’t know.” No hair conditioner Finally, her last complaint about Europe was the lack of hair conditioner. She told viewers: “I think they just don’t believe in hair conditioners. Every single hotel we stayed in didn’t flush.” “It was either shower gel and shampoo or a combination of shower gel and shampoo, no conditioner anywhere in sight – the hair is dry, that’s all.” At the end of her video, she clarified: “There are a lot of things that I liked too, but we were just so homesick from being away for so long that we ended up making a list of all the things that caught our eye, that they are different than at home.” However, the video sparked debate in the comments, with Europeans defending their country and Americans agreeing with the TikToker. Viewers wrote: “I mean I’m only third on your list and they’re all wrong so far.” Will be updated” and “This list is completely wrong.” Others agreed: “That’s such a touristy perspective on Europe” and “I’m 5 points in and I already know it’s all wrong.” Others from the US defended the video, writing: “I couldn’t survive without a ranch” and “The lack of flannels is absolutely THE WORST.”","highlightText":"","highlightTitle":"","highlightThreadTitle":"","language":"english","sentiment":null,"categories":null,"external_links":[],"external_images":[],"entities":{"persons":[],"organizations":[],"locations":[{"name":"us","sentiment":"none"},{"name":"europe","sentiment":"none"},{"name":"united states of america","sentiment":"none"},{"name":"america","sentiment":"none"},{"name":"italy","sentiment":"none"},{"name":"france","sentiment":"none"},{"name":"spain","sentiment":"none"}]},"rating":null,"crawled":"2023-11-04T13:07:47.396+02:00","updated":"2023-11-04T13:07:47.396+02:00"}