{"thread":{"uuid":"780b65ac390f367524ec959580997c475070606e","url":"https://cybertrontv.com/2023/11/04/nfl-continues-to-strengthen-commitment-to-military-community-niagara-frontier-publications/","site_full":"cybertrontv.com","site":"cybertrontv.com","site_section":"https://www.cybertrontv.com","site_categories":[],"section_title":"Home - CyberTronTV","title":"NFL continues to strengthen commitment to military community ... - Niagara Frontier Publications - CyberTronTV","title_full":"NFL continues to strengthen commitment to military community ... - Niagara Frontier Publications - CyberTronTV","published":"2023-11-04T13:04:00.000+02:00","replies_count":0,"participants_count":1,"site_type":"news","country":"CL","main_image":"https://www.wnypapers.com/templates/custom/niagara-publications-2020/images/share-nfp.png","performance_score":0,"domain_rank":null,"domain_rank_updated":null,"reach":null,"social":{"facebook":{"likes":0,"comments":0,"shares":0},"gplus":{"shares":0},"pinterest":{"shares":0},"linkedin":{"shares":0},"stumbledupon":{"shares":0},"vk":{"shares":0}}},"uuid":"780b65ac390f367524ec959580997c475070606e","url":"https://cybertrontv.com/2023/11/04/nfl-continues-to-strengthen-commitment-to-military-community-niagara-frontier-publications/","ord_in_thread":0,"parent_url":null,"author":"Jake Robertson","published":"2023-11-04T13:04:00.000+02:00","title":"NFL continues to strengthen commitment to military community ... - Niagara Frontier Publications - CyberTronTV","text":"Wed, Nov 1st 2023 06:05 pm League has raised more than $66M to support nation’s service members, veterans & families Edited National Football League Press Release The National Football League (NFL) is proud to kick off “Salute to Service,” the league’s year-round effort to honor, empower and connect with our nation’s service members, veterans and their families. Throughout the month of November, the collective NFL family, including all 32 clubs and their players, will reinforce continued support and gratitude to those who have and continue to serve. “Salute to Service” will be highlighted specifically in-game during weeks 9-11 and included throughout additional special events led by the league and its clubs. Since 2011, more than $66 million has been raised for the NFL’s “Salute to Service” partners to support and uplift our nation’s military community through resources, programming, recognition and unique experiences in the U.S. and across the world. “We are grateful for the men and women serving in our armed forces for the many sacrifices they make every day while defending our country. Their courage and dedication assure us so many important freedoms, and the opportunity to enjoy a little football,” NFL Commissioner Roger Goodell said. “Throughout the last 12 years, ‘Salute to Service’ has allowed the NFL family to convey our thanks to service members, veterans and their families and support organizations within the military community across the world. The NFL is proud to highlight those who have served and currently serve our country.” In partnership with five core “Salute to Service” partners, the NFL aims to positively impact the lives of many in the military community. These partners include: the Pat Tillman Foundation (PTF), Tragedy Assistance Program for Survivors (TAPS), United Service Organizations (USO), Bob Woodruff Foundation (BWF), and Wounded Warrior Project (WWP). Honor, Empower and Connect in Action Together with “Salute to Service” partners and league sponsors, the NFL has continued to focus on strengthening the connection between the NFL family and military community. Official NFL “Salute to Service” partner USAA has honored and appreciated active-duty military, veterans and their families since 2011 by creating exclusive opportunities that bring the military community and the NFL closer together on a year-round basis. Among multiple events this season, USAA hosted NFL boot camps during training camp with multiple clubs where military members competed in drills like those displayed at the NFL Combine. In the lead up to Veterans Day, USAA is also organizing NFL club visits to various military installations. For the past six seasons the NFL and its “Salute to Service” partner TAPS, which provides care for the families of America’s fallen military heroes, have hosted an exclusive experience for surviving military families during the NFL’s London series. Six families from the U.S. and six families from the U.K. were welcomed and honored by the Atlanta Falcons and Jacksonville Jaguars at the first NFL London Game this season. These military families and the Soldiers’, Sailors’, and Airmen’s Families Association (SSAFA) Armed Forces Charity came together to attend a welcome dinner at the U.S. Embassy, honored their heroes at the Ministry of Defense and laid a wreath at the Cenotaph. The families were able to attend team practices and engaged with NFL staff, players, cheerleaders and legends throughout the weekend and culminated with the families’ receiving tickets to the game at Wembley Stadium and custom cleats honoring each fallen hero. The USA Wheelchair Football League (USAWFL) is a program of Move United made possible in part by support from the NFL and BWF as a part of “Salute to Service.” The league brings together highly trained coaches with passionate athletes to build skills and inspire athletes to excel both on and off the field through teamwork, dedication and resilience. Since 2020, Move United has helped more than 850 athletes and coaches get off the sidelines and get in the game through learn-to-play clinics, practice and development opportunities, camps, scrimmages and tournaments that bring together the best adaptive athletes from 14 teams across the country. Throughout the fall, wheelchair athletes from across the country compete in the USAWFL tournaments with the Kansas City team taking the tournament title. For more than 55 years, the USO and NFL have worked together to deliver programs and events supporting those who serve in the U.S. military and their families across the globe. Ahead of the Germany game between the Colts and Patriots, the USO and NFL will host a tailgate at Ramstein Air Base that will bring together service members and their families stationed in Germany through their shared love of football. The tailgate event will include entertainment, games and activities, food trucks, giveaways and more. Additionally, the USO is hosting the third annual “Salute to Service Showdown,” an EA SPORTS “Madden NFL 24” tournament uniting U.S. active-duty, Reserve and National Guard members around the world through the fun of football and gaming for the opportunity to attend Super Bowl LVIII. The tournament kicked off in September with qualifiers participating from three regions around the world. The top eight service members will participate in the finals at the New York Giants versus Dallas Cowboys “Salute to Service” game on Nov. 12. The winner of the tournament will receive tickets and travel accommodations to Super Bowl LVIII in Las Vegas. Continuing the advancement of USO Centers around the world, the NFL is supporting a new USO center aboard the aircraft carrier USS Dwight D. Eisenhower (CVN 69) which opened in October. This USO center includes many of the same amenities as a land-based center, such as comfortable seating, TVs, video and board games, USO program kits and snacks. In celebration of NFL’s “Salute to Service,” the NFL Foundation and Dallas Cowboys have partnered to host the NFL Character Playbook & National Medal of Honor Griffin Institute Partnership Launch Event. This event will be held at AT&T Stadium in Arlington, Texas, on Nov. 7, hosting over 700 high school students in person and participation from teams across the league virtually. The event celebrates the National Medal of Honor Griffin Institute’s sponsorship of three new videos integrated throughout the “Character Playbook: Building Healthy Relationships” course, which is funded by the NFL Foundation. The videos, designed to help guide students’ decision-making and choices, focus on the Medal of Honor values of courage, commitment and integrity. During the event, students will have the unique opportunity to engage with members of the Dallas Cowboys organization and a distinguished recipient of the Medal of Honor. This event will also include a special announcement in celebration of the NFL Foundation’s 50th anniversary. Salute to Service Award Presented by USAA The NFL and USAA are announcing the 2023 nominees for the annual NFL “Salute to Service” Award presented by USAA. The “Salute to Service” Award recognizes NFL players, coaches, staff and alumni with proven commitment to honoring and supporting military and veteran communities, as nominated by NFL clubs. Returning this year is an opportunity for fans to vote for their favorite nominee to help determine the award’s three finalists. To see all the nominees and vote, fans can visit [NFL.com/SaluteFanVote](https://www.nfl.com/causes/salute/nominees/2023/vote) from now until Nov. 30. One vote per day, per fan is permitted. The finalists will be announced in January, and the recipient will be recognized at NFL Honors, a primetime awards special to air nationally in February during the week of Super Bowl LVIII. For more information on how USAA honors and appreciates our military, visit [SaluteToService.com](https://protect-us.mimecast.com/s/yGSxC4xDvZu0W1L5hBb2bP?domain=urldefense.com). Fans can join the NFL and USAA in honoring the military community all year long by visiting [NFL.com/Salute](https://protect-us.mimecast.com/s/k1jaC687x1uO9KQmcxgssd?domain=urldefense.com). On-Field Salute to Service Weeks 9-11 “Salute to Service” comes to life on-field with stencils, banners, goal post wraps, game balls, helmet decals, and New Era and Nike gear. “Salute to Service” apparel is available for purchase at [NFLShop.com](https://www.nflshop.com/) and in stadium retail stores. The NFL does not profit from the sale of “Salute to Service” products. All charitable contributions are donated to the NFL’s “Salute to Service” partners. Fans can also bid on authentic, game-worn gear and other memorabilia to raise money for the NFL’s “Salute to Service” partners. Text STSBID to 635635 and opt-in or visit [www.NFL.com/Auction](http://www.NFL.com/Auction) to bid. We See You The “Salute to Service” PSA is a part of the “We See You” campaign returning this season focusing on the concept of “Everyday Strength.” This year’s spot features Los Angeles Chargers’ defensive end Morgan Fox. The spot recognizes that, while much of the military community watches our teams and sees NFL players’ strength on gameday, the NFL family likewise sees the strength of and sacrifices made by those currently serving to defend our country and by our nation’s veterans. It can be watched [here](https://youtu.be/zYUanIZwH5E). NFL’s Salute to Service Partners •Tragedy Assistance Program for Survivors (TAPS) – The NFL partners with TAPS to fund programs that support the families of fallen military service members. Thousands of survivors can access services to support all those grieving the loss of a military loved one. Through the partnership, more than 6,000 survivors who are part of TAPS have been able to participate in NFL events and honor their fallen loved one(s). The NFL is also working to fund the TAPS young adult program and the TAPS military mentor program. •The Pat Tillman Foundation (PTF) – To help honor leaders who exemplify Pat Tillman’s enduring legacy of service, the NFL partners with PTF, which has provided more than $34 million in academic scholarships and lifelong leadership development to nearly 900 Tillman Scholars. •Wounded Warrior Project (WWP) – The NFL partners with WWP to provide over 250,000 wounded veterans and family members access to free programs and resources in mental health, financial and career counseling, and long-term rehabilitative care. The NFL has honored countless warriors through connection events at regular season games, the NFL Draft and the Super Bowl. In addition, the NFL helps warriors and their families through impactful WWP programs like Project Odyssey, which uses adventure-based learning to empower veterans with invisible wounds to push beyond their comfort zone, increase resiliency and build relationships. Since 2011, the NFL has donated more than $11 million to help injured veterans and their families tackle their next mission in life. •Bob Woodruff Foundation (BWF) – Since 2018, the NFL and the BWF have made a measurable impact in the lives of more than 600,000 service members, veterans, their families and caregivers. The NFL and Bob Woodruff Foundation partnership is designed to optimize the positive impact that the NFL and its 32 clubs have on the veteran community by leveraging BWF’s national network. To date, BWF has invested over $11.3 million in 89 grants to best-in-class organizations supporting veterans and their families through NFL-BWF Healthy Lifestyles and Creating Communities and NFL-BWF Pipeline grants. The NFL and BWF also invested over $330,000 in 46 states to ensure communities across the country were equipped to support the service members, veterans, families and caregivers in their area during the COVID-19 pandemic. •United Service Organizations (USO) – For more than half a century, the USO and the NFL have partnered to express gratitude to the people who serve in the U.S. military and to bring communities of fans and supporters together to give more than thanks to the military. Leveraging American football as the cornerstone of the partnership, the USO and NFL honor, empower and connect service members and military families. Through support of USO center expansions, holiday programming and a variety of other events and activations, the NFL helps to deliver sports, entertainment and gaming to service members across the world. Since 2007, NFL players and coaches have traveled on USO Tours to 28 countries to meet and thank more than 110,000 service members. For more information on “Salute to Service,” visit [NFL.com/Salute](http://nfl.com/salute).","highlightText":"","highlightTitle":"","highlightThreadTitle":"","language":"english","sentiment":null,"categories":null,"external_links":["http://nfl.com/salute).","https://protect-us.mimecast.com/s/yGSxC4xDvZu0W1L5hBb2bP?domain=urldefense.com).","https://www.nfl.com/causes/salute/nominees/2023/vote)","https://www.nflshop.com/)","https://youtu.be/zYUanIZwH5E).","https://protect-us.mimecast.com/s/k1jaC687x1uO9KQmcxgssd?domain=urldefense.com).","http://www.NFL.com/Auction)","https://protect-us.mimecast.com/s/k1jaC687x1uO9KQmcxgssd","https://nflshop.com/)","https://www.protect-us.mimecast.com/s/yGSxC4xDvZu0W1L5hBb2bP?domain=urldefense.com).","https://www.youtu.be/zYUanIZwH5E).","https://protect-us.mimecast.com/s/yGSxC4xDvZu0W1L5hBb2bP","http://NFL.com/Auction)","https://nfl.com/causes/salute/nominees/2023/vote)","https://www.protect-us.mimecast.com/s/k1jaC687x1uO9KQmcxgssd?domain=urldefense.com).","http://www.nfl.com/salute)."],"external_images":[],"entities":{"persons":[],"organizations":[{"name":"nfl","sentiment":"none"},{"name":"niagara frontier publications","sentiment":"none"},{"name":"edited national football league press","sentiment":"none"}],"locations":[{"name":"u.s.","sentiment":"none"}]},"rating":null,"crawled":"2023-11-04T13:11:56.451+02:00","updated":"2023-11-04T13:11:56.451+02:00"}