{"thread":{"uuid":"7a1e95d7c0273e235b6ff0a7f751efac0ea1b263","url":"https://979weve.com/2023/11/04/thousands-of-black-women-claim-hair-relaxers-gave-them-cancer/","site_full":"979weve.com","site":"979weve.com","site_section":"https://979weve.com/rss","site_categories":["media"],"section_title":"Hibbing | WEVE | 979weve.com","title":"Thousands of Black women claim hair relaxers gave them cancer","title_full":"Thousands of Black women claim hair relaxers gave them cancer","published":"2023-11-04T12:05:00.000+02:00","replies_count":0,"participants_count":1,"site_type":"news","country":"US","main_image":"https://media-cdn.socastsrm.com/uploads/station/2212/fbShare.png?r=61142","performance_score":0,"domain_rank":null,"domain_rank_updated":null,"reach":null,"social":{"facebook":{"likes":0,"comments":0,"shares":0},"gplus":{"shares":0},"pinterest":{"shares":0},"linkedin":{"shares":0},"stumbledupon":{"shares":0},"vk":{"shares":0}}},"uuid":"7a1e95d7c0273e235b6ff0a7f751efac0ea1b263","url":"https://979weve.com/2023/11/04/thousands-of-black-women-claim-hair-relaxers-gave-them-cancer/","ord_in_thread":0,"parent_url":null,"author":"Syndicated Content","published":"2023-11-04T12:05:00.000+02:00","title":"Thousands of Black women claim hair relaxers gave them cancer","text":"By Mike Spector, Richa Naidu and Kristina Cooke\n(Reuters) – Sheila Bush, a cosmetologist, was lounging in the recliner at her St. Louis-area home last winter when an advertisement from a law firm flashed up on her television screen, urging viewers to call a toll-free number if they or a loved one had used hair relaxers and been diagnosed with uterine cancer.\nAfter seeing the ad three times, Bush, who said she had used hair relaxers every six weeks for most of her life and was diagnosed with uterine cancer about a decade ago, decided to pick up the phone.\nThe ads Bush saw, on television as well as on her social media feeds, were part of a nationwide effort by law firms to sign up Black women to file lawsuits alleging at least a dozen cosmetic companies, including L’Oreal and Revlon, sold hair relaxers containing chemicals that increased the risk of developing uterine cancer – and failed to warn customers.\nThe recruitment campaign launched in October last year, days after a U.S. National Institutes of Health (NIH) study found an association, though not a causal link, between frequent use of chemical hair relaxers and uterine cancer. Hair straighteners such as L’Oreal’s Dark & Lovely and Revlon’s Creme of Nature are marketed overwhelmingly to women of color, according to the lawsuits.\nSome of the ads show Black women applying hair products before cutting to a summary of the NIH study’s findings.\nL’Oreal and Revlon told Reuters their products are subject to rigorous safety reviews. The companies noted that the authors of the NIH study said they didn’t draw definitive conclusions about the cause of the women’s cancers and that more research is warranted.\n“We do not believe the science supports a link between chemical hair straighteners or relaxers and cancer,” Revlon said. L’Oreal added that it is committed to offering the best products “for all skin and hair types, all genders, all identities, all cultures, all ages” and that its hair relaxers have a “rich heritage and history” originating with Black inventors and entrepreneurs.\nNamaste, which markets ORS Olive Oil relaxers, said all ingredients in its products are approved for cosmetic use by U.S. regulators. “We do not believe the plaintiffs have shown, or will be able to show, that the use of Namaste hair relaxer products caused the injuries that they allege in their complaints,” a lawyer for Namaste and its parent company, Dabur India, said in an email response to Reuters.\nThe other companies declined to comment or didn’t respond to requests.\nMORE THAN 7,000 LAWSUITS\nThe success of the legal claims will hinge on demonstrating the products were harmful and that the companies knew, or should have known, of the danger and failed to warn customers.\nBut the cases face hurdles: In addition to the potential limitations of the NIH study, plaintiffs are suing multiple companies, and if women lack receipts, they may struggle to provide evidence that they used specific products.\nBen Crump, who represented the family of George Floyd, the Black man murdered by a Minneapolis police officer in 2020, and another lawyer, Diandra “Fu” Debrosse Zimmerman, filed the first hair relaxer lawsuit on behalf of a Missouri woman, Jenny Mitchell, shortly after the NIH study was published.\nSince then, more than 7,000 similar lawsuits have been filed by many plaintiffs’ lawyers. The cases have been consolidated in a Chicago federal court as part of a multidistrict litigation proceeding (MDL), a procedure designed to more efficiently manage lawsuits filed in multiple jurisdictions.\nEven though the legal claims asserted in the lawsuits don’t allege racial discrimination, Crump says the cases should be viewed as “essentially civil rights issues.”\nFor Black women, “it’s projected on them that they have to live up to some kind of European standard of beauty,” Crump, who represents plaintiffs in high-profile racial discrimination cases and is a regular on cable news, said in an interview.\nBush, aged 69, told Reuters about being mocked by the white children in the schoolyard of her St. Louis school for her “cotton” hair, a common derogatory term used for Black hair texture.\n“You felt as though you didn’t belong, or weren’t as good as they were,” said Bush, who was born in 1954, the year a landmark U.S. Supreme Court decision found racial segregation in public schools unconstitutional.\nThe vast majority of the plaintiffs are women of color, according to Jayne Conroy, a lawyer whose firm has filed at least 550 hair relaxer cases, adding that attorneys don’t have full demographic data on their clients.\nA master complaint filed in the court proceeding consolidating the lawsuits features many examples of advertisements that plaintiffs contend improperly took advantage of historical racial discrimination. One L’Oreal ad touted “how beautiful Black hair can be,” the complaint said.\nThe complaint seeks unspecified damages.\nFraming the litigation as a civil rights issue could resonate with jurors beyond arguments over complex product liability claims, said Adam Zimmerman, a professor at the University of Southern California Gould School of Law who studies mass tort litigation.\nThe cases come at a time Black people are increasingly embracing natural hairstyles. At least 23 states have passed legislation aimed at protecting people from hair discrimination in the workplace and public schools. The U.S. House of Representatives passed similar legislation last year that stalled in the Senate.\nTWICE AS LIKELY TO DEVELOP CANCER\nUterine cancer is the most common form of female reproductive system cancer and rising in the U.S., especially among Black women, according to the NIH.\nThe American Cancer Society estimates there will be about 66,000 new cases of uterine cancer diagnosed this year in the United States, less than a quarter of the number of 297,790 new cases of invasive breast cancer, and more than three times the 19,710 cases of ovarian cancer.\nThe NIH study of more than 33,000 women found that those who reported using hair straightening products more than four times in the previous year were more than twice as likely to develop uterine cancer as those who did not. A total of 378 women in the study developed uterine cancer. Black women used the products more frequently than others, the study found.\nThe researchers did not collect information on the ingredients of specific products the women used, the NIH said. But Dr. Alexandra White, the lead author, told Reuters in response to written questions that hair straighteners have been found to include phthalates, parabens, cyclosiloxanes and metals, and may release formaldehyde when heated. She declined interview requests through a spokesperson.\nThe U.S. Food and Drug Administration plans to propose next April a rule that would ban formaldehyde and formaldehyde-releasing chemicals from hair-straightening products. An agency spokesperson provided no further details on timing.\nFormaldehyde is a known carcinogen and has been linked to nasopharyngeal cancer and leukemia, according to the World Health Organization. The NIH study said phthalates and the other chemicals are suspected endocrine disruptors, which can interfere with the body’s hormones and are suspected of contributing to cancer risk.\n“Formaldehyde is not an ingredient in Namaste’s hair relaxer products,” the company’s lawyer said.\nThe other companies declined to comment or did not respond to a Reuters query on whether their products contain or release formaldehyde.\nCompanies and defense lawyers have pointed to what they say are flaws in the NIH study. The companies named in the litigation asked the presiding judge in July to dismiss the lawsuits, noting that the study was the first to raise a possible association between hair straightening products and uterine cancer, undermining plaintiffs’ argument that the companies knew or should have known of any risks related to the products.\nThe companies also noted that the NIH study consisted of sisters of women previously diagnosed with breast cancer “who therefore may have a genetic predisposition,” they said in a court filing. Lead author White said in a statement that there is currently no strong evidence linking family history of breast cancer to increased risk of uterine cancer.\nThe plaintiffs “rely entirely on vague allegations that the products, generally, contain ‘toxic chemicals’,” the companies’ defense lawyers at Paul, Weiss, Rifkind & Garrison, Arnold & Porter Kaye Scholer and other firms said in a court filing.\nPlaintiffs believe the NIH study will persuade the judge that at least some of the cases should proceed to trial. Plaintiffs can advance their case without proving the products caused cancer, said Jennifer Hoekstra, a lawyer representing Bush. The study from a reputable government institution such as the NIH is likely enough to get cases before a jury, she said.\nAn FDA rule proposal wouldn’t alter the plaintiffs’ burden to prove they were harmed by the chemicals in hair relaxers, said Zimmerman, the USC law professor. But evidence regulators rely on to support a proposed rule would likely be admissible in court, he said, and FDA actions “often draw lots of attention — thus increasing the numbers of people likely to participate in any mass litigation.”\nIn addition, the judge overseeing the litigation over the summer approved a so-called short-form complaint that makes it relatively easy for plaintiffs to file lawsuits.\nSince November last year, plaintiffs’ lawyers have spent about $8 million airing more than 40,000 television ads across the U.S., with much of it concentrated in Baltimore, Houston and Washington DC, according to an analysis of marketing data compiled for Reuters by X Ante, a firm that tracks mass tort advertising for large companies, law firms and investment analysts.\nLawyers seeking hair relaxer plaintiffs have posted on social-media platforms and attended community events.\nQuiana Hester said she and her sisters, Ariana and Nakisha, have been interviewing lawyers and are weighing whether to join the litigation after seeing ads on social media from plaintiffs’ law firms.\nThe sisters said they wanted their mother’s death last year following a battle with uterine cancer to mean something.\nPatrice Hester, a former real estate agent, regularly counseled her daughters that wearing natural hair would attract unwanted attention and harm their careers. “She never wanted us to do anything to make us stand out or be a target,” said Ariana, 35, who shared a home with her mother and sister Nakisha in the San Diego area.\nBush, the St. Louis cosmetologist, joined the litigation in August, she said, because of the possibility that hair relaxers cause cancer. “If we find out that that’s the case,” she said, “I would like to see that relaxers were taken completely off the market.”\n(Reporting by Mike Spector, Richa Naidu and Kristina Cooke, Additional reporting by Diana Novak Jones; Editing by Vanessa O’Connell and Suzanne Goldenberg)","highlightText":"","highlightTitle":"","highlightThreadTitle":"","language":"english","sentiment":null,"categories":null,"external_links":[],"external_images":[],"entities":{"persons":[{"name":"mike spector","sentiment":"none"},{"name":"kristina cooke","sentiment":"none"},{"name":"sheila bush","sentiment":"none"},{"name":"richa naidu","sentiment":"none"},{"name":"bush","sentiment":"none"}],"organizations":[{"name":"reuters","sentiment":"none"},{"name":"u.s. national institutes of health (nih","sentiment":"none"},{"name":"revlon","sentiment":"none"}],"locations":[{"name":"st. louis","sentiment":"none"}]},"rating":null,"crawled":"2023-11-04T13:11:39.073+02:00","updated":"2023-11-04T13:11:39.073+02:00"}