{"thread":{"uuid":"7b6b9c86b8b31808aa37a8a456ef597a77c5b1b6","url":"https://www.agweb.com/news/ag-policy/need-veterinarian-your-area-then-support-legislation-now","site_full":"www.agweb.com","site":"agweb.com","site_section":"https://bovinevetonline.com/news","site_categories":["financial_news","finance","business","media","tennis","sports","agriculture"],"section_title":"News | Bovine Veterinarian","title":"Need A Veterinarian In Your Area? Then Support This Legislation Now | Bovine Veterinarian","title_full":"Need A Veterinarian In Your Area? Then Support This Legislation Now | Bovine Veterinarian","published":"2023-11-03T07:00:00.000+02:00","replies_count":0,"participants_count":1,"site_type":"news","country":"US","main_image":"","performance_score":0,"domain_rank":15024,"domain_rank_updated":"2023-10-31T12:15:27.000+02:00","reach":null,"social":{"facebook":{"likes":0,"comments":0,"shares":0},"gplus":{"shares":0},"pinterest":{"shares":0},"linkedin":{"shares":0},"stumbledupon":{"shares":0},"vk":{"shares":0}}},"uuid":"7b6b9c86b8b31808aa37a8a456ef597a77c5b1b6","url":"https://www.agweb.com/news/ag-policy/need-veterinarian-your-area-then-support-legislation-now","ord_in_thread":0,"parent_url":null,"author":"Rhonda Brooks","published":"2023-11-03T07:00:00.000+02:00","title":"Need A Veterinarian In Your Area? Then Support This Legislation Now | Bovine Veterinarian","text":"Need A Veterinarian In Your Area? Then Support This Legislation Now New legislation has been introduced to address the critical shortage of veterinarians practicing in rural America. Specifically, U.S. Senators Debbie Stabenow (D-Mich.) and Mike Crapo (R-Idaho) introduced bipartisan legislation this past week to address the problem, which continues to significantly impact rural communities and food animal producers most critically. The Rural Veterinary Workforce Act S.2829 would provide tax benefits to veterinarians to encourage them to practice in rural communities, the senators said in a joint news release. This will not only increase the care available to livestock and poultry, but also address food safety and public health concerns in these communities, they said. Benefits For Public Health, Too “Increasing veterinary services in high-priority rural areas through the Rural Veterinary Workforce Act would help keep the nation’s livestock healthy and our food supply safe and secure, and protect public health,” said Dr. Rena Carlson, president of the American Veterinary Medical Association (AVMA), in the release. “The AVMA has been a long-time champion of the proposed legislation,” Carlson added. “After the legislation received a historic level of support in the previous Congress, we look forward to working with the congressional champions to enact this bill and help rural communities across the country access the many essential services veterinarians provide.” A report commissioned by Farm Journal Foundation in 2022 noted that more than 500 counties across the U.S. have shortages of food animal veterinarians. Less Than 5% of New Graduates Choose Food Animal Practice Today, only about 3% to 4% of new veterinary school graduates pursue livestock or other food-animal practice options, a stark decline from 40 years ago when about 40% of graduates specialized in this area, according to the report authored by Cornell University’s Dr. Clinton Neill. The shortages stem from several factors, including high levels of education debt that have outpaced potential earnings, especially in the rural U.S. This is encouraging more veterinarians to pursue companion animal practices and work in urban and suburban areas where incomes are often higher. “The decline in food animal veterinarians in rural areas heightens concerns for a number of risks, including food safety threats, animal disease outbreaks, the potential passing of animal diseases to human populations, and decreasing rural economic growth,” Dr. Neill said. “In essence, veterinarians protect the whole of the human and animal population, so it is critical that we have a strong pipeline of practitioners to work in rural areas.” Twenty-Year Old Program Needs Update In 2003, Congress established the The Rural Veterinary Workforce Act to address this shortage by assisting qualifying veterinarians with student loan repayment in exchange for a three-year commitment to practice in underserved communities. However, the program is currently subject to a significant federal withholding tax, which limits available resources and the reach of its benefits. The Rural Veterinary Workforce Act provides an exemption from the federal income withholding tax for payments received under the program and similar state programs, helping give more veterinarians the opportunity to practice in small, rural communities where their services are needed most. This change would reflect similar exemptions provided to medical doctors and other human health practitioners. A statement of support from over 100 stakeholder groups, which includes the American Association of Bovine Practitioners and the American Association of Swine Veterinarians, can be found [here](https://www.agriculture.senate.gov/imo/media/doc/rural_veterinary_workforce_act_support_letter_2023.pdf). The bipartisan bill is cosponsored by Senators King (D-Maine), Hyde-Smith (R- Miss.), Smith (D-Minn.), Murkowski (R-Alaska), Gillibrand (D-N.Y.), Moran (R-Kan.), Klobuchar (D-Minn.), Boozman (R-Ark.), Collins (R-Maine), Murray (D-Wash.), and Risch (R-Idaho). [From a Mountain of Debt to a Molehill](https://www.bovinevetonline.com/news/veterinary-education/mountain-debt-molehill) [What's Top of Mind for Swine Veterinarians in 2023?](https://web.aasv.org/news/2023/06/whats-top-of-mind-for-swine-veterinarians-in-2023/) [10 Ways to Kick the 'Imposter Syndrome' to the Curb](https://www.bovinevetonline.com/news/industry/10-ways-kick-imposter-syndrome-curb) [New Partnership Aims to Address Rural Veterinary Shortage](https://www.agweb.com/news/business/taxes-and-finance/new-partnership-aims-address-rural-veterinary-shortage)","highlightText":"","highlightTitle":"","highlightThreadTitle":"","language":"english","sentiment":"positive","categories":["Health","Politics","Social Issue"],"external_links":["https://www.agweb.com/news/business/taxes-and-finance/new-partnership-aims-address-rural-veterinary-shortage)","https://web.aasv.org/news/2023/06/whats-top-of-mind-for-swine-veterinarians-in-2023/)","https://www.agriculture.senate.gov/imo/media/doc/rural_veterinary_workforce_act_support_letter_2023.pdf).","https://agriculture.senate.gov/imo/media/doc/rural_veterinary_workforce_act_support_letter_2023.pdf).","https://www.web.aasv.org/news/2023/06/whats-top-of-mind-for-swine-veterinarians-in-2023/)","https://agweb.com/news/business/taxes-and-finance/new-partnership-aims-address-rural-veterinary-shortage)"],"external_images":[],"entities":{"persons":[{"name":"debbie stabenow","sentiment":"none"},{"name":"rena carlson","sentiment":"none"},{"name":"mike crapo","sentiment":"none"}],"organizations":[{"name":"public health","sentiment":"none"},{"name":"american veterinary medical assoc","sentiment":"none"}],"locations":[{"name":"u.s.","sentiment":"none"},{"name":"mich.","sentiment":"none"},{"name":"america","sentiment":"none"},{"name":"idaho","sentiment":"none"}]},"rating":null,"crawled":"2023-11-04T13:06:59.853+02:00","updated":"2023-11-04T13:06:59.853+02:00"}