{"thread":{"uuid":"946ea68e09600c7d2bf923f9b6ebe2c869be0be3","url":"http://csnbbs.com/thread-980286.html","site_full":"csnbbs.com","site":"csnbbs.com","site_section":"https://csnbbs.com/forum-540.html","site_categories":["tech","net_conferencing"],"section_title":"CSNbbs - The Kyra Memorial Spin Room ","title":"Joe Biden's Latest Economic Speech Was So Bad, Your Palm Will Meet Your Face","title_full":"Joe Biden's Latest Economic Speech Was So Bad, Your Palm Will Meet Your Face","published":"2023-11-02T17:42:00.000+02:00","replies_count":5,"participants_count":6,"site_type":"discussions","country":"US","main_image":"","performance_score":0,"domain_rank":454279,"domain_rank_updated":"2023-10-31T12:16:55.000+02:00","reach":null,"social":{"facebook":{"likes":0,"comments":0,"shares":0},"gplus":{"shares":0},"pinterest":{"shares":0},"linkedin":{"shares":0},"stumbledupon":{"shares":0},"vk":{"shares":0}}},"uuid":"946ea68e09600c7d2bf923f9b6ebe2c869be0be3","url":"http://csnbbs.com/thread-980286.html","ord_in_thread":0,"parent_url":null,"author":"CrimsonPhantom","published":"2023-11-02T17:42:00.000+02:00","title":"Joe Biden's Latest Economic Speech Was So Bad, Your Palm Will Meet Your Face","text":"Quote: : The White House just keeps on trotting out Joe Biden, and he just keeps on giving speeches that will make you want to gouge your own eyes out. Imagine being told over and over that pigs can actually fly, with no amount of evidence changing the narrative. That's what it's like to listen to any messaging coming out of the Biden administration.\nThings kicked off after Biden landed in Minnesota, where he took the short stairs off Air Force One because we have a president who can't be trusted to use the normal airstairs literally every other president has used. It's fine, though. Just pretend like you don't notice.\nPretty soon, it was time for another riveting speech on \"Bidenomics,\" perhaps the worst political marking scheme in modern history.\nPrices are up nearly 18 percent since Biden took office and interest rates are so high no one can buy a house! Amazing!\nEvery time I hear the president go on about Bidenomics, I want to slowly press my palm to my face. It's such an insult to hard-working Americans who are struggling right now. This is an economy that has left almost no one better off than they were pre-COVID. Savings rates have declined, wage increases have not kept up with inflation, and buying anything on credit is just about the dumbest decision you can make. That all adds up to stagnation. Normal people can't get ahead because property investment was once the safest and smartest way to grow wealth.\nCould someone please get Biden to stop \"transforming\" the economy? Because we could all use some relief. This wasn't an economy that needed to be transformed. It was one that needed common sense at the helm. Instead, we got a guy who wants to cosplay as FDR, and the results have been predictable. Worse, there's no end in sight. The damage is so extensive, it could take a decade to fully recover, and that's assuming big changes happen after 2024.\nHave we, though? Because I'm pretty sure we've come out much weaker over the last few years, and certainly, if we are talking foreign policy, things are far worse. Success is not guaranteed in life. It is not just a natural outgrowth of America. It takes competent leadership willing to make moves that may counter their political ideology. Biden isn't willing to do that, being a creature of the far-left, and again, the results have been predictable.\nSo what's the president's grand plan? More bio-fuels!\nBio-fuels are trash. They are rough on the engines that use them, and because they reduce fuel efficiency, there is no real savings nexus that makes sense. Then you have to consider that using mass amounts of corn and other food products for fuel raises the cost of actual food.\nIf I had to describe how I felt watching this latest speech in one word, it would be \"tiring.\" I'm just tired of the failure. I'm tired of the malaise. I'm tired of watching opportunities melt away for middle-class Americans over things that are out of their control. I'm begging voters to change course in 2024.\nLink","highlightText":"","highlightTitle":"","highlightThreadTitle":"","language":"english","sentiment":null,"categories":null,"external_links":["https://twitter.com/RNCResearch/status/1719816012621623440","https://redstate.com/bonchie/2023/11/01/joe-bidens-latest-economic-speech-was-so-bad-your-palm-will-meet-your-face-n2165804","https://www.twitter.com/RNCResearch/status/1719816650562703439","https://www.twitter.com/RNCResearch/status/1719813076516536821","https://zerohedge.com/markets/worlds-biggest-shipper-cuts-10000-jobs-warns-subdued-global-trade","https://www.twitter.com/TPostMillennial/status/1719815645590622362","https://www.twitter.com/RNCResearch/status/1719813862914990540","https://www.twitter.com/RNCResearch/status/1719816012621623440","https://twitter.com/RNCResearch/status/1719789080769122720","https://twitter.com/TPostMillennial/status/1719815645590622362","https://twitter.com/RNCResearch/status/1719813862914990540","https://www.redstate.com/bonchie/2023/11/01/joe-bidens-latest-economic-speech-was-so-bad-your-palm-will-meet-your-face-n2165804","https://twitter.com/RNCResearch/status/1719816650562703439","https://www.zerohedge.com/markets/worlds-biggest-shipper-cuts-10000-jobs-warns-subdued-global-trade","https://www.twitter.com/RNCResearch/status/1719789080769122720","https://twitter.com/RNCResearch/status/1719813076516536821"],"external_images":[],"entities":{"persons":[],"organizations":[],"locations":[]},"rating":null,"crawled":"2023-11-04T13:07:36.389+02:00","updated":"2023-11-04T13:07:36.389+02:00"}