{"thread":{"uuid":"96140d6473f66ab64a5190f938bc25f876b1697d","url":"https://www.breakingnews.ie/israel-hamas/blinken-seeks-support-for-temporary-ceasefire-as-gaza-humanitarian-crisis-grows-1547674.html","site_full":"www.breakingnews.ie","site":"breakingnews.ie","site_section":"https://breakingnews.ie","site_categories":["media"],"section_title":"BreakingNews.ie | Irish News | Breaking News from Ireland","title":"Calls for temporary ceasefire as Gaza humanitarian crisis grows","title_full":"Calls for temporary ceasefire as Gaza humanitarian crisis grows","published":"2023-11-04T10:19:00.000+02:00","replies_count":0,"participants_count":1,"site_type":"news","country":"IE","main_image":"https://img.resized.co/breaking-news/eyJkYXRhIjoie1widXJsXCI6XCJodHRwczpcXFwvXFxcL2ltYWdlcy5icmVha2luZ25ld3MuaWVcXFwvcHJvZFxcXC91cGxvYWRzXFxcLzIwMjNcXFwvMTFcXFwvMDQwODIxMTZcXFwvNTBiN2NlYTdjYmY1NGJlNzgwMDliNWZlNTAxMzVkOWUuanBnXCIsXCJ3aWR0aFwiOjEyMDAsXCJoZWlnaHRcIjo2MjcsXCJkZWZhdWx0XCI6XCJodHRwczpcXFwvXFxcL3d3dy5icmVha2luZ25ld3MuaWVcXFwvaW1hZ2VzXFxcL25vLWltYWdlLnBuZ1wiLFwib3B0aW9uc1wiOltdfSIsImhhc2giOiJlYjg5MDRlMDg3OTVlYjk2ODU3OWJkMjI3NjQwN2RkZDE1YzU1MjE5In0=/calls-for-temporary-ceasefire-as-gaza-humanitarian-crisis-grows.jpg","performance_score":0,"domain_rank":14997,"domain_rank_updated":"2023-10-31T12:15:27.000+02:00","reach":null,"social":{"facebook":{"likes":0,"comments":0,"shares":0},"gplus":{"shares":0},"pinterest":{"shares":0},"linkedin":{"shares":0},"stumbledupon":{"shares":0},"vk":{"shares":0}}},"uuid":"96140d6473f66ab64a5190f938bc25f876b1697d","url":"https://www.breakingnews.ie/israel-hamas/blinken-seeks-support-for-temporary-ceasefire-as-gaza-humanitarian-crisis-grows-1547674.html","ord_in_thread":0,"parent_url":null,"author":"breakingnewsie","published":"2023-11-04T10:19:00.000+02:00","title":"Calls for temporary ceasefire as Gaza humanitarian crisis grows","text":"US secretary of state Antony Blinken has met Arab foreign ministers to find ways to ease Gaza’s growing humanitarian crisis. His mission is complicated by Israel’s insistence that there can be no temporary ceasefire until all hostages held by Hamas are released. In unusually blunt language, the United Nations chief said conditions in Gaza are now “horrific” as fighting continues to escalate. With food, water and the fuel needed for generators that power hospitals and other facilities running out, UN secretary-general Antonio Guterres urged an immediate ceasefire to allow humanitarian aid into the Gaza Strip. “An entire population is traumatised, nowhere is safe,” he said on Friday. He said he had not forgotten the slaughter of civilians at the hands of Hamas militants when they launched their attack on Israel almost a month ago, but said civilians and civilian infrastructure must be protected. He also said civilians must not be used as human shields, and called on Hamas to release all of the roughly 240 hostages it has. Israel’s forces have encircled Gaza City, and it has been urging civilians to head south to avoid getting caught up in the fighting as the ground war intensifies. One man who did just that said even the south did not feel safe. Raed Mattar, who was sheltering in a school in the southern town of Khan Younis after fleeing the north early in the war, said he regularly heard explosions, apparently from air strikes. “People never sleep,” he said. “The sound of explosions never stops.” About 1.5 million people in Gaza, or 70 per cent of the population, have fled their homes, the United Nations said. On Friday in Tel Aviv, on his third trip to Israel since the war began, Mr Blinken pushed US president Joe Biden’s calls for a brief halt in the fighting to address the worsening humanitarian crisis. But Israeli prime minister Binyamin Netanyahu said there could be no humanitarian pause until Hamas releases the hostages it holds. That stance complicates Mr Blinken’s talks on Saturday in Amman with diplomats from Jordan, Egypt, Saudi Arabia, Qatar, the United Arab Emirates and the Palestinian Authority, who remain angry and deeply suspicious of Israel. In addition to aid distribution, allowing foreigners out and the release of hostages, Mr Blinken is looking to get Jordan and other Arab states to begin to think about the future of Gaza if and when Israel succeeds in taking control from Hamas. Arab leaders have so far resisted American suggestions that they play a larger role in crisis, expressing outrage at the civilian toll of the Israeli military operations but believing Gaza to be a problem largely of Israel’s own making. Still, US officials believe Arab backing – no matter how modest – will be critical to efforts to not only ease the worsening conditions in Gaza but also to lay the groundwork for what would replace Hamas as the territory’s governing authority if and when Israel succeeds in eradicating it. Mr Blinken met first with Lebanon’s caretaker prime minister Najib Mikati before his series of talks with the foreign ministers. He will also see Jordan’s King Abdullah II, whose country announced on Wednesday that it had recalled its ambassador to Israel and told Israel’s envoy not to return to the country. Israeli troops have been tightening their encirclement of Gaza City, the main focus of the military’s campaign to crush Hamas. Overnight strikes hit the western outskirts of the city and near Al-Quds Hospital. Adly Abu Taha, a Gaza City resident who has sheltered in the hospital grounds for the past three weeks, said strikes have repeatedly hit close to the hospital in recent days. “The bombardment gets closer day by day,” he said over the phone. “We don’t know where to go.” Hundreds of thousands of Palestinians remain in the city and across northern Gaza. Israel says Hamas has extensive military infrastructure in the city, including a network of underground tunnels, bunkers and command centres. It says its strikes target Hamas, and the militants endanger civilians by operating among them. In the aftermath of a strike on Friday outside Gaza’s largest hospital, Shifa, footage showed more than a dozen bodies next to damaged cars and ambulances. The strike came after Israel said Hamas had a command centre there – a claim that could not be independently verified and that Hamas and hospital officials deny. At least 15 people were killed and 60 wounded outside Shifa Hospital, said health ministry spokesperson Ashraf al-Qidra. At least 50 others were killed or wounded in a strike outside Gaza’s Indonesian Hospital, its director said, without providing more precise figures. The Israeli military said its aircraft hit an ambulance on Friday that Hamas fighters were using to carry weapons. The claim could not be independently verified. It was not clear whether the strike was connected to the one by Shifa Hospital. The military said it took place “near a battle zone”, suggesting it was close to ongoing ground battles. Mr al-Qidra said a convoy of ambulances left Shifa carrying wounded people to Rafah when a strike hit a vehicle on the edges of Gaza City. The convoy turned around, and another strike hit another ambulance. He denied that any of the ambulances were used by Hamas fighters. More than 9,200 Palestinians have been killed in Gaza so far, including more than 3,600 Palestinian children, the Gaza Health Ministry said, without providing a breakdown between civilians and fighters. More than 1,400 people have died on the Israeli side, mainly civilians killed during Hamas’s initial attack. Rocket fire by Gaza militants into Israel persists, disrupting life for millions of people and forcing an estimated 250,000 to evacuate. Most rockets are intercepted. Twenty-four Israeli soldiers have been killed in Gaza since the start of the ground operation. The overall toll is likely to rise dramatically as the assault on densely built-up Gaza City continues. More than 386 Palestinian dual nationals and wounded exited Gaza into Egypt on Friday, according to Wael Abou Omar, the Hamas spokesperson for the Rafah border crossing. That brings the total who have left since Wednesday to 1,115. Israel has allowed more than 300 trucks carrying food and medicine into Gaza, but aid workers say it is not nearly enough. Israeli authorities have refused to allow fuel in, saying Hamas is hoarding it for military use and would steal new supplies.","highlightText":"","highlightTitle":"","highlightThreadTitle":"","language":"english","sentiment":"neutral","categories":[],"external_links":[],"external_images":[],"entities":{"persons":[{"name":"antony blinken","sentiment":"negative"},{"name":"antonio guterres","sentiment":"none"}],"organizations":[{"name":"state","sentiment":"negative"},{"name":"hamas","sentiment":"none"},{"name":"united nations","sentiment":"none"},{"name":"un","sentiment":"none"}],"locations":[{"name":"gaza","sentiment":"none"},{"name":"us","sentiment":"none"},{"name":"gaza strip","sentiment":"none"},{"name":"gaza city","sentiment":"none"},{"name":"israel","sentiment":"none"}]},"rating":null,"crawled":"2023-11-04T13:07:44.864+02:00","updated":"2023-11-04T13:07:44.864+02:00"}