{"thread":{"uuid":"96b04790efe86ea8ddad74aa95d4a6c9bec11b12","url":"https://jobs.compassgroupcareers.com/USA/job/WINGATE-FOOD-SERVICE-WORKER-%28FULL-AND-PART-TIME%29-NC-28174/1083295200/","site_full":"jobs.compassgroupcareers.com","site":"compassgroupcareers.com","site_section":"http://jobs.oodle.com//?v=rss","site_categories":["job_search","jobs"],"section_title":"","title":"Food Service Worker (Full and Part Time) (Compass Group)","title_full":"Food Service Worker (Full and Part Time) (Compass Group)","published":"2023-11-04T11:50:00.000+02:00","replies_count":0,"participants_count":0,"site_type":"news","country":"US","main_image":"","performance_score":0,"domain_rank":265851,"domain_rank_updated":"2023-10-31T12:16:22.000+02:00","reach":null,"social":{"facebook":{"likes":0,"comments":0,"shares":0},"gplus":{"shares":0},"pinterest":{"shares":0},"linkedin":{"shares":0},"stumbledupon":{"shares":0},"vk":{"shares":0}}},"uuid":"96b04790efe86ea8ddad74aa95d4a6c9bec11b12","url":"https://jobs.compassgroupcareers.com/USA/job/WINGATE-FOOD-SERVICE-WORKER-%28FULL-AND-PART-TIME%29-NC-28174/1083295200/","ord_in_thread":0,"parent_url":null,"author":null,"published":"2023-11-04T11:50:00.000+02:00","title":"Food Service Worker (Full and Part Time) (Compass Group)","text":"FOOD SERVICE WORKER (FULL AND PART TIME)\nDate: Nov 2, 2023\nLocation: WINGATE, NC, US, 28174\nCompany: Compass Group\n- We are hiring immediately for a full and part time FOOD SERVICE WORKER position.\n- Location: Wingate University Overhead - 204 East Wilson Street, Wingate, NC 28174 Note: online applications accepted only.\n- Schedule: Full and part time schedules are available. Hours and days may vary. More details upon interview.\n- Requirement: Previous guest service experience is preferred.\n- Starting pay: $12.00 per hour\n- Perks: Free meals and willing to train!\n- *Internal Employee Referral Bonus Available\nWe Make Applying Easy! Want to apply to this job via text messaging? Text JOB to 75000 and search requisition ID number 1238985.\nThe advertised program is a conversational recruiting assistant that helps you apply to jobs with Compass Group. Message frequency varies. Message and data rates may apply. Text STOP to opt out or HELP for help. Terms and conditions:\nhttp://olivia.paradox.ai/moSkg\nAt over 300 colleges and universities around the country, Chartwells Higher Education is re-inventing the on-campus dining experience. We are challenging the norm and setting new standards by investing in high-tech, food-infused social spaces that bring people together to promote meaningful relationships and interactions. We are food-forward difference makers, bound together by a desire to feed hungry minds and prepare students for success.\nWe are seeking hungry, humble and smart associates who are looking to join and grow with a diverse organization. We invite you to start your career journey with us and look forward to hearing from you.\nJob Summary\nSummary: Prepares, presents and serves food as needed.\nEssential Duties and Responsibilities:\n- Performs prep work such as washing, peeling, cutting and seeding fruits and vegetables.\n- Weighs and measures designated ingredients.\n- Carries pans, kettles and trays of food to and from work stations, stove and refrigerator in accordance with safety standards.\n- Stores food in designated areas following wrapping, dating, food safety and rotation procedures.\n- Cleans work areas, equipment and utensils.\n- Distributes supplies, utensils and portable equipment.\n- Utilizes approved food recipes and production standards to ensure proper quality, serving temperatures and standard portion control.\n- Serves customers in a friendly, efficient manner following outlined steps of service.\n- Resolves customer concerns and relays relevant information to supervisor.\n- Ensures compliance with company service standards and inventory and cash control procedures.\n- Assures compliance with all sanitation and safety requirements.\n- Performs other duties as assigned.\nThe Benefits\nWe are always looking for ways to invest in our people both inside and outside of work to help them achieve their full potential. Both full-time and part-time associates are eligible for the following benefits:\n- Opportunities for Training and Development\n- Retirement Plan\n- Associate Shopping Program\n- Health and Wellness Programs\n- Discount Marketplace\n- Identity Theft Protection\n- Pet Insurance\n- Voluntary Benefits, including Critical Illness Insurance, Accident Insurance, Hospital Indemnity Insurance, Legal Services, and Choice Auto and Home Program\nIn addition, full-time positions also offer the following benefits to associates:\n- Medical\n- Dental\n- Vision\n- Life Insurance/AD\n- Disability Insurance\n- Commuter Benefits\n- Employee Assistance Program\n- Flexible Spending Accounts (FSAs)\nOur Commitment to Diversity and Inclusion\nCompass Group is an equal opportunity employer. At Compass, we are committed to treating all Applicants and Associates fairly based on their abilities, achievements, and experience without regard to race, national origin, sex, age, disability, veteran status, sexual orientation, gender identity, or any other classification protected by law.\nQualified candidates must be able to perform the essential functions of this position satisfactorily with or without a reasonable accommodation. Disclaimer: this job post is not necessarily an exhaustive list of all essential responsibilities, skills, tasks, or requirements associated with this position. While this is intended to be an accurate reflection of the position posted, the Company reserves the right to modify or change the essential functions of the job based on business necessity. We will consider for employment all qualified applicants, including those with a criminal history (including relevant driving history), in a manner consistent with all applicable federal, state, and local laws, including the City of Los Angeles’ Fair Chance Initiative for Hiring Ordinance, the San Francisco Fair Chance Ordinance, and the New York Fair Chance Act.\nChartwells Higher Ed maintains a drug-free workplace.\nReq ID:1238985\nChartwells HE\nNearest Major Market: Charlotte\nJob Segment: Food Service, Part Time, Hospitality","highlightText":"","highlightTitle":"","highlightThreadTitle":"","language":"english","sentiment":null,"categories":null,"external_links":["https://nam11.safelinks.protection.outlook.com/?url=http%3A%2F%2Folivia.paradox.ai%2FmoSkg&data=05%7C01%7CJatinder.Singh%40compass-usa.com%7C859493b20a6f466fd4da08db517cadc0%7Ccd62b7dd4b4844bd90e7e143a22c8ead%7C0%7C0%7C638193368153035971%7CUnknown%7CTWFpbGZsb3d8eyJWIjoiMC4wLjAwMDAiLCJQIjoiV2luMzIiLCJBTiI6Ik1haWwiLCJXVCI6Mn0%3D%7C3000%7C%7C%7C&sdata=WQZGdTmrBGk2G0F0f2Cr96a%2FNF6fRkcWrZtQM5d%2FgSU%3D&reserved=0","http://olivia.paradox.ai/moSkg","https://www.nam11.safelinks.protection.outlook.com/?url=http%3A%2F%2Folivia.paradox.ai%2FmoSkg&data=05%7C01%7CJatinder.Singh%40compass-usa.com%7C859493b20a6f466fd4da08db517cadc0%7Ccd62b7dd4b4844bd90e7e143a22c8ead%7C0%7C0%7C638193368153035971%7CUnknown%7CTWFpbGZsb3d8eyJWIjoiMC4wLjAwMDAiLCJQIjoiV2luMzIiLCJBTiI6Ik1haWwiLCJXVCI6Mn0%3D%7C3000%7C%7C%7C&sdata=WQZGdTmrBGk2G0F0f2Cr96a%2FNF6fRkcWrZtQM5d%2FgSU%3D&reserved=0","http://www.olivia.paradox.ai/moSkg","https://nam11.safelinks.protection.outlook.com/"],"external_images":[],"entities":{"persons":[{"name":"wingate","sentiment":"none"}],"organizations":[{"name":"compass group","sentiment":"none"},{"name":"wingate university overhead","sentiment":"none"}],"locations":[{"name":"nc","sentiment":"none"},{"name":"wingate","sentiment":"none"},{"name":"us","sentiment":"none"},{"name":"east wilson street","sentiment":"none"}]},"rating":null,"crawled":"2023-11-04T13:07:30.285+02:00","updated":"2023-11-04T13:07:30.285+02:00"}