{"thread":{"uuid":"a73f163524a6093ff6fa326c0db8ccca741ec5c8","url":"https://news-24.fr/zets-entertainment-une-entreprise-centree-sur-la-famille-nouvelles/","site_full":"news-24.fr","site":"news-24.fr","site_section":"https://news-24.fr","site_categories":["media"],"section_title":"News 24 - News 24 Bienvenue sur le site d&#039;actualités News 24. Retrouvez les actualités en France et à l&#039;internationales du jour à travers de nombreux articles sur les thèmes de la politique, de la culture, de la technologie et de la santé. - News 24","title":"ZET's Entertainment : une entreprise centrée sur la famille | Nouvelles - News 24","title_full":"ZET's Entertainment : une entreprise centrée sur la famille | Nouvelles - News 24","published":"2023-11-04T12:44:00.000+02:00","replies_count":0,"participants_count":1,"site_type":"news","country":"FR","main_image":"https://news-24.fr/wp-content/uploads/2023/11/6545462d306da.image_.jpg","performance_score":0,"domain_rank":136021,"domain_rank_updated":"2023-10-31T12:16:08.000+02:00","reach":null,"social":{"facebook":{"likes":0,"comments":0,"shares":0},"gplus":{"shares":0},"pinterest":{"shares":0},"linkedin":{"shares":0},"stumbledupon":{"shares":0},"vk":{"shares":0}}},"uuid":"a73f163524a6093ff6fa326c0db8ccca741ec5c8","url":"https://news-24.fr/zets-entertainment-une-entreprise-centree-sur-la-famille-nouvelles/","ord_in_thread":0,"parent_url":null,"author":"@SamehElrawy","published":"2023-11-04T12:44:00.000+02:00","title":"ZET's Entertainment : une entreprise centrée sur la famille | Nouvelles - News 24","text":"(Note de l’éditeur : la troisième édition du Laine Business Accelerator a récemment accordé 5 000 $ à 11 entreprises cherchant à lancer ou à développer leur entreprise. Voici le profil de l’une de ces entreprises.) OLEAN — Pour Angelica Porcuri, son entreprise est avant tout une affaire de famille. En fait, le nom de son entreprise – ZET’s Entertainment – intègre la première lettre du nom de chacun de ses enfants – Zayd, Enzo et Thea. Les bébés ZET. « En fait, j’ai lancé mon entreprise pour pouvoir passer plus de temps avec mes enfants », a-t-elle déclaré. «Je fais mon propre emploi du temps et je les emmène simplement dans le food truck, je peux leur enseigner et gagner ma vie en même temps. Le food truck Italian Ice de ZET dispose jusqu’à présent d’un inventaire de base de 11 variétés de glace italienne, alternant 54 saveurs différentes. Certaines saveurs ont même été créées par des enfants de la région pour honorer leur lutte contre le cancer et récolter des fonds pour eux et leurs familles. Les ZET proposent également des spécialités telles que des cannoli, des nachos italiens (chips de cannoli et trempette), un mini cheesecake et un tiramisu. Les saveurs des desserts changent selon la saison. Et, selon l’événement et la saison, il peut proposer des produits alimentaires. «Je viens de démarrer le food truck en juin de cette année, et ça se passe très bien», a-t-elle déclaré. « Cette saison a été incroyable. Nous nous sommes installés dans divers lieux des comtés de Cattaraugus, Allegany et McKean et la réponse a été très appréciée. Elle a déclaré qu’elle espérait continuer à développer son entreprise, mais qu’elle n’était pas totalement sûre de la direction à prendre, même si son implication dans l’Accélérateur l’aideait. “À un moment donné, j’allais faire de la location de fêtes, des produits qui complètent les entreprises qui faisaient déjà des choses comme des tentes, mais j’ai décidé de m’orienter vers la nourriture, pour commencer”, a-t-elle déclaré. En plus du secteur des food trucks, Porcuri gère également une entreprise de boulangerie-pâtisserie qui, dit-elle, « commence à prendre de l’ampleur. J’aurai bientôt une commande en ligne, je donnerai quelques cours de décoration d’articles de pâtisserie à la bibliothèque publique d’Olean et je suis également impliqué dans le projet Olean Ornamental Gingerbread Village. Porcuri pratique la pâtisserie depuis plusieurs années et a travaillé professionnellement dans diverses boulangeries. Elle prévoit de s’associer à un restaurant local pour apporter certains de ses produits à cet endroit. Si la famille est importante pour elle, Porcuri croit également à la communauté et au soutien aux efforts visant à améliorer la région. Par exemple, elle travaille avec Magro Speech Therapy – un autre participant au Laine Business Accelerator – pour faire don d’une boule de glace italienne gratuite aux enfants qui participent à l’événement de cette entreprise. De plus, elle a fait don de glace italienne à un événement pour l’Opération Warm Hearts, parce qu’elle aime ce qu’ils font pour notre communauté. Elle a fait don de glace italienne aux cerises à ceux qui ont donné leur sang à la Croix-Rouge en l’honneur de Hearts for Isabella ; Événement CHD Heartraiser. Elle a également aidé à collecter 530 $ pour le projet Wounded Warrior et a même tiré au sort des articles signés Shawn Dubin (un natif de la région qui joue pour les Astros de Houston) pour aider les Olean Oilers à collecter des fonds pour les feux d’artifice du 4 juillet 2024. Son inspiration pour faire partie du programme Accelerator est venue lors de l’un des événements Strolean de la Chambre de commerce de la région de Greater Olean. « J’ai continué à vendre de la glace italienne et d’autres produits », a-t-elle déclaré, « et les personnes impliquées dans l’Accélérateur et le Centre de développement des affaires ont dit que j’avais une excellente entreprise et que participer à l’Accélérateur m’aiderait vraiment. Alors j’ai étudié la question et j’ai postulé. Porcuri, originaire du New Jersey, a déclaré que l’un des principaux enseignements de l’expérience jusqu’à présent a été la connaissance. « Je reçois une excellente formation sur la manière de gérer une entreprise et de devenir une grande entrepreneure », a-t-elle déclaré. «J’ai l’occasion de rencontrer des personnes partageant les mêmes idées. C’est vraiment un groupe formidable avec lequel être ensemble. En plus de voir Porcuri dans son food truck, vous rencontrerez très probablement son fiancé, Garrett, qui a été son principal soutien tout au long de cette mission visant à transformer ses rêves en réalité. “Je l’ai enchaîné et il adore ça”, a-t-elle déclaré. « Heureusement, mes parents regardent The ZET Babies pendant que je travaille s’ils ne travaillent pas dans le food truck. J’ai un excellent système de soutien pour mon entreprise partout. Elle connaissait cette région du Southern Tier car sa famille possédait une propriété à Wellsville et avait décidé de s’y installer définitivement lorsqu’elle était plus jeune. Cela a conduit ses parents à déménager à Olean, où elle a établi son entreprise. Dans la région à cause de sa famille. A démarré une entreprise pour être avec sa famille. Ce thème se poursuit dans sa vie – et dans sa profession.","highlightText":"","highlightTitle":"","highlightThreadTitle":"","language":"french","sentiment":null,"categories":null,"external_links":[],"external_images":[],"entities":{"persons":[],"organizations":[],"locations":[]},"rating":null,"crawled":"2023-11-04T13:07:36.739+02:00","updated":"2023-11-04T13:07:36.739+02:00"}