{"thread":{"uuid":"a98c83c282939492e1d34c4e32891004037c717d","url":"https://www.newsunseen.com/a-costly-mistake-as-florida-avoids-many-more-millions-letters-to-the-editor/","site_full":"www.newsunseen.com","site":"newsunseen.com","site_section":"https://newsunseen.com","site_categories":[],"section_title":"Home - News Unseen","title":"A costly mistake as Florida avoids many more millions | Letters to the editor - News Unseen","title_full":"A costly mistake as Florida avoids many more millions | Letters to the editor - News Unseen","published":"2023-11-04T12:15:00.000+02:00","replies_count":0,"participants_count":1,"site_type":"news","country":"US","main_image":"https://i0.wp.com/www.sun-sentinel.com/wp-content/uploads/migration/2022/04/29/FX3GPVKSCNBJPP5PWMZL2NH42E.jpg","performance_score":0,"domain_rank":null,"domain_rank_updated":null,"reach":null,"social":{"facebook":{"likes":0,"comments":0,"shares":0},"gplus":{"shares":0},"pinterest":{"shares":0},"linkedin":{"shares":0},"stumbledupon":{"shares":0},"vk":{"shares":0}}},"uuid":"a98c83c282939492e1d34c4e32891004037c717d","url":"https://www.newsunseen.com/a-costly-mistake-as-florida-avoids-many-more-millions-letters-to-the-editor/","ord_in_thread":0,"parent_url":null,"author":"Sandil","published":"2023-11-04T12:15:00.000+02:00","title":"A costly mistake as Florida avoids many more millions | Letters to the editor - News Unseen","text":"Why are low-income Florida residents once again missing out on potential benefits from the federal government? The latest insult is that Florida is passing up $400 million in federal money to help low-income households install energy-efficient solar panels. Governor Ron DeSantis and the Republican legislature have consistently approved President Joe Biden’s green energy agenda. If more and more Floridians believe climate change is real, why aren’t they leading the way for our state? I ask on behalf of all Floridians that we do not let personal politics prevent our state from moving forward and receiving our fair share of funds to make our state a better place to live for all citizens. ronald jones, Pembroke Pines Governor, come home Our governor is just that, a governor. He is not the president. I want you to stop spending our money on things that are the responsibility of the federal government, not the states. No immigrant flights, no weapons to Israel, no Israeli flights. The people of Florida have many unresolved problems that our governor should address, using funds budgeted for those dire needs. He’s not doing right by people. He’s campaigning and seeking the kind of attention given to a hero, which he’s not. He must stop. He must govern our state, something he hasn’t done in a long time, except to secretly pass laws and pursue his own agenda. Nina Leonardo, San Agustin Obscene spending on advertising With the 2024 election now a year away, spending on political advertising in the presidential race right now already totals $200 million. At this point in the 2020 cycle, spending had reached $60 million. Again, this occurs with a full year left. I’m not sure I can think of many things that are more obscene than the amount of money spent on advertising for an election, especially a “decidedly undecided” one. In total, including the Senate, House, gubernatorial races, and several down elections, we are likely to see more than $10 billion spent this election cycle, which is about 600 days of campaigning. For comparison, the United Kingdom allows five weeks of campaigning for any election. As they say, “Follow the money.” Especially those candidates who campaign while holding another office, such as governor. Alex Jimenez, winter park A double standard Attorney General Ashley Moody’s concern regarding “evasion” of Florida’s Sunshine Law at FAU was interesting. When the state Legislature, at the behest of Governor Ron DeSantis, passed SB 520 in 2022, allowing secret university presidential records and dismembering our once-sacred Florida Constitution, it was apparently fine. Pablo DeYoung, Pembroke Pines Without ice? costs extra As prices continue to rise, companies continue to find new ways to “charge” us. My most recent example is Dunkin’ Donuts. Now they charge you a fee if you do it No You want ice in your iced tea. Iced tea, according to industry sources, is one of the most beneficial products that a food establishment can offer. The profit margin is between 500% and 900%. How much more tea do they have to add to replace the ice? Not much and certainly not enough to change the profit margin. Charge extra for not having ice? Come on. Bill Gralnick, Boca Raton (Editor’s note: We emailed Dunkin’ Donuts’ corporate media office on October 30 to ask about this policy, but did not receive a response.)","highlightText":"","highlightTitle":"","highlightThreadTitle":"","language":"english","sentiment":null,"categories":null,"external_links":[],"external_images":[],"entities":{"persons":[{"name":"ron desantis","sentiment":"none"},{"name":"joe biden","sentiment":"none"}],"organizations":[],"locations":[{"name":"florida","sentiment":"none"},{"name":"pembroke pines","sentiment":"none"},{"name":"israel","sentiment":"none"}]},"rating":null,"crawled":"2023-11-04T13:07:29.160+02:00","updated":"2023-11-04T13:07:29.160+02:00"}