{"thread":{"uuid":"aba01dd83ce08b725e5e89978ac3af824dadcd01","url":"https://glamsham.com/bollywood/news/raj-kundra-talks-about-his-marriage-with-shilpa-shetty-jail-experience","site_full":"glamsham.com","site":"glamsham.com","site_section":"https://www.glamsham.com/rss","site_categories":[],"section_title":"Glamsham","title":"Raj Kundra talks about his marriage with Shilpa Shetty, jail experience","title_full":"Raj Kundra talks about his marriage with Shilpa Shetty, jail experience","published":"2023-11-04T12:34:00.000+02:00","replies_count":0,"participants_count":1,"site_type":"news","country":null,"main_image":"https://glamsham.com/wp-content/uploads/2023/11/202311043079351.jpeg","performance_score":0,"domain_rank":102794,"domain_rank_updated":"2023-10-31T12:16:03.000+02:00","reach":null,"social":{"facebook":{"likes":0,"comments":0,"shares":0},"gplus":{"shares":0},"pinterest":{"shares":0},"linkedin":{"shares":0},"stumbledupon":{"shares":0},"vk":{"shares":0}}},"uuid":"aba01dd83ce08b725e5e89978ac3af824dadcd01","url":"https://glamsham.com/bollywood/news/raj-kundra-talks-about-his-marriage-with-shilpa-shetty-jail-experience","ord_in_thread":0,"parent_url":null,"author":"Agency News Desk","published":"2023-11-04T12:34:00.000+02:00","title":"Raj Kundra talks about his marriage with Shilpa Shetty, jail experience","text":"Mumbai, Nov 4 (IANS) Entrepreneur and now actor Raj Kundra has opened up about various aspects of his life including his jail experience, marriage and his latest release UT69.\nRaj on ShareChat said: “More than a legal trial, the media trial hurt me after all the controversy which happened, I was misunderstood, and I was heartbroken by it. My family was dragged and pulled down which was unfair to them.”\nHe also opened up about the genesis of his movie, added: “I wanted to write a book on my whole jail journey, but my friend told me that you should make it a movie, and you should act in it. When I wore a mask and came for the first time in front of the media, I was called the mask man.”\n“When I was out in public, people told me that I’m not able to show my face due to embarrassment, but it was my way of getting back at everybody who had given me a tough time. I was a victim of the system.”\nReflecting on his time in confinement, Raj said: “When I was in jail, I was not given any luxury treatment. I was living and eating the same way the other people were. And I have captured all nuances in my movie—the way I was treated and the way I lived. Audiences will get to experience it.”\n“I recall my time behind bars vividly; it’s humiliating because they strip you down completely in front of everyone to check if you are carrying any narcotics. So, you feel like you have lost all your dignity. You feel like you have gone through so much, and now here also they are stripping you down.\n“Media was already doing that, and now this also happened. I felt disheartened and hurt. You don’t get proper food or sleep, and people were talking lecherously about me and Shilpa.”\n“I was put in a common barrack. Jail is like a Bigg Boss house; people there have big egos, and you can’t act oversmart. It’s an experience I wouldn’t wish upon anyone. I’ll be sharing more of my experience from jail time in my upcoming film, *UT69*. It’s a project close to my heart as it marks my official acting debut, and it’s a way for me to share the reality of what goes on behind those walls.”\nTaking the unprecedented step of acting in his own life story, Kundra said: “I’m acting in my own story, and it’s the first time, it has never happened before. The jail was filled with people’s egos, and it got more difficult to be around them. People can see it in the movie—how I have projected it.”\n–IANS\ndc/dan","highlightText":"","highlightTitle":"","highlightThreadTitle":"","language":"english","sentiment":null,"categories":null,"external_links":[],"external_images":[],"entities":{"persons":[{"name":"shilpa shetty","sentiment":"none"},{"name":"raj kundra","sentiment":"none"},{"name":"sharechat","sentiment":"none"},{"name":"raj","sentiment":"none"}],"organizations":[{"name":"ians","sentiment":"none"}],"locations":[{"name":"mumbai","sentiment":"none"}]},"rating":null,"crawled":"2023-11-04T13:06:49.789+02:00","updated":"2023-11-04T13:06:49.789+02:00"}