{"thread":{"uuid":"afee837dfd06028b8d020477f0da1f421aa3d1a7","url":"https://www.bresciatoday.it/social/quanto-costa-aperitivo.html","site_full":"www.bresciatoday.it","site":"bresciatoday.it","site_section":"http://www.bresciatoday.it/rss","site_categories":["media"],"section_title":"BresciaToday","title":"In Italia si spendono 4,54 miliardi per gli aperitivi: la metà solo al Nord","title_full":"In Italia si spendono 4,54 miliardi per gli aperitivi: la metà solo al Nord","published":"2023-11-04T08:42:00.000+02:00","replies_count":0,"participants_count":0,"site_type":"news","country":"IT","main_image":"https://www.bresciatoday.it/~media/horizontal-hi/29004550890780/aperitivi-tradelab.jpg","performance_score":0,"domain_rank":147575,"domain_rank_updated":"2023-10-31T12:16:08.000+02:00","reach":null,"social":{"facebook":{"likes":0,"comments":0,"shares":0},"gplus":{"shares":0},"pinterest":{"shares":0},"linkedin":{"shares":0},"stumbledupon":{"shares":0},"vk":{"shares":0}}},"uuid":"afee837dfd06028b8d020477f0da1f421aa3d1a7","url":"https://www.bresciatoday.it/social/quanto-costa-aperitivo.html","ord_in_thread":0,"parent_url":null,"author":null,"published":"2023-11-04T08:42:00.000+02:00","title":"In Italia si spendono 4,54 miliardi per gli aperitivi: la metà solo al Nord","text":"[social](/social/)\nIn Italia si spendono 4,54 miliardi per gli aperitivi: la metà solo al Nord\nIn un anno si servono 850 milioni di aperitivi\nIn Italia si spendono, ogni anno, più di 4 miliardi e mezzo di euro (4,54 miliardi per la precisione) solo per gli aperitivi serali, il celeberrimo happy hour: un altro miliardo e mezzo viene invece investito per l'aperitivo diurno. Sono 14 milioni gli italiani che fanno l'aperitivo serale fuori casa, consumando 582 milioni di drink l'anno, con una spesa media di 7,7 euro: 8 milioni, invece, gli italiani che fanno l'aperitivo diurno fuori casa, per un totale di 285 milioni di aperitivi annui e una spesa media di 5,2 euro.\nIn un anno 850 milioni di aperitivi\nL'aperitivo serale è un cult soprattutto al Nord, che da solo vale per il 48% degli aperitivi consumati al tramonto (20% il Centro, 32% Sud e isole) ma con una spesa media che arriva a 9 euro: è al Sud invece che ci si dedica di più all'aperitivo diurno, con il 45% dei drink consumati (il 39% al Nord, il 16% al Centro). È quanto emerge dalla panoramica offerta da Bruna Boroni di Trade Lab, nel corso dell'evento “Sei già dentro l'happy hour?” organizzato a Milano da Cattel Spa – storica azienda del settore alimentare, leader nella distribuzione di prodotti food e non food nel settore horeca nel Nordest italiano – e da Apci, l'Associazione Professionale Cuochi Italiani.\nInteressante l'analisi di un'abitudine che non perde ritmo nonostante l'inflazione e i salari fermi da anni: negli ultimi 12 mesi, in Italia, sono stati serviti oltre 850 milioni di aperitivi, di cui 580 milioni la sera e 285 milioni prima di pranzo.\nIl fenomeno dell'aperitivo in Italia\nIl trend coinvolge ben 14 milioni di italiani di età compresa tra i 18 e i 75 anni, pari al 32% della popolazione: in orario serale quasi la metà degli aperitivi è un affare per gli over 45; la Generazione X (dai 45 ai 54 anni) vale da sola il 20% del totale. Il 24% di chi fa l'aperitivo la sera ha più di 55 anni, il 15% è di età compresa tra i 18 e i 24 anni, il 20% ha tra i 25 e i 34 anni, il 21% ha tra i 35 e i 44 anni. La scelta dei drink: tra i 18 e i 34 anni la maggioranza (il 30%) sceglie il cocktail; dai 25 anni in poi vino e bollicine (20%), stessa percentuale per la birra, drink preferito per chi ha tra i 35 e i 44 anni; bene anche i cocktail analcolici, consumati dal 22% di chi ha tra i 25 e i 34 anni.\nLa spesa media varia dai 6,3 euro per i bar nelle ore diurne agli 8,5 euro per i bar nelle ore serali: in pub ed enoteche si spendono in media 7 euro, poco meno che dagli ambulanti o nei chioschi. Costa in media 10 euro un aperitivo in una catena, raggiunge quota 17 euro in ristoranti e locali “premium”, cioè di alta gamma.\n“Questo è il messaggio che vogliamo dare ai ristoratori – commenta Caroline Gatti, responsabile marketing di Cattel spa –: l'aperitivo è diventato un pasto vero e proprio, al pari di colazione, pranzo e cena. Vale pertanto la pena impegnarsi per renderlo qualitativamente elevato, discostandosi dagli accompagnamenti che troppo spesso lo caratterizzano come, ad esempio, olive e chips. È arrivato il momento di investire, di fare ricerca, di imparare nuove ricette e soluzioni per offrire valore e trarre profitto”.","highlightText":"","highlightTitle":"","highlightThreadTitle":"","language":"italian","sentiment":null,"categories":null,"external_links":[],"external_images":[],"entities":{"persons":[],"organizations":[],"locations":[]},"rating":null,"crawled":"2023-11-04T13:07:00.584+02:00","updated":"2023-11-04T13:07:00.584+02:00"}