{"thread":{"uuid":"b1a0c379d88388dbd16badbdfda6e2e34a98b3be","url":"https://news-24.fr/benevoles-recherches-5-novembre-2023-mode-de-vie/","site_full":"news-24.fr","site":"news-24.fr","site_section":"https://news-24.fr","site_categories":["media"],"section_title":"News 24 - News 24 Bienvenue sur le site d&#039;actualités News 24. Retrouvez les actualités en France et à l&#039;internationales du jour à travers de nombreux articles sur les thèmes de la politique, de la culture, de la technologie et de la santé. - News 24","title":"Bénévoles recherchés : 5 novembre 2023 | Mode de vie - News 24","title_full":"Bénévoles recherchés : 5 novembre 2023 | Mode de vie - News 24","published":"2023-11-04T12:45:00.000+02:00","replies_count":0,"participants_count":1,"site_type":"news","country":"FR","main_image":"https://news-24.fr/wp-content/uploads/2023/11/61a1c5f6-8935-11e9-9f11-2364139b1f04.jpg","performance_score":0,"domain_rank":136021,"domain_rank_updated":"2023-10-31T12:16:08.000+02:00","reach":null,"social":{"facebook":{"likes":0,"comments":0,"shares":0},"gplus":{"shares":0},"pinterest":{"shares":0},"linkedin":{"shares":0},"stumbledupon":{"shares":0},"vk":{"shares":0}}},"uuid":"b1a0c379d88388dbd16badbdfda6e2e34a98b3be","url":"https://news-24.fr/benevoles-recherches-5-novembre-2023-mode-de-vie/","ord_in_thread":0,"parent_url":null,"author":"@SamehElrawy","published":"2023-11-04T12:45:00.000+02:00","title":"Bénévoles recherchés : 5 novembre 2023 | Mode de vie - News 24","text":"Ministères communautaires de Longview a besoin de bénévoles au Service Center, Food Box et Meals with Love. Les horaires sont de 9h à 12h30 du lundi au vendredi. Pour plus d’informations, envoyez un e-mail à Britt Norvell à [[email protected]](/cdn-cgi/l/email-protection) ou appelez le (903) 753-3561 ext. 212. Hôpital HeartsWay du nord-est du Texas est à la recherche de personnes attentionnées qui souhaitent servir bénévolement pour soutenir ses équipes de soins palliatifs et leurs familles. Nos bénévoles sont utilisés pour le soutien du bureau, pour rendre visite aux patients des maisons de retraite, pour participer à des événements spéciaux et pour aider au marketing régional. Les bénévoles de HeartsWay reçoivent une formation et servent dans leurs propres communautés. Contactez Rex Fennell, directeur des services bénévoles et de sensibilisation au (903) 295-1680, ou par courrier électronique à [[email protected]](/cdn-cgi/l/email-protection). La Croix-Rouge américaine — Chapitre de l’Est du Texas, une organisation à but non lucratif qui prévient et atténue la souffrance humaine face aux situations d’urgence en mobilisant le pouvoir des bénévoles, propose diverses opportunités de bénévolat avec de nombreux programmes que la Croix-Rouge américaine a à offrir. Pour plus d’informations, contactez la directrice exécutive Karen Holt à [[email protected]](/cdn-cgi/l/email-protection) ou appelez le (903) 331-2565. Centre médical régional de Longview est à la recherche de bénévoles pour rejoindre son auxiliaire bénévole. Pour plus d’informations, appelez le (903) 232-3776. Conseil d’alphabétisation de l’Est du Texas, une organisation à but non lucratif basée à Longview, a un besoin immédiat d’un bénévole pour enseigner un cours ESOL (anglais aux locuteurs d’autres langues) de 8h00 à 10h30 le mercredi à Kilgore. Aucune expérience n’est requise. Pour plus d’informations, appelez le (903) 757-9302. Sauveteurs : Le sauvetage de la passion de Skylyr, une organisation locale de sauvetage de chiens à but non lucratif, basée sur des familles d’accueil, a un besoin immédiat de foyers d’accueil pour l’aider à faciliter cet effort. Le placement en famille d’accueil dure généralement de trois à six semaines. Le sauvetage fournit de la nourriture, des soins vétérinaires, etc. Vous fournissez de l’amour, un endroit sûr où le chien peut se détendre et vous l’aidez à se préparer pour son nouveau foyer. Pour plus d’informations, envoyez un e-mail à in [[email protected]](/cdn-cgi/l/email-protection) ou envoyez un SMS à Angie au (903) 452-0526. Arboretum et centre naturel de Longview recherche des bénévoles pour aider à la réception, à la boutique de cadeaux, au jardin, aux classes d’enfants et aux événements. Pour plus d’informations, appelez le (903) 212-2181. Pattes d’argent, une agence à but non lucratif qui propose des programmes de guérison grâce à des activités et des thérapies assistées par des animaux, recherche des bénévoles pour aider dans notre établissement en tant qu’accueil, assistants de programme, collecteurs de fonds et assistance aux événements. Nous sommes toujours à la recherche de nouvelles équipes d’animaux de thérapie prêtes à servir la communauté. Pour plus d’informations, visitez [www.silverpawstx.org](http://www.silverpawstx.org)appelez le (903) 720-2068 ou envoyez un e-mail à [[email protected]](/cdn-cgi/l/email-protection). Coalition Tous les bons chiens recherche des bénévoles dotés de capacités d’observation et capables de suivre les instructions. Ils participeront à des événements d’adoption mensuels et/ou à des activités de rééducation sous la direction d’un dresseur de chiens. Pour plus d’informations, envoyez un e-mail à agdadoptio [[email protected]](/cdn-cgi/l/email-protection) ou appelez/envoyez un SMS à Klancey (903) 235-0383. Organisations de sauvetage d’animaux de Longview Nous avons un besoin immédiat de bénévoles pour accueillir des chiens et des chats en raison de l’augmentation du nombre de chiens errants et d’abandons d’animaux. Les bénévoles sont formés et la plupart des dépenses sont couvertes. Le placement en famille d’accueil peut durer de quelques semaines à quelques mois. Pour plus d’informations, envoyez un e-mail à [[email protected]](/cdn-cgi/l/email-protection) ou visitez [LongviewPetsRescue.org](http://LongviewPetsRescue.org) . Mission Newgate, Le 207 S. Mobberly Ave., Longview, a besoin de bénévoles pour les serveurs du déjeuner de 10 h 30 à 12 h 30 du mardi au vendredi. Casquettes et masques sont obligatoires. Les bénévoles peuvent être en groupe ou en individuel. Jusqu’à trois personnes sont nécessaires chaque jour. Pour plus d’informations, appelez Brenda, (903) 757-6146. Centre de défense des enfants de Martin House est une organisation à but non lucratif qui apporte une réponse collaborative et multidisciplinaire aux enquêtes, aux poursuites et au traitement des cas de maltraitance d’enfants. Les bénévoles aident à redonner espoir aux enfants qui ont été maltraités. Pour plus d’informations, envoyez un e-mail à [[email protected]](/cdn-cgi/l/email-protection) ou appelez le (903) 807-0189. Centre de soins à domicile du Texas, Le 2904 N. Fourth St., Longview, a besoin de bénévoles pour offrir un accompagnement aux patients, un soutien à la famille et une assistance au bureau. Pour plus d’informations, envoyez un e-mail à [[email protected]](/cdn-cgi/l/email-protection) ou appelez le (903) 234-0943. — Pour que les informations soient prises en compte pour publication dans cette section, envoyez vos informations avant 17 heures le lundi à [[email protected]](/cdn-cgi/l/email-protection) ou par courrier à PO Box 1792, Longview, TX 75606.","highlightText":"","highlightTitle":"","highlightThreadTitle":"","language":"french","sentiment":null,"categories":null,"external_links":["http://www.silverpawstx.org)appelez","http://LongviewPetsRescue.org)","http://www.LongviewPetsRescue.org)","http://silverpawstx.org)appelez"],"external_images":[],"entities":{"persons":[],"organizations":[],"locations":[]},"rating":null,"crawled":"2023-11-04T13:07:38.852+02:00","updated":"2023-11-04T13:07:38.852+02:00"}