{"thread":{"uuid":"b6c3bb5f4fdd45a5b0b1f4e0175a4249ccb097fe","url":"https://rightimpacttochangehearts.com/2023/11/04/home-alone/","site_full":"rightimpacttochangehearts.com","site":"rightimpacttochangehearts.com","site_section":"https://rightimpacttochangehearts.wordpress.com/feed/","site_categories":[],"section_title":"R.I.C.H – Right Impact to Change Hearts","title":"Home Alone","title_full":"Home Alone","published":"2023-11-04T10:40:00.000+02:00","replies_count":0,"participants_count":1,"site_type":"news","country":"US","main_image":"https://rightimpacttochangehearts.com/wp-content/uploads/2023/11/image-6.png","performance_score":0,"domain_rank":null,"domain_rank_updated":null,"reach":null,"social":{"facebook":{"likes":0,"comments":0,"shares":0},"gplus":{"shares":0},"pinterest":{"shares":0},"linkedin":{"shares":0},"stumbledupon":{"shares":0},"vk":{"shares":0}}},"uuid":"b6c3bb5f4fdd45a5b0b1f4e0175a4249ccb097fe","url":"https://rightimpacttochangehearts.com/2023/11/04/home-alone/","ord_in_thread":0,"parent_url":null,"author":"VINOD DAS","published":"2023-11-04T10:40:00.000+02:00","title":"Home Alone","text":"Once in a while, there comes a time in your life when you have to express yourself completely…\nThat happened to me when my family was out for 10 days. As it turned out, it was a festive time and I had fewer business travels. So here I am inside the 4 walls of the apartment, trying to figure out how to make food in the next few days without ordering Swiggy and Zomato. I knew for sure that our maid would help me go through some parts of the day by being kind enough to turn up and cook something for a couple of days. As expected she prepared sambhar ( signature dish). In fact, I liked it so much that I wanted to learn how she prepared it by asking her to either do a video or an audio share of the ingredients and mix.\nI liked noodles and who better than her to prepare them same. I am not talking about Maggi, after all that is the preserve of people who have never stepped into the kitchen. Even though I liked her noodles I was not satisfied as my taste buds had over the years developed this uncanny knack of separating the good from the great. So I dived it to take it to the next level. I decided to season it with some scrambled egg and that was nicely done and then I decided to add ghee ( crazy me) and then put some tomato sauce. I savoured that moment when my soul was so stirred with that state of elevated happiness. Another regular feature that I figured out was how easy is it to make our traditional red rice. One whistle you lower the flame and the next three whistles it is done. It turned out to be a great succour as I pontificated with this idea of having rice with omelette and curd and pappad. Simple living and high thinking were the mantras that kept me going until I realised that I was too lazy to prepare any dish.\nIn came the idea of preparing something on the eve of the festival. I ventured to again call my wife and checked on how to make dry chickpea which is a featured dish for Pooja during Navami. The day before I kept it for soaking and I must credit myself for delicately removing the water and nicely pouring it into the pressure cooker vessel with utmost care. Not one piece of chickpea fell onto the floor. The highlight was the right amount of salt and grated coconut which made my day. Like a GenZ I shared all those pictures with my family to get some thumbs up. To put it in a nutshell, Dosa’s did not stick, Omelettes were slightly better in shape, at least pleasing to the eyes. It is customary that we keep our books for Pooja during Navami. I recollected during school, how much we looked forward to these two days as my mother would tell me not to study. This time around we added all the other appendages of our lives. Cell phones, Laptops et al. The books that I had kept had a mix of spiritual, philosophy, Business, science, and art. I was wondering how far I have come in life to look beyond my professional sphere of books. It made me connect with John Keating’s (Robin William) famous dialogue:\nCooking aside, I also understood how much time it takes the washing machine to spin and dry our clothes. I could differentiate between dishwasher powder and washing powder. The first test cleared. It so happened that in our dryer, I had to take out the lid and clean the filter every time around. Initially, I was wondering how to fix this around and I dreaded taking the lid out and cleaning it for each cycle. I thought initially to give it a miss. Then that voice inside me, ” You are not your thoughts” kind of approach made me do it every time around. It was time to take out the clothes and that is when the penny dropped. In between the clothes, I saw a curled twenty rupee note. It took me back to my younger days when I heard a scream from my mother for not emptying the pockets of shirts and trousers before I put them for washing. The last thing I wanted to do was water plants. Also, I did it with a sense of care. Like the way my wife has observed a plant growing outwards through the pigeon net , ” Nature finds its way”. So that is how I found my way through those days.\nI realised that if I moved around the rooms and pushed the curtains there was enough sunlight that can come inside our rooms and that was a revelation. The morning lights were casting a warm yellow glow in the quiet room. In no time OK Google played Beethoven’s Symphony no 9 and it was a nice mix to warm up your day. I also moved a lot of chairs ( we have quite a few) around the room and discovered that there are quite a few places to take a rest in the house. One afternoon I was a little tired and I decided to go for a short siesta. Suddenly I heard the bell ring. I was disgusted and looked through the keyhole for the view of a short guy. I opened and told him, rubbing my eyes, that my younger daughter was out of station. He stared at me. I saw that he was carrying a bucket. He told me that they were going to take out honey from the beehive above our apartment He proactively warned me to close all my windows so that I could avoid those strangers into my apartment. I forgot my sleep and was moving around and closing all the windows in our apartment. For the first time in my life, I would close it so swiftly and thanked that apartment lord who gave me this idea of sliding windows. Being at home alone, once in a while, is a good time to appreciate what your family goes through when you are not around. During festivals, ideally family should be around so that your celebration is of a different kind.\nIt was time for my daughter and wife to come back. My daughter’s instant reaction was, ” I am noticing a lot of changes in the house”. I tried to calm her down. I told them that you would need some time to get adjusted as you have been traveling. But my wife was quick to notice and showed me that the sofa had moved by 2 inches and she blurted out, ” why the newspapers are not kept inside the cupboard?” I was speechless and smiled at them. My little daughter smiled at me and said, “I liked it, This is nice“!","highlightText":"","highlightTitle":"","highlightThreadTitle":"","language":"english","sentiment":null,"categories":null,"external_links":[],"external_images":[],"entities":{"persons":[{"name":"maggi","sentiment":"none"}],"organizations":[],"locations":[]},"rating":null,"crawled":"2023-11-04T13:11:06.067+02:00","updated":"2023-11-04T13:11:06.067+02:00"}