{"thread":{"uuid":"b7e4d9c18522a1db6a3cddb943a376f19da31bcb","url":"https://www.alimarket.es/envase/noticia/379511/packnet-analiza-el-futuro-del-packaging-en-una-jornada-sobre-innovacion-circular","site_full":"www.alimarket.es","site":"alimarket.es","site_section":"https://www.alimarket.es/media/rss/envase.xml","site_categories":["media"],"section_title":"Alimarket Envase. Información Económica Sectorial","title":"Packnet analiza el futuro del packaging en una jornada sobre innovación circular","title_full":"Packnet analiza el futuro del packaging en una jornada sobre innovación circular","published":"2023-11-03T06:00:00.000+02:00","replies_count":0,"participants_count":1,"site_type":"news","country":"ES","main_image":"https://www.alimarket.es/media/images/2023/detalle_art/379511/157424_high.jpg","performance_score":0,"domain_rank":84378,"domain_rank_updated":"2023-10-31T12:15:58.000+02:00","reach":null,"social":{"facebook":{"likes":0,"comments":0,"shares":0},"gplus":{"shares":0},"pinterest":{"shares":0},"linkedin":{"shares":0},"stumbledupon":{"shares":0},"vk":{"shares":0}}},"uuid":"b7e4d9c18522a1db6a3cddb943a376f19da31bcb","url":"https://www.alimarket.es/envase/noticia/379511/packnet-analiza-el-futuro-del-packaging-en-una-jornada-sobre-innovacion-circular","ord_in_thread":0,"parent_url":null,"author":"Alimarket Envase","published":"2023-11-03T06:00:00.000+02:00","title":"Packnet analiza el futuro del packaging en una jornada sobre innovación circular","text":"El pasado 31 de octubre Packnet, la Plataforma Tecnológica Española de Envase y Embalaje, organizó una jornada en la Agencia Estatal de Investigación en Madrid con el objetivo de reunir a una comunidad comprometida con la innovación en el packaging y la sostenibilidad. Bajo el lema \"Innovación Circular en Packaging: El camino hacia un futuro sostenible\" el evento reunió a expertos y líderes de la industria para explorar las vías hacia un futuro más sostenible en la industria del envase y embalaje.\nAntes del comienzo de la Jornada, se llevó a cabo la firma del protocolo de colaboración entre la Plataforma Tecnológica Española de Envase y Embalaje - Packnet, y el proyecto de investigación Economía Circular Local (ECIL): Políticas Públicas, Herramientas Jurídicas y Buenas Prácticas en la Gestión Circular de los Residuos Municipales. Intervinieron en esta firma en razón de sus respectivos cargos y con el reconocimiento mutuo de la capacidad legal Juan Carlos Mampaso, Presidente de la Plataforma, y Juan José Pernas García en calidad de Coordinador del Proyecto ECIL. Este acuerdo resalta el compromiso de ambas partes en la promoción de prácticas sostenibles y la innovación en la gestión de residuos y la economía circular.\nTras la cálida bienvenida a cargo de Juan Carlos Mampaso, Presidente de Packnet, y Marian Ferre, Responsable de la Subdivisión de Programas Temáticos Científico-Técnicos de la Agencia Estatal de Investigación comenzó la primera de las ponencias de la Jornada, a cargo del Profesor Juan José Pernas, Titular de Derecho Administrativo en la Universidad de A Coruña titulada \"El marco normativo 'motorizado' de los envases y residuos de envases\" que resaltó la relevancia crucial del marco legal en la industria del packaging. La presentación enfatizó cómo las regulaciones y las normativas están impulsando la evolución de los envases y la gestión de residuos en un contexto en constante cambio.\nEn la siguiente ponencia, José María Fernández Alcalá, Director de Economía Circular en IHOBE – Sociedad Pública de Gestión Ambiental, Gobierno Vasco, tuvo la oportunidad de presentar \"Cálculo de la huella ambiental de mi packaging: de la transparencia a la mejora ambiental\". Durante su exposición, se puso de relieve la importancia de la evaluación ambiental en el proceso de diseño de envases sostenibles, destacando cómo la transparencia y el análisis riguroso contribuyen a mejorar el impacto ambiental de los envases.\nLa jornada continuó con una primera Mesa Redonda sobre \"Claves prácticas de la adaptación del packaging al nuevo contexto\" bajo la moderación de María Rodríguez, Directora de Sostenibilidad en Emsur. Los ponentes invitados en esta mesa fueron Cristina Galán, Adjunta a la Dirección en la Sección de Envases en Anaip; Irati Bejarano, Gestora de Proyectos de Innovación en Basque Food Cluster; Covadonga Serrano, Directora de Comunicación en DS Smith; Ignasi Cusí, Director General en Graphispack; y Nuria Herranz, Gerente del Área Tecnológica de Consultoría, Asistencia Técnica e Innovación en Itene.\nEn este espacio de discusión, se exploraron estrategias concretas y prácticas para adaptar el packaging al contexto actual, abordando los desafíos y oportunidades que plantea la industria. Tras un breve receso de Coffee Break que fomentó el networking entre los asistenes, la Jornada retomó su orden del día con una segunda Mesa Redonda titulada \"Nuevas tecnologías de reciclado: hacia la economía circular en envases y embalajes\". Los ponentes de esta mesa redonda incluyeron a Carolina Peñalva, Responsable de Envases y Embalajes en AITIIP; Laura Sanz, Secretaria General en Confecoi; Irene Mora, Responsable de Asuntos Públicos y Sostenibilidad en Plastics Europe; y Cristina Nerin, Catedrática de Química Analítica en la Universidad de Zaragoza, moderados por Belén García, Directora de la Plataforma Tecnológica Española de Envase y Embalaje, Packnet.\nEsta mesa redonda exploró las innovaciones en el reciclaje y la sostenibilidad en la industria del packaging, donde los panelistas tuvieron la oportunidad de compartir su experiencia y conocimientos detallados sobre la influencia de las más recientes tecnologías y enfoques en el impulso del reciclaje y su aporte a la creación de una economía circular en el ámbito de los envases y embalajes. La discusión se centró en el análisis riguroso de las estrategias y soluciones innovadoras que están desempeñando un papel fundamental en la transformación de la industria y en la promoción de prácticas de mayor sostenibilidad.\nEl evento concluyó con una ponencia inspiradora titulada \"Inteligencia Artificial en el mundo de la gestión de residuos y del reciclado\" a cargo de Javier Grau, miembro del Grupo de Reciclado Mecánico en Aimplas, Instituto Tecnológico del Plástico. Durante esta presentación, se ofreció una visión preliminar sobre cómo la inteligencia artificial podrá contribuir a la mejora de la gestión de residuos y el reciclado en la industria del envase y embalaje, enmarcada dentro del proyecto europeo Reclaim. El evento ha demostrado ser un importante catalizador de la innovación y la sostenibilidad en la industria del packaging donde destacados expertos del sector se reunieron para compartir conocimientos, inspiración y oportunidades, creando así un espacio de aprendizaje e intercambio de ideas.","highlightText":"","highlightTitle":"","highlightThreadTitle":"","language":"spanish","sentiment":"neutral","categories":["Economy, Business and Finance","Technology","Environment"],"external_links":[],"external_images":[],"entities":{"persons":[],"organizations":[],"locations":[]},"rating":null,"crawled":"2023-11-04T13:07:27.325+02:00","updated":"2023-11-04T13:07:27.325+02:00"}