{"thread":{"uuid":"b9af4ce234511ca5531c0eedca62adacb7f94352","url":"https://www.bona.co.za/health-wellness/home-remedies-to-get-rid-of-smelly-armpits/","site_full":"www.bona.co.za","site":"bona.co.za","site_section":"https://bona.co.za","site_categories":["fashion","style_and_fashion"],"section_title":"Bona Magazine | B beautiful, B entertained, B inspired, B stylish &amp; B healthy","title":"Home remedies to get rid of smelly armpits | Bona Magazine","title_full":"Home remedies to get rid of smelly armpits | Bona Magazine","published":"2023-11-04T10:00:00.000+02:00","replies_count":0,"participants_count":1,"site_type":"news","country":"ZA","main_image":"https://www.bona.co.za/wp-content/uploads/2023/11/pexels-shotpot-6338308.jpg","performance_score":0,"domain_rank":797060,"domain_rank_updated":"2023-10-31T12:17:47.000+02:00","reach":null,"social":{"facebook":{"likes":0,"comments":0,"shares":0},"gplus":{"shares":0},"pinterest":{"shares":0},"linkedin":{"shares":0},"stumbledupon":{"shares":0},"vk":{"shares":0}}},"uuid":"b9af4ce234511ca5531c0eedca62adacb7f94352","url":"https://www.bona.co.za/health-wellness/home-remedies-to-get-rid-of-smelly-armpits/","ord_in_thread":0,"parent_url":null,"author":"Jade Rhode","published":"2023-11-04T10:00:00.000+02:00","title":"Home remedies to get rid of smelly armpits | Bona Magazine","text":"With the earth’s temperatures rising coming and going, there is no doubt that our body will react in a certain, smelly way. Smelly armpits are a common problem faced by many. Deodorants and antiperspirants can be used to mask the smell, however, some of these products contain harmful chemicals that can be harmful to both the environment and our health, notes the health and wellness-focused publication, HealthShots. Luckily, there are a few natural deodorants that people can use. Apple cider vinegar Healthcare app PharmEasy explains that apple cider vinegar assists in effectively destroying bacteria, making it a useful remedy for smelly armpits. How to use it: Dilute a few drops of the vinegar in water. Put it in a spray bottle to spray under your arms, or apply the mixture to your underarms using cotton swabs. Green tea PharmEasy also explains that green tea may help block the pores on your skin and reduce sweating. How to use it: Soak a few green tea bags in warm water. Remove the tea bag from the water. Once it reaches room temperature, place it under your armpits for a few minutes. Baking soda Sodium bicarbonate, also known as baking soda, is an alkaline that can help neutralise odour-causing acids on the skin, explains HealthShots. The chemical compound also has absorbent properties that can help to keep you dry. How to use it: Mix a small amount of baking soda with water to create a paste. Apply the paste to your underarms, which will help prevent sweating and reduce odour. Coconut oil Another natural home remedy provided by HealthShots is coconut oil, which has antimicrobial properties that help kill odour-causing bacteria on the skin. Coconut oil can also act as a moisturiser, as its properties can help soothe and protect the delicate skin under the arms. How to use it: Apply then rub a small amount of coconut oil to your underarms until it is absorbed into your skin. Lifestyle modifications Decreasing the intake or avoiding body odour-causing foods like caffeine, alcohol, onions, or garlic, may help to manage smelly underarms, states PharmEasy. You can also try removing your underarm hair, as hair acts as a breeding ground for bacteria. Also see: [How to remove odour from smelly shoes](https://www.bona.co.za/lifestyle/how-to-remove-odour-from-smelly-shoes/)","highlightText":"","highlightTitle":"","highlightThreadTitle":"","language":"english","sentiment":null,"categories":null,"external_links":[],"external_images":[],"entities":{"persons":[],"organizations":[{"name":"healthcare","sentiment":"none"}],"locations":[]},"rating":null,"crawled":"2023-11-04T13:06:49.245+02:00","updated":"2023-11-04T13:06:49.245+02:00"}