{"thread":{"uuid":"bda71f3eda55d00fd78fb5bf40e677f86bad687f","url":"https://www.bruneitribune.com/retailers-anticipate-slower-inflation-in-october/","site_full":"www.bruneitribune.com","site":"bruneitribune.com","site_section":"https://bruneitribune.com","site_categories":["media"],"section_title":"Home - Brunei Tribune","title":"Retailers anticipate slower inflation in October - Brunei Tribune","title_full":"Retailers anticipate slower inflation in October - Brunei Tribune","published":"2023-11-02T07:00:00.000+02:00","replies_count":0,"participants_count":1,"site_type":"news","country":"US","main_image":"","performance_score":0,"domain_rank":null,"domain_rank_updated":null,"reach":null,"social":{"facebook":{"likes":0,"comments":0,"shares":0},"gplus":{"shares":0},"pinterest":{"shares":0},"linkedin":{"shares":0},"stumbledupon":{"shares":0},"vk":{"shares":0}}},"uuid":"bda71f3eda55d00fd78fb5bf40e677f86bad687f","url":"https://www.bruneitribune.com/retailers-anticipate-slower-inflation-in-october/","ord_in_thread":0,"parent_url":null,"author":"admin","published":"2023-11-02T07:00:00.000+02:00","title":"Retailers anticipate slower inflation in October - Brunei Tribune","text":"The leadership of the Philippine Amalgamated Supermarkets Association (PAGASA) has said October's inflation numbers are likely to show a decline amid government interventions and consumers' growing intolerance to further price increases. In an interview on Thursday, PAGASA president Steven Cua said prices of goods commonly sold in supermarkets were notably stable last month, with select items even seeing a slash in prices. He agreed with the Bangko Sentral ng Pilipinas' (BSP) month-ahead forecast, which predicted headline inflation in October to decelerate to the 5.1 to 5.9 percent range. This is softer than the country's 6.1 percent inflation figure in September this year, and substantially lower than the 7.7 percent posted in October 2022. 'Consumers are maxed out with recent price increases… you can't raise prices anymore without losing market share. From our end, we can really feel inflation getting slower,' Cua told the Philippine News Agency. It was also mentioned that President Ferdinand R. Marcos, Jr.'s Executive Order No. 39, which mandated price caps on regular- and well-milled rice, also helped moderate price pressures. The Philippine Statistics Authority is expected to release October's inflation numbers next week. Meanwhile, Cua noted that changing consumer habits and government policies have caused retailers to lose out on potential sales bonanzas during the back-to-back Barangay and Sangguniang Kabataan Elections (BSKE) and the observation of All Saint's Day. He explained that such dates usually signal surges in the sales of beverages and snack items, among other goods. Cua said the sales of bottled water, soft drinks, biscuits and other snacks were not buoyed by last Monday's elections, because the Commission on Elections (Comelec) now prohibits candidates from serving refreshments to voters. The business leader added that supermarkets' sales of refreshment items also failed to pick up on Nov. 1 because people who visit the cemetery now prefer to order food via 'Grab' or buy from food trucks positioned near burial places. 'We really missed out on two good reasons for money to move around,' said Cua. Source: Philippines News Agency","highlightText":"","highlightTitle":"","highlightThreadTitle":"","language":"english","sentiment":null,"categories":null,"external_links":[],"external_images":[],"entities":{"persons":[{"name":"steven cua","sentiment":"none"},{"name":"pilipinas","sentiment":"none"},{"name":"ferdinand r. marcos","sentiment":"none"},{"name":"cua","sentiment":"none"}],"organizations":[{"name":"pagasa","sentiment":"none"},{"name":"philippine amalgamated supermarkets association","sentiment":"none"},{"name":"philippine news agency","sentiment":"none"}],"locations":[{"name":"brunei","sentiment":"none"}]},"rating":null,"crawled":"2023-11-04T13:07:40.347+02:00","updated":"2023-11-04T13:07:40.347+02:00"}