{"thread":{"uuid":"cbaab6c6e2b2bb7c5dc6d1a87f09135f58f51529","url":"https://www.dailydot.com/news/mcdonalds-app-backlash/","site_full":"www.dailydot.com","site":"dailydot.com","site_section":"http://www.dailydot.com/feed/summary/latest/","site_categories":["media"],"section_title":"The Daily Dot","title":"Main Character of the Week: The McDonald’s app","title_full":"Main Character of the Week: The McDonald’s app","published":"2023-11-04T13:00:00.000+02:00","replies_count":0,"participants_count":1,"site_type":"news","country":"US","main_image":"https://uploads.dailydot.com/2023/11/Main-Character-of-the-Week-1132023.jpg?auto=compress&fit=scale&fm=pjpg&h=400&w=800","performance_score":0,"domain_rank":2218,"domain_rank_updated":"2023-10-31T12:15:27.000+02:00","reach":null,"social":{"facebook":{"likes":0,"comments":0,"shares":0},"gplus":{"shares":0},"pinterest":{"shares":0},"linkedin":{"shares":0},"stumbledupon":{"shares":0},"vk":{"shares":0}}},"uuid":"cbaab6c6e2b2bb7c5dc6d1a87f09135f58f51529","url":"https://www.dailydot.com/news/mcdonalds-app-backlash/","ord_in_thread":0,"parent_url":null,"author":"Ramon Ramirez","published":"2023-11-04T13:00:00.000+02:00","title":"Main Character of the Week: The McDonald’s app","text":"Main Character of the Week is a weekly column that tells you the most prominent “main character” online (good or bad). It runs on Fridays in the Daily Dot’s web_crawlr newsletter. If you want to get this column a day before we publish it,\nsubscribe to web_crawlr, where you’ll get the daily scoop of internet culture delivered straight to your inbox.\nThe internet is a stage, and someone unwillingly stumbles onto it weekly. This makes them the “main character” online. Sometimes their story is heartwarming, like the woman who is running an\nunderground Zoom class for Afghan girls; usually it’s a gaffe. In any case, that main character energy flows through the news cycle and turbo-charges debate for several business days.\nHere’s the\nTrending team’s main character of the week.\nIt’s the McDonald’s app, which rolled out controversial new terms and conditions, much to\nTikTok’s dismay this week.\nThe fast food app has become popular as Americans deal with\nfood deserts and soaring prices. This has allowed fast food chains to fill the nutritional gap further by building sticky funnels of rewards points and thereby gamifying drive-thru orders. It’s common to see internet talking heads going viral for loopholes about deals on the McDonald’s app. It’s common to see people with more rewards points than dollars in their bank accounts.\nAs we\nreported this week: “a shocking clause in the new Terms and Conditions of the McDonald’s mobile app that reportedly requires users to waive their right to a trial in court, including their right to a jury trial, if they want to continue using the app.”\nIt sparked comparisons to the infamous “hot coffee” case of 1994 where a woman infamously sued the fast food giant for carelessly serving her hot coffee. Does this mean a similar incident would make it impossible to sue? That’s unlikely, because a company’s ability to enforce its terms can be\nchallenged in court.\nCustomers were also suspicious of the app’s propensity to crash when users needed it most: When they’re actually at a McDonald’s. (Anecdotally, this happens to me all the time with the\nPetco app.) Could McDonald’s be bracing for a class-action lawsuit and that’s why it updated its terms of use? Has McDonald’s been baiting its app users with a faulty system that won’t actually deliver the goods its promised?\nAs TikTok user Emma said in a\nviral video:\n“They know I’m gonna be using a coupon in that drive-thru, and they hemorrhage the app, so it stops working. I have spent multiple three-dollar increments because the app stopped working when I needed it the most during the drive-thru.”\nBecause the app constantly fails to work at this inconvenient time, Emma believes that McDonald’s is doing this “on purpose.”\n“Hear me out,” she added. “If they’re doing this to every person, not just me but every person trying to use the app in the drive-thru, they’re making so much money. They know that people could be spending two dollars on a double cheese instead of four dollars or whatever it is.”\nAt least one customer said she’d refused to update her app and\nsue over the changes. The discourse even sparked a meme about signing your life away for McNuggets.\nWe’ve reached out to McDonald’s about this. For now, you can still at least order\nfresh fries.","highlightText":"","highlightTitle":"","highlightThreadTitle":"","language":"english","sentiment":"neutral","categories":["Lifestyle and Leisure","Technology","Economy, Business and Finance"],"external_links":["https://ironcladapp.com/journal/contracts/terms-and-conditions-legally-binding/","https://ironcladapp.com/journal/contracts/terms-and-conditions-legally-binding","https://www.ironcladapp.com/journal/contracts/terms-and-conditions-legally-binding/"],"external_images":[],"entities":{"persons":[],"organizations":[{"name":"mcdonald","sentiment":"negative"}],"locations":[]},"rating":null,"crawled":"2023-11-04T13:11:14.196+02:00","updated":"2023-11-04T13:11:14.196+02:00"}