{"thread":{"uuid":"9791edf5a7e5ed89448f41e30b80348c985dc0a5","url":"http://csnbbs.com/thread-978948-page-29.html","site_full":"csnbbs.com","site":"csnbbs.com","site_section":"https://csnbbs.com/forum-540.html","site_categories":["tech","net_conferencing"],"section_title":"CSNbbs - The Kyra Memorial Spin Room ","title":"The Israeli-Hamas War","title_full":"The Israeli-Hamas War","published":"2023-11-03T16:13:00.000+02:00","replies_count":19,"participants_count":14,"site_type":"discussions","country":"US","main_image":"","performance_score":0,"domain_rank":454279,"domain_rank_updated":"2023-10-31T12:16:55.000+02:00","reach":null,"social":{"facebook":{"likes":0,"comments":0,"shares":0},"gplus":{"shares":0},"pinterest":{"shares":0},"linkedin":{"shares":0},"stumbledupon":{"shares":0},"vk":{"shares":0}}},"uuid":"cd42c370e863676bc8c21a88900a10d1a3854b95","url":"http://csnbbs.com/thread-978948-page-29.html#pid19253877","ord_in_thread":17,"parent_url":null,"author":"Was SoMs Eagle","published":"2023-11-03T16:59:00.000+02:00","title":"","text":"(Yesterday 09:59 AM) Quote: : (Yesterday 09:54 AM) Quote: : (Yesterday 09:46 AM) Quote: : (Yesterday 09:11 AM) Quote: : (Yesterday 08:54 AM) Quote: : The speech at moment is a lot of praise for the martyrs and congratulations to Yemen and Iraq for joining the war. States the decision for oct 7 was purely and secretively Palestine.\nBlames Israel for Oct 7 and states they are the ones who killed their own.\nClaims Israel is weak because it required the USA to intervene and support them.\nIt was an operation that was needed in Palestine.\nBuilding a justification of war.\nMentions the war is a humanitarian one and claims Israel is massacring thousands.\nBlames USA for lies and for covering up Israel.\nBlames USA for starting the war.\nUSA and Israel must be held accountable.\nCalls USA and Israel as child murdererals.\nCalls on all to do their human duty and stand against Israel and USA and the international community.\nMentions 1948 war.\nCalls war in Gaza historical one and different from previous wars and must set objectives and ensure victory for the Gazans.\nVictory for Gaza is a victory for all Islam. - Lebanon, Jordan, Syria, Egypt.... especially Lebanon...\nSent from my SM-G988U using Tapatalk\nSo basically he is a little barking toy poodle. Even he knows that this is different. If he eats too much cake, Israel will be occupying the southern half of Lebanon and Hezzbollah will no longer be an entity, but like Hamas brought about their own destruction.\nIsrael is very good with hunting down people. See their history with escaped Nazi's after WW2 as well as the Munich Olympic terrorists. They have a separate agency that was created specifically sifting through every picture and video of the terrorists responsible for Oct 7th. They will send kill squads and get it done. The head of Hamas who sits in Qatar eating at the four seasons better employ a food taster for the rest of his life. His days are numbered walking this earth cause Israel will get him, even if he moved to North Korea to escape. Yeap, basically a standoff and will play tennis with Israel to keep the northern forces away from Gaza.\nBut it also looks like Hezbollah etc, has set a red line.\nSent from my SM-G988U using Tapatalk\nWhat red line? I was under the impression that their red line was going into gaza how did that turn out for them? The survival of Hamas is integral to them and they will act accordingly if it feels that Hamas is about to be done for.\nSent from my SM-G988U using Tapatalk\nWith what? The lawnmower engine drones they are selling to Russia? Sure. They’ll do in Israel. They have already learned that none of their missiles have made it to Israel yet. They have no real functioning Air Force. Just as Sadom’s unbeatable republican guard found out when they f’d around, the Iranian mullahs will find out in a hurry…..well at least when Trump gets back in the White House.","highlightText":"","highlightTitle":"","highlightThreadTitle":"","language":"english","sentiment":null,"categories":null,"external_links":null,"external_images":[],"entities":{"persons":[],"organizations":[],"locations":[]},"rating":null,"crawled":"2023-11-04T13:11:34.739+02:00","updated":"2023-11-04T13:11:34.739+02:00"}