{"thread":{"uuid":"d6ec0a36dbdd7729f8a7bd725f51552444c44f9d","url":"https://daijiworld.com/news/newsDisplay?newsID=1136878","site_full":"daijiworld.com","site":"daijiworld.com","site_section":"http://www.daijiworld.com/rssfeed/rssfeed.xml","site_categories":["media"],"section_title":"Today's News on Daijiworld.com","title":"Petroleum, coal, chemicals, infra sector pulled down credit growth in Sep’23: Bank of Baroda","title_full":"Petroleum, coal, chemicals, infra sector pulled down credit growth in Sep’23: Bank of Baroda","published":"2023-11-04T06:13:00.000+02:00","replies_count":0,"participants_count":1,"site_type":"news","country":"IN","main_image":"http://daijiworld.com/images/daijiSquareLogo.png","performance_score":0,"domain_rank":21038,"domain_rank_updated":"2023-10-31T12:15:27.000+02:00","reach":null,"social":{"facebook":{"likes":0,"comments":0,"shares":0},"gplus":{"shares":0},"pinterest":{"shares":0},"linkedin":{"shares":0},"stumbledupon":{"shares":0},"vk":{"shares":0}}},"uuid":"d6ec0a36dbdd7729f8a7bd725f51552444c44f9d","url":"https://daijiworld.com/news/newsDisplay?newsID=1136878","ord_in_thread":0,"parent_url":null,"author":"daijiworld.com","published":"2023-11-04T06:13:00.000+02:00","title":"Petroleum, coal, chemicals, infra sector pulled down credit growth in Sep’23: Bank of Baroda","text":"13th Annual Convocation\nChennai, Nov 4 (IANS): Lower credit offtake by petroleum, coal, chemicals, infrastructure has resulted in the moderate growth in credit in September 2023 as compared to corresponding period of the previous year, said a report by Bank of Baroda.\nAccording to Sonal Bandhan, Economist at the Bank of Baroda, an analysis of Reserve Bank of India’s (RBI) sectoral deployment of credit data shows that in year-on-year (YoY) terms, credit growth (excluding the impact of HDFC merger) as of Sep’23 has moderated a bit this year 15.3 per cent compared with last year 16.4 per cent.\nMost of the slowdown can be attributed to the industrial sector, within which petroleum/coal, chemicals and infrastructure have pushed the growth lower.\nOn the other hand, credit to the agriculture and services sector has fared better this year. Within services, commercial real estate, aviation, professional services and transport operators contributed positively to growth.\nPersonal loan segment growth has been relatively steady. Data from the TransUnion CIBIL report shows that the delinquency rate for personal loans has improved as of Jun’23.\nOut of the 19 sub-sectors tracked under industry, nine sectors witnessed a slowdown in credit growth as of Sep’23 compared with last year.\nAmongst these, steepest decline was noted in sectors like petroleum/coal products, chemicals, rubber/plastic products, infrastructure, engineering, leather, paper, and mining sector.\nOn the other hand, most improvement was noted in sectors like beverages & tobacco, glassware, cement and products, gems & jewellery and basic metals.\nAs many as 12 sectors reported an above average growth of 6.5 per cent as of Sep’23 and these included: food processing, beverage & tobacco, textiles, wood and products, rubber/plastic, glass, cement, basic metals, engineering, vehicles & parts, gems & jewellery and other industries.\n“Sectors witnessing less than average credit growth were: mining, leather, paper, petroleum/coal, chemicals, construction and infrastructure,” the report said.\nAmongst the services, apart from computer software, shipping, trade and NBFCs, all other sub-sectors reported an improvement. Most significant pick up was seen in aviation, where credit growth jumped to 69.4 per cent as of Sep’23, following a 22.2 per cent decline last year.\n“Apart from this, credit to professional services (22.2 per cent versus 8.9 per cent), transport operators (21.6 per cent versus 12.1 per cent) and tourism/hotels (11.1 per cent versus 8 per cent) gained the most,” the report notes.\nDisclaimer:\nPlease write your correct name and email address. Kindly do not post any personal, abusive, defamatory, infringing, obscene, indecent, discriminatory or unlawful or similar comments. Daijiworld.com will not be responsible for any defamatory message posted under this article.\nPlease note that sending false messages to insult, defame, intimidate, mislead or deceive people or to intentionally cause public disorder is punishable under law. It is obligatory on Daijiworld to provide the IP address and other details of senders of such comments, to the authority concerned upon request.\nHence, sending offensive comments using daijiworld will be purely at your own risk, and in no way will Daijiworld.com be held responsible.","highlightText":"","highlightTitle":"","highlightThreadTitle":"","language":"english","sentiment":"negative","categories":["Economy, Business and Finance","Environment"],"external_links":[],"external_images":[],"entities":{"persons":[{"name":"sonal bandhan","sentiment":"none"}],"organizations":[{"name":"bank of baroda","sentiment":"negative"},{"name":"ians","sentiment":"negative"},{"name":"transunion cibil","sentiment":"none"},{"name":"reserve bank of india","sentiment":"none"},{"name":"hdfc","sentiment":"none"}],"locations":[]},"rating":null,"crawled":"2023-11-04T13:07:34.654+02:00","updated":"2023-11-04T13:07:34.654+02:00"}