{"thread":{"uuid":"e44b32a7b8bf4f06535eafeea1029fd9d7a0b99c","url":"https://news.yam.md/ro/story/14677236","site_full":"news.yam.md","site":"yam.md","site_section":"https://news.yam.md/ro/feeds/rss201","site_categories":["media"],"section_title":"News.yam.md","title":"Judocanul Denis Vieru a devenit campion european","title_full":"Judocanul Denis Vieru a devenit campion european","published":"2023-11-04T12:50:00.000+02:00","replies_count":0,"participants_count":0,"site_type":"news","country":"MD","main_image":"","performance_score":0,"domain_rank":967552,"domain_rank_updated":"2023-10-31T12:19:52.000+02:00","reach":null,"social":{"facebook":{"likes":0,"comments":0,"shares":0},"gplus":{"shares":0},"pinterest":{"shares":0},"linkedin":{"shares":0},"stumbledupon":{"shares":0},"vk":{"shares":0}}},"uuid":"e44b32a7b8bf4f06535eafeea1029fd9d7a0b99c","url":"https://news.yam.md/ro/story/14677236","ord_in_thread":0,"parent_url":null,"author":null,"published":"2023-11-04T12:50:00.000+02:00","title":"Judocanul Denis Vieru a devenit campion european","text":"Judocanul Denis Vieru a devenit campion european\n[Unica.md](/ro/b/unica-md), 4 noiembrie 2023 12:50\nJudocanul Denis Vieru a cucerit medalia de aur la Campionatul European din Montpellier, Franța. Potrivit Comitetului Național Olimpic și Sportiv, victoria lui Denis Vieru este o premieră. Acesta a participat ... Post-ul Judocanul Denis Vieru a devenit campion european apare prima dată în Unica.md.\n• • •\nAlte ştiri de Unica.md\nAcum 10 minute\n13:00\nÎncepând de astăzi, 3 noiembrie, se stabilește o o nouă stație de așteptare a transportului public în Capitală. Potrivit Regia Transport Electric, măsura a fost luată la solicitarea vizitatorilor Centrului Medicilor ... Post-ul În Capitală a fost instalată o nouă stație de așteptare a transportului public apare prima dată în Unica.md.\nAcum 30 minute\n12:50\nJudocanul Denis Vieru a cucerit medalia de aur la Campionatul European din Montpellier, Franța. Potrivit Comitetului Național Olimpic și Sportiv, victoria lui Denis Vieru este o premieră. Acesta a participat ... Post-ul Judocanul Denis Vieru a devenit campion european apare prima dată în Unica.md.\n12:40\n[Tânăra de 19 ani decedată în accidentul din Fălești a fost una dintre absolventele cu 10 pe linie la Bacalaureat](/ro/s/14677224) [#](/ro/story/14677224) [Unica.md](/ro/b/unica-md)\nTânăra de 19 ani, care ieri și-a pierdut viața în urma unui accident rutier, s-a dovedit a fi una una din cele două tinere din Bălți care anul acesta a ... Post-ul Tânăra de 19 ani decedată în accidentul din Fălești a fost una dintre absolventele cu 10 pe linie la Bacalaureat apare prima dată în Unica.md.\nAcum 4 ore\n10:50\n[Un bărbat din Vatra a chemat poliția după ce o femeie și-a făcut apariția la poarta gospodăriei sale. Ce intenție avea aceasta?](/ro/s/14677019) [#](/ro/story/14677019) [Unica.md](/ro/b/unica-md)\nÎn această seară, în localitatea Vatra din mun. Chişinău, Poliția a fost sesizată de un bărbat că la poarta gospodăriei sale s-a apropiat o femeie care i-a propus o sumă ... Post-ul Un bărbat din Vatra a chemat poliția după ce o femeie și-a făcut apariția la poarta gospodăriei sale. Ce intenție avea aceasta? apare prima dată în Unica.md.\n10:30\nUn incendiu a izbucnit în seara zilei de 3 noiembrie, în interiorul unui hipermarket din municipiul Bălți. Potrivit ofițerului de presă al IGSU, Liliana Pușcașu, incendiul a avut loc ieri, ... Post-ul Incendiu la Bălți. Un hipermarket a fost cuprins de flăcări apare prima dată în Unica.md.\n10:20\n[Două fetițe, la un pas de tragedie după ce roata în care se dădeau s-a oprit, scaunele s-au răsturnat, iar ele au căzut](/ro/s/14676958) [#](/ro/story/14676958) [Unica.md](/ro/b/unica-md)\nDouă fetițe, de 11 și 13 ani, au fost rănite, după ce au căzut din roata Ferris a unui parc de distracții din Rio Preto da Eva, regiunea metropolitană Manaus, ... Post-ul Două fetițe, la un pas de tragedie după ce roata în care se dădeau s-a oprit, scaunele s-au răsturnat, iar ele au căzut apare prima dată în Unica.md.\n10:10\n[Israelul are cea mai protejată bancă de sânge din lume. Aceasta se află subteran și este rezistentă la atacuri](/ro/s/14676931) [#](/ro/story/14676931) [Unica.md](/ro/b/unica-md)\nBanca de sânge din Israel a fost inaugurată în anul 1987 și este de o importanță uriașă pentru țară. Aceasta este responsabilă de colectarea, procesarea, testarea și distribuirea unităților de ... Post-ul Israelul are cea mai protejată bancă de sânge din lume. Aceasta se află subteran și este rezistentă la atacuri apare prima dată în Unica.md.\n10:00\n[Maia Sandu cheamă moldovenii la vot: ,,Să clădim cu votul nostru Moldova europeană de mâine”](/ro/s/14676906) [#](/ro/story/14676906) [Unica.md](/ro/b/unica-md)\nPreşedintele Republicii Moldova, Maia Sandu, a avertizat asupra încercărilor forţelor pro-Kremlin şi a forţelor pro-război de a „încerca din răsputeri să blocheze drumul european” al Moldovei și a făcut un ... Post-ul Maia Sandu cheamă moldovenii la vot: ,,Să clădim cu votul nostru Moldova europeană de mâine” apare prima dată în Unica.md.\n10:00\nLa începutul acestei săptămâni, în Spania s-a născut primul bebeluș din Europa care a fost purtat în pântece de două femei. Estefanía și Azahara, care formează un cuplu, și-au dorit ... Post-ul Două femei din Spania au fost însărcinate cu același copil apare prima dată în Unica.md.\n09:50\nSuedia a luat o hotărâre la care nimeni nu se aștepta. Țara interzice bagajele la concerte și meciurile de fotbal. Decizia vine în contextul unei amenințări teroriste sporite de nivel ... Post-ul Țara din Europa care interzice bagajele la concerte și meciurile de fotbal apare prima dată în Unica.md.\n09:50\n[Cea mai mare ploaie din ultimii 100 de ani. Furtuna care a făcut ravagii în Italia. Au fost confirmate 5 decese](/ro/s/14676889) [#](/ro/story/14676889) [Unica.md](/ro/b/unica-md)\nZone mari din Toscana au fost afectate de inundații, soldate cu cinci morți și mai multe persoane dispărute, în timp ce vântul și ploile puternice afectează întreg centrul Italiei. Oamenii ... Post-ul Cea mai mare ploaie din ultimii 100 de ani. Furtuna care a făcut ravagii în Italia. Au fost confirmate 5 decese apare prima dată în Unica.md.\n09:40\nCeline Dion și copiii ei au sărbătorit începutul sezonului de sărbători petrecând timp de calitate împreună. Artista și băieții ei au urmărit luni meciul dintre Montreal Canadiens și Vegas Golden ... Post-ul Celine Dion a publicat o fotografie rară cu cei trei băieți ai săi apare prima dată în Unica.md.\n09:40\n[Un italian gelos s-a închis în dulap ca să-și spioneze soția. Povestea a luat o turnură total neașteptată](/ro/s/14676866) [#](/ro/story/14676866) [Unica.md](/ro/b/unica-md)\nConvins fiind că soția lui îl înșală, un italian gelos s-a decis să o spioneze și nu s-a putut gândi la nimic altceva mai bun decât să se ascundă în ... Post-ul Un italian gelos s-a închis în dulap ca să-și spioneze soția. Povestea a luat o turnură total neașteptată apare prima dată în Unica.md.\n09:30\n[Alla Pugaciova s-a întors în Rusia din Israel. Biserica Ortodoxă Rusă vrea ca artista să-şi ceară scuze pentru că a criticat războiul din Ucraina](/ro/s/14676847) [#](/ro/story/14676847) [Unica.md](/ro/b/unica-md)\nBiserica Ortodoxă Rusă vrea ca Alla Pugaciova, cea mai renumită cântăreaţă pop din ţară, care săptămâna aceasta s-a întors acasă din Israel, să-şi ceară scuze pentru criticile sale la adresa ... Post-ul Alla Pugaciova s-a întors în Rusia din Israel. Biserica Ortodoxă Rusă vrea ca artista să-şi ceară scuze pentru că a criticat războiul din Ucraina apare prima dată în Unica.md.\n09:20\n[Toți candidații Partidului ”Șansă”, excluși din alegerile locale generale din 5 noiembrie](/ro/s/14676839) [#](/ro/story/14676839) [Unica.md](/ro/b/unica-md)\nToți candidații Partidului ”Șansă” la alegerile locale generale de duminică, 5 noiembrie, au fost excluși din cursă. Anunțul a fost făcut de premierul Dorin Recean după ședința Comisiei Situații Excepționale, în ... Post-ul Toți candidații Partidului ”Șansă”, excluși din alegerile locale generale din 5 noiembrie apare prima dată în Unica.md.\nAcum 24 ore\n22:20\n[Albă ca Zăpada refuză să mai fie salvată de prinț! Ce spune un expert în educație despre dispariția piticilor din povestea atâtor generații](/ro/s/14676507) [#](/ro/story/14676507) [Unica.md](/ro/b/unica-md)\n„Capra cu trei iezi”, „Cenușăreasa”, „Albă ca Zăpada”, „Scufița Roșie.” Unii dintre noi le regăsim ca fiind poveștile copilăriei – cu personaje care ne erau simpatice sau antipatice- prin rolul ... Post-ul Albă ca Zăpada refuză să mai fie salvată de prinț! Ce spune un expert în educație despre dispariția piticilor din povestea atâtor generații apare prima dată în Unica.md.\n22:20\n[Un bărbat, înjunghiat de mai multe ori de concubină pentru că nu i-a plăcut mâncarea pe care i-a gătit-o](/ro/s/14676506) [#](/ro/story/14676506) [Unica.md](/ro/b/unica-md)\nUn bărbat din județul Arad a fost înjunghiat de mai multe ori de către concubina sa, după ce i-a spus acesteia că nu-i place mâncarea pe care a gătit-o. Vecinii ... Post-ul Un bărbat, înjunghiat de mai multe ori de concubină pentru că nu i-a plăcut mâncarea pe care i-a gătit-o apare prima dată în Unica.md.\n22:10\nComitetul Național UWC din Moldova are o noutate bună pentru elevii care vor să obțină o experiență de studii peste hotare. Anul acesta, Comitetului Național i-au fost oferite patru burse. ... Post-ul Elevii din R. Moldova au posibilitatea de a câștiga burse la colegiile UWC apare prima dată în Unica.md.\n22:10\n[O femeie care a pierdut zborul a fugit pe pistă în fața avionului, ca să-l facă pe pilot să oprească și s-o ia și pe ea](/ro/s/14676486) [#](/ro/story/14676486) [Unica.md](/ro/b/unica-md)\nO femeie a fost arestată în Australia după ce a pătruns pe pista aeroportului și a fugit în fața unui avion care se pregătea să decoleze, încercând să-l facă pe ... Post-ul O femeie care a pierdut zborul a fugit pe pistă în fața avionului, ca să-l facă pe pilot să oprească și s-o ia și pe ea apare prima dată în Unica.md.\n22:10\nO scriitoare canadiană a pledat vinovată, după ce a fost acuzată că și-a răpit fiul și că și-a înscenat moartea, potrivit BBC citat de digi24.ro. Dawn Walker, o femeie indigenă ... Post-ul O scriitoare din Canada și-a înscenat propria moarte și a fugit cu copilul în SUA apare prima dată în Unica.md.\n22:00\n[Putin a renunțat la carantina obligatorie de 2 săptămâni pentru oricine voia să se întâlnească cu el. Noi reguli de acces la Kremlin](/ro/s/14676467) [#](/ro/story/14676467) [Unica.md](/ro/b/unica-md)\nKremlinul a redus perioada de carantină obligatorie pentru întâlnirea cu președintele Vladimir Putin la cinci zile, pe măsură ce se apropie alegerile prezidențiale din 2024, la care se așteaptă să ... Post-ul Putin a renunțat la carantina obligatorie de 2 săptămâni pentru oricine voia să se întâlnească cu el. Noi reguli de acces la Kremlin apare prima dată în Unica.md.\n22:00\nZeama de murături, fie că e vorba de zeama de la castraveții în saramură ori de la gogoșarii în oțet sau zeama de varză, are câteva beneficii importante pentru sănătate. ... Post-ul Zeama de la murături, mai puternică decât orice băutură energizantă apare prima dată în Unica.md.\n22:00\nDacă ai atins vârsta de 40 de ani, este important să acorzi o atenție deosebită inimii tale. Unele alimente sănătoase te pot ajuta să o menții sănătoasă și să previi ... Post-ul Ai ajuns la 40 de ani? Ce să mănânci pentru a avea o inimă sănătoasă apare prima dată în Unica.md.\n22:00\n[Caz șocant la o maternitate din Constanța. O femeie care tocmai devenise mamă s-a aruncat de la etaj](/ro/s/14676464) [#](/ro/story/14676464) [Unica.md](/ro/b/unica-md)\nCaz șocant la maternitatea Spitalului din Medgidia, județul Constanța. O femeie care tocmai devenise mamă a căzut de la etajul 3 al unității sanitare și a fost găsită din păcate ... Post-ul Caz șocant la o maternitate din Constanța. O femeie care tocmai devenise mamă s-a aruncat de la etaj apare prima dată în Unica.md.\n21:50\n[Școală în pădure. Metodă aplicată într-o țară pentru a-i ajuta pe copii să-și dezvolte un sistem imunitar mai puternic](/ro/s/14676440) [#](/ro/story/14676440) [Unica.md](/ro/b/unica-md)\nCât e ziua de lungă, copiii de la o creșă din Helsinki stau numai în pădure. Timpul petrecut acolo îi ajută să-și întărească sănătatea, să-și dezvolte abilitățile și să aprecieze ... Post-ul Școală în pădure. Metodă aplicată într-o țară pentru a-i ajuta pe copii să-și dezvolte un sistem imunitar mai puternic apare prima dată în Unica.md.\n20:10\nLa #stilunic avem primul cuplu din acest sezon: Valeria Țurcan, alias Valeris Food și Maxim Cerbadji. Din start i-am pus la un test de a le vedea compatibilitatea. Au răspuns ... Post-ul #stilunic – Valeria Țurcan și Maxim Cerbadji:”Noi azi cu Valeria nu prea ne împăcăm”! apare prima dată în Unica.md.\n16:50\n[Maria Zaharova, atac dur la adresa Maiei Sandu: „E o rușine și un pericol pentru moldoveni”](/ro/s/14675636) [#](/ro/story/14675636) [Unica.md](/ro/b/unica-md)\nPortavocea Kremlinului a acuzat guvernarea de la Chișinău că „încearcă să distragă atenția de la propriile eșecuri” prin „exagerarea amenințării rusești”, iar pe Maia Sandu a atacat-o, după ce președinta ... Post-ul Maria Zaharova, atac dur la adresa Maiei Sandu: „E o rușine și un pericol pentru moldoveni” apare prima dată în Unica.md.\n16:30\n[Observatori europeni, sosiți la Chişinău pentru a monitoriza scrutinul electoral de duminică](/ro/s/14675552) [#](/ro/story/14675552) [Unica.md](/ro/b/unica-md)\nPreședintele Parlamentului, Igor Grosu, a discutat astăzi cu membrii delegației Misiunii de observatori din cadrul Parlamentului European, veniți la Chișinău pentru a monitoriza acest scrutin electoral. ”Despre alegerile locale din ... Post-ul Observatori europeni, sosiți la Chişinău pentru a monitoriza scrutinul electoral de duminică apare prima dată în Unica.md.\n16:30\n[Două medalii de bronz și o mențiune de onoare pentru Republica Moldova la Olimpiada Balcanică de Informatică](/ro/s/14675550) [#](/ro/story/14675550) [Unica.md](/ro/b/unica-md)\nEchipa Republicii Moldova a obținut două medalii de bronz și o mențiune de onoare la Olimpiada Balcanică de Informatică, care a avut loc în perioada desfășurată în orașul Maribor, Slovenia, în ... Post-ul Două medalii de bronz și o mențiune de onoare pentru Republica Moldova la Olimpiada Balcanică de Informatică apare prima dată în Unica.md.\n16:00\n[Valentina Nafornița a devenit mămică: ”Inima mea este plină de iubire acum mai mult ca niciodată!”](/ro/s/14675445) [#](/ro/story/14675445) [Unica.md](/ro/b/unica-md)\nValentina Nafornița a devenit mămică! Soprana a adus pe lume un băiețel. Despre asta a anunțat chiar Valentina pe paagina ei de Instagram, unde a postat și prima fotografie cu ... Post-ul Valentina Nafornița a devenit mămică: ”Inima mea este plină de iubire acum mai mult ca niciodată!” apare prima dată în Unica.md.\n16:00\nMai multe portaluri care au fost recent blocate la inițiativa Serviciului de Informații și Securitate (SIS) au găsit mijloace prin care își continuă activitatea. Directorul SIS Alexandru Musteața a declarat ... Post-ul Portalurile blocate de SIS își continuă activitatea. Ce spun autoritățile apare prima dată în Unica.md.\n15:20\nMinisterul Sănătății a distribuit, astăzi, nouă ambulanțe de tip A unor instituții medico-sanitare din țară. foto simbol Autosanitare au primit spitalele raionale Edineț, Căușeni, Ungheni, Orhei, Soroca, Ceadîr-Lunga, insituțiile republicane ... Post-ul Nouă instituții medicale din țară au fost dotate cu ambulanțe de tip A apare prima dată în Unica.md.\n14:50\n[Unica.md și ITicket v-a pregătit o listă de evenimente pe care să nu le ratați în acest weekend](/ro/s/14675182) [#](/ro/story/14675182) [Unica.md](/ro/b/unica-md)\nWeekendul se apropie cu pași repezi, iar noi suntem aici să te informăm despre cele mai importante evenimente ce vor avea loc. Astfel, Unica.md și iTicket vine cu câteva recomandări ... Post-ul Unica.md și ITicket v-a pregătit o listă de evenimente pe care să nu le ratați în acest weekend apare prima dată în Unica.md.\n14:40\nFederația Rusă încearcă să destabilizeze situația din R. Moldova prin intermediul grupului criminal condus de oligarhul Ilan Șor, a declarat directorul Serviciului de Informații și Securitate (SIS), Alexandru Musteață, scrie ... Post-ul SIS: Partidele afiliate lui Ilan Șor sunt finanțate din Federația Rusă apare prima dată în Unica.md.\n14:10\nDupă ce au avertizat că vor urma proteste în centrul capitalei, transportatorii au și stabilit data și ora acestora. Potrivit unei Declarații prezentate autorității locale, reprezentanții transportatorilor susțin că joi ... Post-ul Pe 9 noiembrie, transportatorii vor ieși la protest, în PMAN apare prima dată în Unica.md.\n14:00\n[Drama unui tânăr de 19 ani, care a făcut cancer după o lovitură la fotbal. Ce spune mama băiatului](/ro/s/14675011) [#](/ro/story/14675011) [Unica.md](/ro/b/unica-md)\nUn simplu accident la un meci de fotbal i-a schimbat radical viața lui Anatol, un tânăr de 19 ani. În timp ce amicii săi își fac planuri pentru viitor, acesta ... Post-ul Drama unui tânăr de 19 ani, care a făcut cancer după o lovitură la fotbal. Ce spune mama băiatului apare prima dată în Unica.md.\n13:50\n[Câți cetățeni trebuie să meargă la vot, pentru ca scrutinul de duminică să fie declarat valabil](/ro/s/14674981) [#](/ro/story/14674981) [Unica.md](/ro/b/unica-md)\nPentru ca alegerile locale de duminică să fie considerate valabile în circumscripție trebuie să participe nu mai puțin de 1/4 din numărul de persoane înscrise în listele electorale, scrie ipn.md ... Post-ul Câți cetățeni trebuie să meargă la vot, pentru ca scrutinul de duminică să fie declarat valabil apare prima dată în Unica.md.\n13:50\n[La Spitalul raional Ungheni va fi deschis un cabinet pentru diagnosticarea cancerului de col uterin](/ro/s/14674980) [#](/ro/story/14674980) [Unica.md](/ro/b/unica-md)\nLa Spitalul raional Ungheni va fi deschis un cabinet pentru diagnosticarea cancerului de col uterin. Cabinetul va dispune de colposcop, unitate de electrochirurgie, sterilizatoare, fotoliu ginecologic, instrumente și mobilier medical, ... Post-ul La Spitalul raional Ungheni va fi deschis un cabinet pentru diagnosticarea cancerului de col uterin apare prima dată în Unica.md.\n13:40\nO nouă alertă cu bombă la sediul Partidului „Șansă”. La fața locului se află oamenii legii, scrie realitatea.md. Zona a fost încercuită, însă evacuarea din parcare este interzisă, anunță liderul ... Post-ul Alertă cu bombă la sediul Partidului „Șansă”. Oamenii legii se afla la fața locului apare prima dată în Unica.md.\n13:40\nAstăzi a avut loc inaugurarea zborurilor aeriene directe Atena -Chișinău operate de compania aeriana elenă AEGEAN, scrie noi.md. La ceremonia oficială de lansare a curselor directe dintre Grecia și Moldova ... Post-ul Zboruri directe Chișinău-Atena apare prima dată în Unica.md.\nIeri\n12:30\n[Erou la 17 ani! Un băiat și-a salvat verișorul de doi ani din incendiu, o casă în flăcări la Dondușeni](/ro/s/14674727) [#](/ro/story/14674727) [Unica.md](/ro/b/unica-md)\nUn minor în vîrstă de 17 ani a salvat din incendiu un copil de 2 ani, anunță Inspectoratul General pentru Situații de Urgență. Un copil de doi ani și jumătate ... Post-ul Erou la 17 ani! Un băiat și-a salvat verișorul de doi ani din incendiu, o casă în flăcări la Dondușeni apare prima dată în Unica.md.\n12:00\nMeteorologii au emis un avertisment COD GALVEN de vânt puternic pentru centrul și nordul țării. Astfel, potrivit Serviciului meteorologi de Stat, în intervalul orelor 06:00-18:00 se prevăd intensificări ale vântului ... Post-ul Cod GALBEN de vânt puternic în țară apare prima dată în Unica.md.\n11:50\nIlan Șor doar și-a schimbat denumirea partidului, iar „ȘANSĂ” reprezintă același grup criminal organizat, a declarat Alexandru Musteața, directorul Serviciului de Informații și Securitate (SIS), într-un briefing de presă, scrie ... Post-ul Câte milioane a cheltuit Șor pentru coruperea alegătorilor. Șeful SIS vine cu detalii apare prima dată în Unica.md.\n11:30\nTehnologiile de construcție modernă oferă multe oportunități de a combina frumusețea și durabilitatea într-o singură structură. Alegerea materialelor de construcție potrivite joacă un rol esențial pentru atingerea acestui obiectiv. Vizitați ... Post-ul Materialele de construcție și estetică: cum să combinăm aspectul și durabilitatea apare prima dată în Unica.md.\n11:20\nCu ajutorul dronei, polițiștii de frontieră au depistat un cetățean al Ucrainei, care în mod fraudulos a intrat în Republica Moldova. În după-amiaza zilei de ieri, 1 noiembrie 2023, străinul ... Post-ul Un ucrainean, surprins cu ajutorul dronei, în timp ce trecea ilegal frontiera de stat apare prima dată în Unica.md.\n11:10\n[12 Medalii de aur, dar și alte distincții, pentru cercetătorii USM la Salonul Internațional Pro INVENT 2023 din România](/ro/s/14674409) [#](/ro/story/14674409) [Unica.md](/ro/b/unica-md)\n12 Medalii de aur, 9 Medalii PRO INVENT și Diplome de Excelență – acestea sunt rezultatele cu care s-au întors cercetătorii USM de la Salonul Internațional al Cercetării Științifice, Inovării și ... Post-ul 12 Medalii de aur, dar și alte distincții, pentru cercetătorii USM la Salonul Internațional Pro INVENT 2023 din România apare prima dată în Unica.md.\n11:00\nFemeile din diferite regiuni ale țării vor avea acces mai bun la servicii de colposcopie pentru depistarea timpurie a leziunilor precanceroase și cancerului de col uterin, datorită înființării rețelei naționale ... Post-ul Femeile din diferite regiuni ale țării vor avea acces mai bun la servicii de colposcopie apare prima dată în Unica.md.\n10:50\n[Maia Sandu numește greșită decizia Teleradio-Moldova de a nu permite candidaților electorali să vorbească în rusă](/ro/s/14674336) [#](/ro/story/14674336) [Unica.md](/ro/b/unica-md)\nȘefa statului Maia Sandu numește greșită decizia Teleradio-Moldova de a nu permite candidaților electorali să vorbească în rusă. Președinta a spus că regulamentele trebuie schimbate, menționând că în Republica Moldova sunt ... Post-ul Maia Sandu numește greșită decizia Teleradio-Moldova de a nu permite candidaților electorali să vorbească în rusă apare prima dată în Unica.md.\n10:50\nCarabinierii Secției Radiomobil Imola, regiunea Bologna din Italia, au denunțat pentru amenințare agravată un cetățean moldovean în vârstă de cincizeci de ani, scrie realitatea.md. S-a întâmplat zilele trecute, când un cetățean a ... Post-ul Un moldovean, denunțat în Italia după ce l-a speriat cu un pistol jucărie pe vecinul său apare prima dată în Unica.md.\n10:20\nFrumoasa Antonia a trăit momente de groază la un concert, când fanii au început să-i arunce cu gheață în cap. Care a fost reacția solistei? Este una dintre cele mai ... Post-ul Antonia, agresată la concert! Fanii i-au aruncat cu gheață în cap apare prima dată în Unica.md.\n©2004—2023\nRepublicarea materialelor este posibila doar cu acordul sursei.\nNews.yam.md. Toate titlurile si continutul stirilor apartin surselor respective.\nRepublicarea materialelor este posibila doar cu acordul sursei.","highlightText":"","highlightTitle":"","highlightThreadTitle":"","language":"romanian","sentiment":null,"categories":null,"external_links":[],"external_images":[],"entities":{"persons":[],"organizations":[],"locations":[]},"rating":null,"crawled":"2023-11-04T13:07:26.125+02:00","updated":"2023-11-04T13:07:26.125+02:00"}