{"thread":{"uuid":"e46e29a8789fc8bf4ed55d9234813e0b9d6f0c75","url":"https://www.bruneinewsgazette.com/agro-industrial-sector-leaders-call-on-new-agriculture-secretary-to-tackle-rice-production-and-export-challenges/","site_full":"www.bruneinewsgazette.com","site":"bruneinewsgazette.com","site_section":"https://bruneinewsgazette.com","site_categories":["media","health","cancer"],"section_title":"Homepage for brunei - Brunei News Gazette","title":"Agro-Industrial Sector Leaders Call on New Agriculture Secretary to Tackle Rice Production and Export Challenges - Brunei News Gazette","title_full":"Agro-Industrial Sector Leaders Call on New Agriculture Secretary to Tackle Rice Production and Export Challenges - Brunei News Gazette","published":"2023-11-03T07:00:00.000+02:00","replies_count":0,"participants_count":1,"site_type":"news","country":"US","main_image":"","performance_score":0,"domain_rank":null,"domain_rank_updated":null,"reach":null,"social":{"facebook":{"likes":0,"comments":0,"shares":0},"gplus":{"shares":0},"pinterest":{"shares":0},"linkedin":{"shares":0},"stumbledupon":{"shares":0},"vk":{"shares":0}}},"uuid":"e46e29a8789fc8bf4ed55d9234813e0b9d6f0c75","url":"https://www.bruneinewsgazette.com/agro-industrial-sector-leaders-call-on-new-agriculture-secretary-to-tackle-rice-production-and-export-challenges/","ord_in_thread":0,"parent_url":null,"author":"admin","published":"2023-11-03T07:00:00.000+02:00","title":"Agro-Industrial Sector Leaders Call on New Agriculture Secretary to Tackle Rice Production and Export Challenges - Brunei News Gazette","text":"MANILA — Upon the appointment of the new Department of Agriculture Secretary Francisco Laurel Jr., key figures in the agro-industrial sector have issued urgent calls for action to address pressing issues affecting agricultural productivity in the Philippines. According to Philippines News Agency, president of the Philippine Chamber of Agriculture and Food Inc. (PCAFI), in a recent interview, the primary concern for Secretary Laurel should be to address the stagnant production of rice, which has led to a spike in retail prices and has been a contributing factor to the country's inflation. Fausto emphasizes that rice is a politically sensitive commodity and that stabilizing supply to control prices must be a priority. Fausto also highlighted the need for revitalization in the Philippines' export market for fruits and other high-value crops, which currently revolves predominantly around bananas, coconut, mango, and pineapple. He noted the presence of a significant untapped market for other agricultural products such as 'ube' (purple yam) and durian but pointed out the lack of local momentum to meet these potential demands. Elias Jose Inciong, president of the United Broiler Raisers Association (UBRA), has urged the new secretary to streamline the acquisition process for avian influenza (AI) vaccines. Unlike the African swine fever (ASF) vaccines, which are still undergoing international trials, AI vaccines are readily available abroad. Inciong reported difficulties due to bureaucratic hurdles in importing these vaccines, a matter compounded by the fact that some local poultries have been driven to purchase vaccines through online platforms such as Lazada and Shopee, raising concerns about the vaccines' origins and efficacy. With the approach of the winter season, and the expected arrival of migratory birds that may carry new strains of AI, Inciong stresses the immediate need for the effective distribution of vaccines to the poultry industry. Adding to the chorus, Edwin Chen, the past president of the Pork Producers Federation of the Philippines (PPFP), called for expedited approval of ASF vaccines for local swine farms. With the ASF epidemic continuing to affect the country, he suggests an enhancement of inter-agency collaboration between the DA and the Department of Health (DOH). Chen also emphasized the need for national harmonization of quarantine rules, as the current unsynchronized regulations across various local government units hinder the pork industry, urging for a designated final authority to provide clear, unified direction. These leaders represent a sector keen on seeing the newly appointed Secretary of Agriculture take decisive and immediate action to bolster a crucial component of the nation's economy and food security.","highlightText":"","highlightTitle":"","highlightThreadTitle":"","language":"english","sentiment":null,"categories":null,"external_links":[],"external_images":[],"entities":{"persons":[{"name":"francisco laurel jr.","sentiment":"none"},{"name":"fausto","sentiment":"none"},{"name":"laurel","sentiment":"none"}],"organizations":[{"name":"brunei news gazette","sentiment":"none"},{"name":"new agriculture","sentiment":"none"},{"name":"department of agriculture","sentiment":"none"},{"name":"philippines news agency","sentiment":"none"},{"name":"philippine chamber of agriculture and food inc.","sentiment":"none"}],"locations":[{"name":"manila","sentiment":"none"},{"name":"philippines","sentiment":"none"}]},"rating":null,"crawled":"2023-11-04T13:07:47.489+02:00","updated":"2023-11-04T13:07:47.489+02:00"}