{"thread":{"uuid":"e6271e5d0cf581e8e50526a00e4d514e4f07a435","url":"https://www.cancelloedarnonenews.it/fabio-cirella-nuovo-direttore-del-centro-ester-in-arrivo-nuove-opportunita-per-sport-sociale-e-cultura/","site_full":"www.cancelloedarnonenews.it","site":"cancelloedarnonenews.it","site_section":"http://www.cancelloedarnonenews.it/feed","site_categories":[],"section_title":"CancelloedArnoneNews","title":"Fabio Cirella nuovo direttore del Centro Ester: in arrivo nuove opportunità per sport, sociale e cultura","title_full":"Fabio Cirella nuovo direttore del Centro Ester: in arrivo nuove opportunità per sport, sociale e cultura","published":"2023-11-04T10:49:00.000+02:00","replies_count":0,"participants_count":1,"site_type":"news","country":"IT","main_image":"","performance_score":0,"domain_rank":null,"domain_rank_updated":null,"reach":null,"social":{"facebook":{"likes":0,"comments":0,"shares":0},"gplus":{"shares":0},"pinterest":{"shares":0},"linkedin":{"shares":0},"stumbledupon":{"shares":0},"vk":{"shares":0}}},"uuid":"e6271e5d0cf581e8e50526a00e4d514e4f07a435","url":"https://www.cancelloedarnonenews.it/fabio-cirella-nuovo-direttore-del-centro-ester-in-arrivo-nuove-opportunita-per-sport-sociale-e-cultura/","ord_in_thread":0,"parent_url":null,"author":"Name","published":"2023-11-04T10:49:00.000+02:00","title":"Fabio Cirella nuovo direttore del Centro Ester: in arrivo nuove opportunità per sport, sociale e cultura","text":"Fabio Cirella nuovo direttore del Centro Ester: in arrivo nuove opportunità per sport, sociale e cultura\nSvolta manageriale al Centro Ester. L’arrivo di Fabio Cirella, con il ruolo di direttore generale, inaugura un nuovo corso per l’Associazione di Barra che continua a ritagliarsi spazi importanti nella vita sportiva e sociale nella zona ad est di Napoli.\n“Fabio Cirella è la persona giusta per realizzare i progetti che abbiamo in mente per rendere il Centro Ester sempre più un polo di aggregazione per quanti lo scelgono per vivere lo sport o i momenti culturali nel modo giusto” spiega il presidente Pasquale Corvino.\n“Il mio arrivo -spiega Cirella- è il punto di partenza per un ammodernamento del Centro Ester. L’idea è quella di dare un’impronta manageriale all’impresa sportiva. Ottimizzando al meglio gli spazi dedicati agli sport già esistenti, inserendo quelli di tendenza e moltiplicando le altre occasioni per trascorrere qui il tempo libero”.\nUn progetto che ricalca la visione moderna dello sport intrapresa anche negli ultimi anni da De Laurentiis per il calcio Napoli. Per questo occorre avere un’esperienza maturata nella crescita aziendale: “Ho iniziato il mio percorso in un importante studio di commercialisti per poi passare ad un’azienda romana del gruppo Marzotto che si occupava degli spazi nelle Grandi Stazioni italiane. Qui mi occupavo di risorse umane. Una volta ritornato a Napoli dopo 12 anni nella Capitale è cominciata la collaborazione con Pasquale Corvino”.\nProgetti innovativi che entusiasmano chi ha fatto del lavoro la sua passione: “Dopo essermi occupato del ramo abbigliamento, un po’ alla volta ho cominciato a dare il mio supporto anche alla parte amministrativa del Centro Ester”. Poi durante l’estate arriva il nuovo ruolo: “Sono pronto a mettere a disposizione la mia esperienza per realizzare una crescita a questa azienda attraverso anche il massimo sviluppo delle risorse umane. Con il presidente Corvino abbiamo una visione comune dell’impronta da imprimere”.\nLavoro in team per un risultato comune: “Oggi il Centro Ester si divide fra sport, sociale e network. Mette insieme anche una rete di imprenditori che ha a cuore lo sviluppo dei progetti e dobbiamo fare in modo da prendere il meglio da quest’esperienza. Nel giro di un anno le novità saranno ben visibili. Un percorso in sintonia con i responsabili dei vari settori sportivi, anche loro chiamati a dare un supporto indispensabile per il perfetto funzionamento di tutti i reparti. Ampia visibilità a novità come il paddle e l’area food, c’è tanto da lavorare e siamo tutti pronti a fare la nostra parte” conclude Fabio Cirella.\nLe novità non sono finite come sottolinea il presidente Pasquale Corvino: “In questa stagione ci avvarremo della consulenza di un gigante delle strategie di impresa che aggiungerà qualità al nostro impegno”.\nRoberto Esse\nCRONACA/INFORMAZIONEViews 22","highlightText":"","highlightTitle":"","highlightThreadTitle":"","language":"italian","sentiment":null,"categories":null,"external_links":[],"external_images":[],"entities":{"persons":[],"organizations":[],"locations":[]},"rating":null,"crawled":"2023-11-04T13:07:25.485+02:00","updated":"2023-11-04T13:07:25.485+02:00"}