{"thread":{"uuid":"ea728394e7bfa3e37b8428403ba6ad73e691b291","url":"https://www.ruetir.com/2023/11/expo-dubai-accelerating-preparations-to-welcome-the-world-to-cop28/","site_full":"www.ruetir.com","site":"ruetir.com","site_section":"https://www.ruetir.com/feed","site_categories":["under_construction","non_standard_content"],"section_title":"Ruetir","title":"Expo Dubai...accelerating preparations to welcome the world to COP28 - Ruetir","title_full":"Expo Dubai...accelerating preparations to welcome the world to COP28 - Ruetir","published":"2023-11-04T13:07:00.000+02:00","replies_count":0,"participants_count":1,"site_type":"news","country":"US","main_image":"https://images.skynewsarabia.com/images/v1/2023/11/02/1666881/95/53/1-1666881.jpg","performance_score":0,"domain_rank":156985,"domain_rank_updated":"2023-10-31T12:16:08.000+02:00","reach":null,"social":{"facebook":{"likes":0,"comments":0,"shares":0},"gplus":{"shares":0},"pinterest":{"shares":0},"linkedin":{"shares":0},"stumbledupon":{"shares":0},"vk":{"shares":0}}},"uuid":"ea728394e7bfa3e37b8428403ba6ad73e691b291","url":"https://www.ruetir.com/2023/11/expo-dubai-accelerating-preparations-to-welcome-the-world-to-cop28/","ord_in_thread":0,"parent_url":null,"author":"Ruetir","published":"2023-11-04T13:07:00.000+02:00","title":"Expo Dubai...accelerating preparations to welcome the world to COP28 - Ruetir","text":"Several plans are being worked on in cooperation with specialized teams from local concerned authorities in Dubai and federal authorities to ensure easy transportation of guests and smooth entry into the Blue Zone in Expo City. Buses have also been allocated to transport visitors and participants to the Green Zone. While the site of the global event, which is hosted by the UAE during the period from November 30 to December 12, 2023, includes two areas, a “blue” one designated for official delegations, and a “green” one open to the public, non-official organizations and other participants, for the first time in the COP sessions. The green zone is adjacent to the blue zone to allow decision-makers and officials to interact with individuals, students, and community institutions and work closely with them so that the results of the conference are close to people’s aspirations and needs for real, effective work for the benefit of our generation and future generations. Hind Al Muhairi, Director of Special Projects Department – Expo City Dubai, told the Emirates News Agency, WAM, that the UAE seeks to inspire the local and international community to work together with the aim of establishing effective practices to achieve sustainability, in addition to strengthening global efforts aimed at confronting environmental and climate challenges. She added that, on the other hand, Expo City Dubai provides a model of a city that embraces sustainable urban life, especially with the presence of expertise and competencies that place it at the forefront of leading destinations in this field. Hosting the COP28 conference confirms that the goal is common and the message is the same, which is to work towards achieving environmental sustainability and confronting… Climate change challenges. She pointed out that, based on the UAE’s approach based on cooperation and joint work to unify efforts and reach practical solutions that can be applied, various programs and initiatives have been prepared so that hosting the conference will be a distinguished platform that embodies the country’s endeavors to find realistic solutions to the problems of emissions, food waste, energy, water, and others, and to unify efforts. Aiming to achieve environmental and climate sustainability. She said that in order to convey the message of the COP28 climate conference and convey its activities to the whole world, spaces and places designated for the media have been prepared throughout the site for filming and holding meetings, including a media center in the Blue Zone and another in the Green Zone, both of which are equipped with all the necessary technologies, including a fast Internet connection. Studios services, and other matters aimed at facilitating the task of media professionals and enabling them to perform them, pointing out that media outlets can use media centers on the condition of registering and obtaining official media accreditation. Regarding the plans to receive and facilitate visitors’ access to the event site, Hind Al Muhairi stated that, in addition to being located near the most important main roads and being easily accessible from Dubai and Abu Dhabi by car, Expo City Dubai is fully connected to the public transportation network, as it includes a metro station and public transportation buses can reach it. Accessible from various areas of Dubai. She indicated that there are several plans being developed in cooperation with specialized teams from the relevant local and federal authorities to ensure easy transportation of guests and smooth entry into the Blue Zone in Expo City, pointing to the allocation of transport buses to transport visitors and participants to the Green Zone. Regarding benefiting from the experiences gained from organizing Expo 2020, Al Muhairi said that the UAE organized the first international Expo to be held in the Middle East, Africa and South Asia region, and succeeded in bringing together 192 countries, and 24.1 million visitors were welcomed to the event site and more than 251.2 million visits. Virtually, over a period of 6 months between October 2021 and March 2022. She added, “We presented an international and exceptional Expo and harnessed the best technologies that provided a seamless experience for visitors. We were able to unite global efforts to take effective measures and decisions on many issues important to humanity.” She continued that Expo City is an example and product of the UAE’s commitment to sustainability, and said: “Since the beginning of our journey within the framework of Expo 2020 Dubai, we have worked in the planning and design stages to create a sustainable Dubai Expo City site, and we have kept in mind from the beginning of the work the necessity of building a new city that will be a model for the cities of the future.” …a city with ambitious goals, with a focus on making our environmental footprint low and taking into account the principles of respecting the environment and natural resources, reducing their pollution, and reducing carbon emissions.” She added that Expo City Dubai was built according to the highest environmental standards and was prepared to be a global and sustainable platform with the aim of enhancing work and unifying efforts aimed at achieving environmental and climate sustainability. She stressed that Expo City Dubai is the sustainable city of the future that places human service as its focus, and takes clear steps to stimulate work and achieve carbon neutrality, and was designed to be a model of sustainable urban planning based on innovation, pointing out that the city is adopting an ambitious map to achieve sustainability that is consistent with the goals of the United Nations. For sustainable development by 2030, the UAE Strategic Initiative for Climate Neutrality 2050, and the UAE Centennial 2071.","highlightText":"","highlightTitle":"","highlightThreadTitle":"","language":"english","sentiment":null,"categories":null,"external_links":[],"external_images":[],"entities":{"persons":[{"name":"hind al muhairi","sentiment":"none"}],"organizations":[{"name":"wam","sentiment":"none"},{"name":"emirates news agency","sentiment":"none"}],"locations":[{"name":"dubai","sentiment":"none"},{"name":"blue zone","sentiment":"none"},{"name":"uae","sentiment":"none"},{"name":"expo city","sentiment":"none"},{"name":"expo city dubai","sentiment":"none"},{"name":"green zone","sentiment":"none"}]},"rating":null,"crawled":"2023-11-04T13:10:58.468+02:00","updated":"2023-11-04T13:10:58.468+02:00"}