{"thread":{"uuid":"f06e57554b4798de41cc5b74c8a29f01da69b747","url":"https://glamsham.com/world/health-lifestyle/10-ai-generated-innovative-indian-dishes","site_full":"glamsham.com","site":"glamsham.com","site_section":"https://www.glamsham.com/rss","site_categories":[],"section_title":"Glamsham","title":"10 AI generated innovative Indian dishes","title_full":"10 AI generated innovative Indian dishes","published":"2023-11-04T12:19:00.000+02:00","replies_count":0,"participants_count":1,"site_type":"news","country":null,"main_image":"https://glamsham.com/wp-content/uploads/2023/11/202311043079332.jpg","performance_score":0,"domain_rank":102794,"domain_rank_updated":"2023-10-31T12:16:03.000+02:00","reach":null,"social":{"facebook":{"likes":0,"comments":0,"shares":0},"gplus":{"shares":0},"pinterest":{"shares":0},"linkedin":{"shares":0},"stumbledupon":{"shares":0},"vk":{"shares":0}}},"uuid":"f06e57554b4798de41cc5b74c8a29f01da69b747","url":"https://glamsham.com/world/health-lifestyle/10-ai-generated-innovative-indian-dishes","ord_in_thread":0,"parent_url":null,"author":"Agency News Desk","published":"2023-11-04T12:19:00.000+02:00","title":"10 AI generated innovative Indian dishes","text":"New Delhi, Nov 4 (IANSlife) Within the world of culinary ingenuity and originality, the blending of diverse culinary heritages has given rise to exceptional dishes that pleasantly surprise taste buds with unforeseen flavours and mouthwatering textures.\nBased on insights from the delishUp food trends report — India’s pioneering AI-powered smart cooking device — in 11 urban centers, which involved 3000 households and over 15,000 cooking sessions conducted here are some curated compilations of ten AI-generated inventive Indian recipes that individuals are presently exploring.\nThese dishes perfectly represent the seamless melding of an array of gastronomic influences and beyond.\nSpiced Tandoori Croissants: Soft and flaky croissants infused with Indian spices and grilled to perfection in a tandoor.\nMango Chutney Bruschetta: Crispy bread slices topped with sweet and tangy mango chutney, a delightful fusion of Italian and Indian flavours.\nPaneer Tikka Tacos: Succulent paneer tikka stuffed into soft tacos, garnished with mint chutney and fresh veggies.\nCoconut Curry Risotto: Creamy Italian risotto infused with the rich flavours of Indian coconut curry.\nMasala Wonton Dumplings: Delicate wonton wrappers filled with a spicy masala mixture, served with a zesty dipping sauce.\nGulab Jamun Cheesecake: A decadent cheesecake with a layer of miniature gulab jamun, offering a fusion of Indian and Western desserts.\nTandoori Quinoa Salad: Nutrient-packed quinoa salad with tandoori-marinated vegetables and a yogurt-based dressing.\nCurry Leaf Pesto Pasta: A fusion of Indian curry leaves and Italian pesto sauce served over al dente pasta.\nSaffron-infused Sushi: Sushi rolls featuring saffron-tinged rice and a variety of Indian-inspired fillings.\nButter Chicken Pizza: A thin-crust pizza topped with butter chicken, mozzarella cheese, and a drizzle of creamy tomato sauce.\nRecipes you can try in the comfort of your home…\nSpiced Tandoori Croissants Recipe\nPreparation Time: 30 minutes\nCooking Time: 15 minutes\nYields: 6 croissants\nIngredients\nFor the Marinade:\n1 cup plain yogurt\n2 tablespoons tandoori masala spice blend\n1 tablespoon ginger-garlic paste\n1 teaspoon red chilli powder (adjust to your spice preference)\n1/2 teaspoon turmeric powder\nSalt, to taste\n2 tablespoons vegetable oil\nFor the Croissants:\n6 croissant rolls\n200 grams boneless chicken, thinly sliced (or use paneer for a vegetarian option)\n1 tablespoon vegetable oil\n1 teaspoon cumin seeds\n1 bell pepper, thinly sliced\n1 onion, thinly sliced\nFresh cilantro leaves, for garnish\nInstructions\nMarinate the Chicken (or Paneer):\nIn a mixing bowl, combine the yogurt, tandoori masala, ginger-garlic paste, red chilli powder, turmeric, salt, and vegetable oil.\nAdd the sliced chicken (or paneer), ensuring it’s well coated in the marinade. Cover and refrigerate for at least 1 hour (longer for better flavour).\nPreheat the Oven:\nPreheat your oven to 180°C (350°F).\nCook the Marinated Chicken (or Paneer):\nIn a skillet, heat 1 tablespoon of vegetable oil over medium heat.\nAdd the cumin seeds and let them sizzle for a few seconds.\nAdd the marinated chicken (or paneer) and cook until it’s fully cooked and slightly charred. Remove from heat.\nPrepare the Croissants:\nSlice each croissant in half horizontally, creating a top and bottom portion.\nAssemble the Tandoori Croissants:\nPlace a generous amount of the cooked chicken (or paneer) inside the croissant.\nAdd slices of bell pepper and onion.\nClose the croissant.\nBake:\nPlace the assembled croissants on a baking sheet or in an oven-safe dish.\nBake in the preheated oven for about 10-12 minutes or until the croissants are lightly toasted.\nServe:\nRemove the tandoori croissants from the oven and garnish with fresh cilantro leaves.\nEnjoy:\nServe your spiced tandoori croissants hot as a delightful, fusion-style snack or meal.\nGulab Jamun Cheesecake Recipe\nPreparation Time: 30 minutes\nChilling Time: 4 hours\nServes: 8-10\nIngredients\nFor the Gulab Jamun:\n10-12 store-bought or homemade gulab jamuns\nGhee or oil for frying (if not using store-bought)\nFor the Cheesecake Base:\n1 1/2 cups of crushed digestive biscuits or graham crackers\n1/4 cup melted butter\nFor the Cheesecake Filling:\n16 oz (450g) cream cheese, at room temperature\n1/2 cup granulated sugar\n1 teaspoon vanilla extract\n2 large eggs\n1/4 cup sour cream\n1/4 cup all-purpose flour\nFor the Gulab Jamun Syrup:\n1 cup granulated sugar\n1 cup water\n4-5 green cardamom pods, crushed\nA few saffron strands (optional)\n1/2 teaspoon rose water\nInstructions:\nFor the Gulab Jamun:\nIf using store-bought gulab jamuns, skip to step 4. If making homemade gulab jamuns, follow your preferred recipe or use a ready-made mix. Shape the dough into small balls and deep-fry them in ghee or oil until they are golden brown. Drain and set aside.\nPrepare the sugar syrup for the gulab jamun. In a separate pan, combine the sugar and water, add crushed cardamom pods, saffron strands (if using), and rose water. Simmer for about 10 minutes until it forms a slightly thick syrup. Remove from heat and let it cool.\nOnce the fried gulab jamuns have cooled slightly, gently immerse them in the sugar syrup. Let them soak for at least 30 minutes.\nFor the Cheesecake Base:\nCrush the digestive biscuits or graham crackers into fine crumbs. You can use a food processor or place them in a ziplock bag and crush them with a rolling pin.\nCombine the crumbs with the melted butter, mixing until the crumbs are evenly coated.\nPress this mixture into the base of a 9-inch springform pan, creating an even layer. Place the pan in the refrigerator to set it while you prepare the filling.\nFor the Cheesecake Filling:\nIn a large bowl, beat the cream cheese and sugar until smooth and creamy.\nAdd the eggs one at a time, mixing well after each addition.\nStir in the vanilla extract, sour cream, and all-purpose flour. Mix until the batter is smooth.\nAssembling the Cheesecake:\nPreheat your oven to 325 degree F (160 degree C).\nRemove the springform pan from the refrigerator and arrange the soaked gulab jamuns on top of the biscuit base.\nPour the cheesecake filling over the gulab jamuns, ensuring it’s evenly distributed.\nBake the cheesecake in the preheated oven for about 45-50 minutes or until the edges are set, but the center still has a slight jiggle.\nFor the Gulab Jamun Topping:\nWhile the cheesecake is cooling, you can reduce the remaining sugar syrup from the gulab jamuns to a thicker consistency.\nOnce the cheesecake has cooled to room temperature, refrigerate it for at least 4 hours or overnight.\nBefore serving, pour the thickened sugar syrup over the cheesecake.\nSlice, serve, and enjoy your delectable Gulab Jamun Cheesecake!\n(IANSlife can be contacted at ianslife@ians.in)\n–IANS\nianslife/ lh/ tb","highlightText":"","highlightTitle":"","highlightThreadTitle":"","language":"english","sentiment":null,"categories":null,"external_links":[],"external_images":[],"entities":{"persons":[],"organizations":[],"locations":[{"name":"new delhi","sentiment":"none"},{"name":"india","sentiment":"none"}]},"rating":null,"crawled":"2023-11-04T13:06:53.969+02:00","updated":"2023-11-04T13:06:53.969+02:00"}