{"thread":{"uuid":"f2aa50b31d64717f8323d455e751dfb66fcbcc71","url":"http://www.bing.com/news/apiclick.aspx?ref=FexRss&aid&tid=65461f9ebd5e4eb397e55b82fa9921e4&url=https://nypost.com/2023/10/24/lifestyle/how-queens-we-will-rock-you-could-replace-insulin-injections-for-diabetics-study/&c=12463267277877837292&mkt=en-us","site_full":"www.bing.com","site":"bing.com","site_section":"https://www.deleciousfood.com","site_categories":["search_engine","tech"],"section_title":"deleciousfood -","title":"How Queen’s ‘We Will Rock You’ Could Replace Insulin Shots for Diabetics: Study - deleciousfood","title_full":"How Queen’s ‘We Will Rock You’ Could Replace Insulin Shots for Diabetics: Study - deleciousfood","published":"2023-11-04T12:42:00.000+02:00","replies_count":0,"participants_count":1,"site_type":"news","country":"US","main_image":"https://nypost.com/wp-content/uploads/sites/2/2023/10/rock-you-1.gif?w=1024","performance_score":0,"domain_rank":104,"domain_rank_updated":"2023-10-31T12:15:27.000+02:00","reach":null,"social":{"facebook":{"likes":0,"comments":0,"shares":0},"gplus":{"shares":0},"pinterest":{"shares":1},"linkedin":{"shares":0},"stumbledupon":{"shares":0},"vk":{"shares":0}}},"uuid":"f2aa50b31d64717f8323d455e751dfb66fcbcc71","url":"http://www.bing.com/news/apiclick.aspx?ref=FexRss&aid&tid=65461f9ebd5e4eb397e55b82fa9921e4&url=https://nypost.com/2023/10/24/lifestyle/how-queens-we-will-rock-you-could-replace-insulin-injections-for-diabetics-study/&c=12463267277877837292&mkt=en-us","ord_in_thread":0,"parent_url":null,"author":"deleciousfood","published":"2023-11-04T12:42:00.000+02:00","title":"How Queen’s ‘We Will Rock You’ Could Replace Insulin Shots for Diabetics: Study - deleciousfood","text":"How Queen’s ‘We Will Rock You’ Could Replace Insulin Shots for Diabetics: Study [Pizza](https://www.deleciousfood.com/category/pizza/)| [No Comments](https://www.deleciousfood.com/how-queens-we-will-rock-you-could-replace-insulin-shots-for-diabetics-study-4/#respond) Can we beat diabetes? A study published in the journal Lancet Diabetes & Endocrinology suggests that Queen’s “We Will Rock You” could potentially help treat diabetes. Scientists have designed a cell that can release the hormone insulin in response to music – in the hope that these cells can eventually be implanted into people with diabetes as a replacement for their regular injections. Better insulin delivery for diabetics Insulin is an essential hormone produced by the pancreas that helps the body convert food into energy and control blood sugar levels. In diabetic patients, the body does not produce enough insulin and/or does not use insulin properly. When this happens, too much sugar remains in the blood, which can eventually lead to serious health problems such as heart disease, vision loss or kidney disease, according to the Centers for Disease Control and Prevention. Hoping to find a way to manage diabetes without regular injections, scientists at ETH Zurich in Switzerland have designed implantable insulin-producing cells that patients can control outside the body, regulating when The hormone is released. Human pancreatic beta cells, which make and release insulin, have been genetically modified in the laboratory to respond to sound waves. Channels on the cell surface allow calcium particles circulating in the blood to enter the cell, and the cell releases insulin in response. The cells needed four hours to “fill up” with insulin – an activity that the researchers said “would match the typical needs of people with diabetes consuming three meals a day.” The researchers placed the modified cells in a capsule made from a material intended for human implantation and introduced it into diabetic mice. The cells would only be activated by specifically targeted sound – perhaps delivered through a speaker placed on the patient’s abdomen – and not by ambient noise. But what sound would work best to supercharge the cell? The queen reigned supreme over insulin-producing cells The scientists played various songs at different sound levels to test the release of insulin into cells. Classical music and guitar were somewhat provocative, while environmental sounds such as lawn mowers, as well as speech, barely moved the needle. However, it was Queen’s “We Will Rock You” at a volume of 85 decibels – as loud as a blender – that caused the strongest insulin release. The researchers played the role of Queen in tests on mice, showing that the cells released almost 70% of their insulin within five minutes and all of it within 15 minutes – a rate similar to the natural release of pancreatic cells. Meanwhile, mice without the implant still had high blood sugar levels. Blood sugar levels also remained high when music was played too far away. Plans are currently underway to conduct similar studies in human subjects, the researchers said. While the study is in its early stages and testing in humans is planned, it is currently unclear whether researchers have been able to study the real-world implications. The Post has requested further comment.","highlightText":"","highlightTitle":"","highlightThreadTitle":"","language":"english","sentiment":"positive","categories":["Health","Science and Technology"],"external_links":[],"external_images":[],"entities":{"persons":[],"organizations":[{"name":"lancet diabetes & endocrinology","sentiment":"none"}],"locations":[]},"rating":null,"crawled":"2023-11-04T13:11:05.852+02:00","updated":"2023-11-04T13:11:05.852+02:00"}