{"thread":{"uuid":"804e58e70a24f9775153a38970c5815e3436a0d2","url":"https://forums.canadiancontent.net/threads/hamas-attacks-israel.178870/page-19","site_full":"forums.canadiancontent.net","site":"canadiancontent.net","site_section":"https://forums.canadiancontent.net/forums/in-the-news.111/","site_categories":["politics","law_government_and_politics","adult","non_standard_content"],"section_title":"In The News","title":"Hamas attacks Israel | Page 19","title_full":"Hamas attacks Israel | Page 19","published":"2023-11-04T05:01:00.000+02:00","replies_count":5,"participants_count":3,"site_type":"discussions","country":"US","main_image":"","performance_score":0,"domain_rank":95254,"domain_rank_updated":"2023-10-31T12:15:58.000+02:00","reach":null,"social":{"facebook":{"likes":0,"comments":0,"shares":0},"gplus":{"shares":0},"pinterest":{"shares":0},"linkedin":{"shares":0},"stumbledupon":{"shares":0},"vk":{"shares":0}}},"uuid":"f5d54600686eb8b0ee9b1dc382a6df426f8539ee","url":"https://forums.canadiancontent.net/threads/hamas-attacks-israel.178870/page-19#post-3","ord_in_thread":3,"parent_url":null,"author":"Ron in Regina","published":"2023-11-04T06:50:00.000+02:00","title":"","text":"Hamas has prepared for a long, drawn-out war in the Gaza Strip and believes it can hold up Israel's advance long enough to force its arch enemy to agree to a ceasefire, two sources close to the organization's leadership said.\nHamas, which rules Gaza, has stockpiled weapons, missiles, food and medical supplies, according to the people, who declined to be named due to the sensitivity of the situation. The group is confident its thousands of fighters can survive for months in a city of tunnels carved deep beneath the Palestinian enclave and frustrate Israeli forces with urban guerrilla tactics, the people told Reuters.\nIs it a crime to support Hamas? What pro-Palestinian supporters need to know about Gaza rulers — National Post Is waving a Hamas flag a crime? Can someone be charged for expressing support for Hamas in Canada? What you need to know about the Gaza rulers apple.news Ultimately, Hamas believes international pressure for Israel to end the siege, as civilian casualties mount, could force a ceasefire and a negotiated settlement that would see the militant group emerge with a tangible concession such as the release of thousands of Palestinian prisoners in exchange for Israeli hostages, the sources said.\n'What a joke': Trudeau slammed after seemingly calling for Israeli ceasefire then backtracking — Yahoo News Canada The Canadian prime minister told reporters on Friday \"we need ceasing of the levels of violence\" and a \"humanitarian pause\" in Gaza. apple.news The group has made it clear to the U.S. and Israel at indirect, Qatar-mediated hostage negotiations that it wants to force such a prisoner release in exchange for hostages, according to four Hamas officials, a regional official and a person familiar with the White House's thinking.\nWARMINGTON: No apologies for wrongly blaming Israel for hospital blast So now that U.S. President Joe Biden has made it clear Israel was not behind the bombing of a Gaza hospital where and when is the protest for those who was responsible? torontosun.com Hamas has about 40,000 fighters, according to the sources at the group. They can move around the enclave using a vast web of fortified tunnels , hundreds of kilometers long and up to 80 meters deep, built over many years.\nMichael Higgins: Mélanie Joly sees the tragedy of Gaza — but not the evil behind it — National Post The problem with a humanitarian truce is that it would be seen as the prelude to a ceasefire, and thus leave Hamas still operating apple.news Hamas, which is designated a terrorist movement by Israel, the US and the EU, called for the destruction of Israel in its 1988 founding charter.\nIn a subsequent document known as its 2017 charter, the group accepted for the first time the idea of a Palestinian state within the 1967 borders claimed by Israel after the Six Day War , although the group did not explicitly recognize Israel's right to exist.\nInsight: How Hamas aims to trap Israel in Gaza quagmire — Reuters Hamas has prepared for a long, drawn-out war in the Gaza Strip and believes it can hold up Israel's advance long enough to force its arch enemy to agree to a ceasefire, two sources close to the organization's leadership said. apple.news","highlightText":"","highlightTitle":"","highlightThreadTitle":"","language":"english","sentiment":null,"categories":null,"external_links":null,"external_images":[],"entities":{"persons":[],"organizations":[],"locations":[]},"rating":null,"crawled":"2023-11-04T13:11:32.898+02:00","updated":"2023-11-04T13:11:32.898+02:00"}