{"thread":{"uuid":"fc379b19ac5b3ae292efec454057d54a0d0f9129","url":"https://newsrnd.com/news/2023-11-04-be-sure-to-take-precautions-%E2%80%93-top-3-vitamins-for-autumn.H1-JnIsXmp.html","site_full":"newsrnd.com","site":"newsrnd.com","site_section":"https://www.newsrnd.com","site_categories":["media"],"section_title":"The Limited Times","title":"Be sure to take precautions – Top 3 vitamins for autumn - The Limited Times","title_full":"Be sure to take precautions – Top 3 vitamins for autumn - The Limited Times","published":"2023-11-04T13:10:00.000+02:00","replies_count":0,"participants_count":1,"site_type":"news","country":"US","main_image":"https://www.merkur.de/bilder/2022/09/09/91777586/29803351-vitamine-top-versorgt-durch-herbst-winter-vitamnid3-c-zink-kinder-veganer-sportler-2nKL7WJugCfe.jpg","performance_score":0,"domain_rank":42325,"domain_rank_updated":"2023-10-31T12:15:50.000+02:00","reach":null,"social":{"facebook":{"likes":0,"comments":0,"shares":0},"gplus":{"shares":0},"pinterest":{"shares":0},"linkedin":{"shares":0},"stumbledupon":{"shares":0},"vk":{"shares":0}}},"uuid":"fc379b19ac5b3ae292efec454057d54a0d0f9129","url":"https://newsrnd.com/news/2023-11-04-be-sure-to-take-precautions-%E2%80%93-top-3-vitamins-for-autumn.H1-JnIsXmp.html","ord_in_thread":0,"parent_url":null,"author":"Anonym","published":"2023-11-04T13:10:00.000+02:00","title":"Be sure to take precautions – Top 3 vitamins for autumn - The Limited Times","text":"Status: 04.11.2023, 11:57 a.m.\nBy: Nina Dudek\nCommentsShare\nVitamins for autumn and winter contain a concentrated load of immune power. © MarkoAliaksandr/PantherMedia\nAutumn and winter are among the seasons with the most colds. A timely supply of vitamins strengthens the immune system and can help to stay healthy.\nNote to our readers: We create product comparisons and deals for you. To make this possible, we receive a commission from affiliates. This does not change anything for you.\nEvery year we know this phenomenon: summer is coming to an end, the first cool evenings herald autumn – and we are already sitting at home with a scratchy throat and a cold. Children, sensitive people or athletes are particularly susceptible and should therefore support their immune system at an early stage.\nEspecially in times of the Corona pandemic, it is important for particularly vulnerable population groups to take special care of themselves. A sufficient – and above all timely – supply of the right vitamins can help you to optimally support the immune system and thus prevent possible diseases in autumn and winter*.\nWhat vitamins are important in autumn? Basically, the same applies in autumn as it does for the rest of the year: your body needs a balanced mix of vitamins and minerals. If you eat a balanced diet according to the recommendations of the German Nutrition Society, you will usually be able to do so. \"5 a day\" is the motto, i.e. five servings of fruit and vegetables a day. However, autumn and winter also challenge our immune system and therefore it can help to put a few, selected vitamins in the foreground of the diet in autumn and, if necessary, to supplement them with dietary supplements.\nVitamin C for Autumn & Winter: To Suck for Kids & Vegans Vitamins for autumn and winter: 2 delicious lozenges a day are enough. © sanotact\nHigh-dose vitamin C from the acerola cherry, which also tastes good to children from the age of four with its fine cherry aroma. Just two tablets a day are enough and children find it much easier to suck than to swallow whole tablets. In addition, you should pay attention to a diet rich in vitamin C in order to be optimally supplied.\n180 tablets from €22.95\nOrder Vitamin C Lozenges\nHot Citones: Homemade or Ready-to-Use? Many rely on vitamin C from fresh lemons. In fact, 100 grams of juice contains about half of the daily vitamin C requirement. The problem with this type of homemade hot lemon is that part of the vitamin is destroyed in the hot water. Ready-made hot lemon preparations, on the other hand, are dosed so high that the loss is not significant.\nVitamin C for Autumn & Winter: For People with Sensitive Stomachs Vitamin C for people with irritable bowel syndrome. © Glory Feel\nThis special vitamin C supplement is buffered. This means that the acidic vitamin C is bound to minerals and is therefore more tolerable and also suitable for people with sensitive stomachs.\n365 tablets from €23.97\nOrder Buffered Vitamin C\nVitamins for Autumn & Winter: When Are They Useful? Pharmacists, doctors and experts agree: vitamins in the form of dietary supplements should not be taken without caution. In any case, it is advisable to consult your family doctor or pharmacist before you take so-called supplements yourself.\nHowever, some populations need additional vitamins and minerals because their bodies are subject to special requirements. In addition to pregnant and breastfeeding women, this also includes senior citizens, vegans and vegetarians as well as competitive athletes and smokers.\nVitamin D for Autumn & Winter: Clever Combination Drops for Children These vitamins for autumn and winter can also be \"hidden\" in food. © True to nature\n80 percent of the \"sunshine vitamin\" is absorbed through sunlight. And this is rare in autumn and winter. The combination of vitamin D3 with vitamin K2 is particularly effective, because it supports the effect of vitamin D3 by activating proteins and thus making them usable in the first place. Drops are great to \"hide\" in yoghurt or muesli and are ideal for children.\nSaver subscription from €17.99\nOrder Vitamin D3+K Drops\nVitamin D for autumn and winter: D3 + K2 highly concentrated with depot effect You only need to take these vitamins for autumn and winter every 5 days. © Natural Elements\nThis combination preparation is so high in dosage that you only need to take one capsule every five days. One capsule contains a high dose of 5,000 IU (125 μg) of vitamin D3 and 100 μg of vitamin K2 MK-7 – ideal if you don't want to take daily supplements.\n180 tablets from €19.79\nOrder Vitamin C Depot\nZinc for autumn and winter: Particularly high bioavailability This zinc preparation can be used particularly well. © Glory Feel\nZinc is essential for our metabolism. The trace element is said to be able to block the receptors of the main viruses responsible for a flu-like infection and thus prevent adhesion to the mouth and nose. Zinc bisglycinate is an organic zinc compound that has a particularly high bioavailability for absorption in the body.\n400 tablets from €18.97\nOrder zinc bisglycinate\nDoes your child have trouble swallowing larger tablets or capsules? Many capsules can be divided in half and the contents easily disappear into the yoghurt. The same applies to tablets that can be crushed into powder. But always \"hide\" in cold foods so that the effect is preserved.\nEditor's Choice\nZinc for Autumn & Winter: High-dose shortening of the cold season Zinc 25 mg high-dose vegan © Vitamize\nZinc can also help if you are already suffering from the first symptoms of a flu-like effect, because it can curb the multiplication of the pathogens. The German Apotheker Zeitung reports that the duration of colds can be shortened by timely intake of high-dose zinc from a dosage of 75 mg per day.\nPrice for 180 tablets from €16.97\nOrder high doses of zinc\n*Please note The information in this guide is for informational purposes only and is not a substitute for medical advice, diagnosis or treatment. Food supplements are not a substitute for a balanced and varied diet and a healthy lifestyle. The use of dietary supplements should always be discussed with your doctor or a qualified health advisor. The use of dietary supplements is at your own risk and responsibility.","highlightText":"","highlightTitle":"","highlightThreadTitle":"","language":"english","sentiment":"positive","categories":["Health","Science and Technology","Human Interest"],"external_links":[],"external_images":[],"entities":{"persons":[{"name":"nina dudek","sentiment":"negative"}],"organizations":[],"locations":[]},"rating":null,"crawled":"2023-11-04T13:11:56.622+02:00","updated":"2023-11-04T13:11:56.622+02:00"}