{"thread":{"uuid":"ff75cf33e4b88ff32f299829b14a50dc1b83ba70","url":"https://www.ghanaweb.com/GhanaHomePage/NewsArchive/NPP-Primaries-What-an-insult-Delegate-fumes-over-alleged-meager-GH-400-offer-from-Bawumia-s-camp-1874942","site_full":"www.ghanaweb.com","site":"ghanaweb.com","site_section":"http://www.ghanaweb.com/feed/newsfeed.xml","site_categories":["media"],"section_title":"GhanaWeb News","title":"NPP Primaries: What an insult! – Delegate fumes over alleged ‘meager GH¢400’ offer from Bawumia's camp","title_full":"NPP Primaries: What an insult! – Delegate fumes over alleged ‘meager GH¢400’ offer from Bawumia's camp","published":"2023-11-04T13:01:00.000+02:00","replies_count":0,"participants_count":0,"site_type":"news","country":"NL","main_image":"https://cdn.ghanaweb.com/imagelib/pics/366/36668722.jpg","performance_score":0,"domain_rank":8158,"domain_rank_updated":"2023-10-31T12:15:27.000+02:00","reach":null,"social":{"facebook":{"likes":0,"comments":0,"shares":0},"gplus":{"shares":0},"pinterest":{"shares":0},"linkedin":{"shares":0},"stumbledupon":{"shares":0},"vk":{"shares":0}}},"uuid":"ff75cf33e4b88ff32f299829b14a50dc1b83ba70","url":"https://www.ghanaweb.com/GhanaHomePage/NewsArchive/NPP-Primaries-What-an-insult-Delegate-fumes-over-alleged-meager-GH-400-offer-from-Bawumia-s-camp-1874942","ord_in_thread":0,"parent_url":null,"author":null,"published":"2023-11-04T13:01:00.000+02:00","title":"NPP Primaries: What an insult! – Delegate fumes over alleged ‘meager GH¢400’ offer from Bawumia's camp","text":"Politics of Saturday, 4 November 2023\nSource:\n[www.ghanaweb.com](/GhanaHomePage/aboutus.php)\nA New Patriotic Party (NPP) delegate, who introduced himself as Sir Collins, has expressed intense frustration and disappointment in Vice President Dr. Mahamudu Bawumia and his team. This dissatisfaction stems from the alleged offer of what Collins described as a 'paltry' GH¢400 to the delegates.\nIn an interview with GHOne TV, Collins expressed his strong dissatisfaction, describing it as an insult, that Dr. Bawumia, who aspires to be the party's flagbearer, offered delegates a meager GH¢400 each. Collins pointed out the disparity in resources and support, questioning why another contender, Kennedy Agyapong, who reportedly has less support from government appointees and the party's rank and file, offered GH¢300.\nA livid Collins argued that the GH¢100 difference between Bawumia and Agyapong's offers is unacceptable, and the vice president should have offered a significantly higher amount.\n“I voted for Ken,” he said in the Twi language as he proceeded to give his reason. “Bawumia has the support of ministers, MCEs and government officials yet they gave us GH¢400 while Ken gave us GH¢300. That’s an insult. How can you have the support of everyone and give us GH¢400 when an individual Ken is giving us GH¢300?”\nVisibly angry, Collins questioned why delegates received between GH¢20,000 and GH¢40,000 during the Super Delegates Conference held in August to reduce the number of aspirants from ten to four. He emphasized that the delegates participating in the November 4 primaries have a crucial role to play in the upcoming 2024 presidential elections and should receive better treatment.\nHe said: “You’ve been in power for eight years and you give me a paltry GH¢400? How much did you even give the constituency executives during the super delegates conference? We are the ones who will do the house-to-house campaign and you’re giving us GH¢400.”\n“Why were some delegates given 20,000 between 40,000 to vote and when it got to our turn, you gave GH¢400? Is that not an insult?”\nCollins further alleged that he, along with other party members, has faced repeated threats. He expressed his disappointment in the lack of support, despite being a dedicated party member who believed his network within the party would help in having his requests fulfilled.\n“People are intimidating us despite being party members,” he claimed. “I voted when I was 18 years old. In 1992, I voted and I’ve since been a delegate. Regardless, securing an educational scholarship for my child has been problematic. I know a lot of people in authority at the Jubilee House who have refused to help me in that regard.\"\nThe NPP is holding a crucial election to choose its flagbearer for the upcoming 2024 general elections in Ghana. This election is significant as it aims to break the traditional eight-year election cycle pattern in the country.\nThere are four contenders in this flagbearer race. Among them, Vice President Dr. Mahamudu Bawumia is considered a frontrunner while Kennedy Ohene Agyapong, the Member of Parliament for Assin Central, is expected to be a strong competitor, particularly after his surprising second-place finish in the party's Super Delegates Conference, which took place in August.\nThe rest are former Food and Agric Minister, Dr. Owusu Akoto Afriyie, and former Member of Parliament, Francis Addai-Nimoh.\nOne of the delegates has alleged that the vice president’s team is giving some GHc400 to them which describes as insulting.— GHOne TV (@GHOneTV)\nAccording to him, for Ken Agyepong to give them GHc300, makes the Vice President’s gesture insulting.\n[#NPPDecides] [#ElectionHub] [pic.twitter.com/V31glf5YI5] [November 4, 2023]","highlightText":"","highlightTitle":"","highlightThreadTitle":"","language":"english","sentiment":"negative","categories":["Politics","Social Issue","Human Interest"],"external_links":[],"external_images":[],"entities":{"persons":[{"name":"collins","sentiment":"none"},{"name":"agyapong","sentiment":"none"},{"name":"mahamudu bawumia","sentiment":"none"},{"name":"ken","sentiment":"none"},{"name":"kennedy agyapong","sentiment":"none"},{"name":"bawumia","sentiment":"none"}],"organizations":[],"locations":[{"name":"bawumia","sentiment":"none"}]},"rating":null,"crawled":"2023-11-04T13:11:38.717+02:00","updated":"2023-11-04T13:11:38.717+02:00"}